#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьСтруктуруШаблонаЧека(ПараметрыШаблонаЧека, ДополнительныйТекст = "", ТипОборудования = "") Экспорт
	
	ХранилищеШаблона = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыШаблонаЧека.ШаблонЧека, "Шаблон");
	СтруктураХранилища = ХранилищеШаблона.Получить();
	
	Если СтруктураХранилища = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НовыеПараметрыЧека = Новый Структура;
	
	Для Каждого ВходящийПараметр Из ПараметрыШаблонаЧека Цикл
		
		Если ВходящийПараметр.Ключ = "ПозицииЧека" Тогда
			НовыеПараметрыЧека.Вставить("ПозицииЧека", Новый Массив);
		Иначе
			НовыеПараметрыЧека.Вставить(ВходящийПараметр.Ключ, ВходящийПараметр.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	НовыйТипШаблона = Ложь;
	СКД = Неопределено;
	
	Если ТипОборудования = "ККТ"
		ИЛИ ТипОборудования = "ПринтерЧеков" Тогда
			ИнициализироватьПараметрыШаблона(ПараметрыШаблонаЧека, НовыйТипШаблона, СКД);
	КонецЕсли;
	
	Если НовыйТипШаблона Тогда
		
		Если СКД = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ТаблицаДанных = ПечатьФискальныхЧеков.ТаблицаСКД(СКД, ПараметрыШаблонаЧека.ДокументОснование);
		ШаблонДерево = СтруктураХранилища.Шаблон;
		КоличествоСтрокТабличнойЧасти = 0;
		
		Для Каждого СтрокаДерева Из ШаблонДерево.Строки Цикл
			
			Если СтрокаДерева.ИмяКолонки = "ФискальныйДокумент" Тогда
				
				Для Каждого СтрокаЧека Из СтрокаДерева.Строки Цикл
					
					Если СтрокаЧека.ИмяКолонки = "СоставЧека" Тогда
						
						Для Каждого СтрокаОсновногоРаздела Из СтрокаЧека.Строки Цикл
							ПечатьФискальныхЧеков.ОбработатьСоставЧека(НовыеПараметрыЧека, СтрокаОсновногоРаздела,
								ТаблицаДанных, ПараметрыШаблонаЧека.ПозицииЧека);
						КонецЦикла;
						
					КонецЕсли;
					
				КонецЦикла;
				
			ИначеЕсли СтрокаДерева.ИмяКолонки = "НефискальныйДокумент" Тогда
				
				НовыйНефискальныйДокумент = Новый Структура;
				НовыйНефискальныйДокумент.Вставить("ПозицииЧека", Новый Массив);
				НовыйНефискальныйДокумент.Вставить("ДокументОснование", НовыеПараметрыЧека.ДокументОснование);
				
				Для Каждого СтрокаЧека Из СтрокаДерева.Строки Цикл
					
					Если СтрокаЧека.ИмяКолонки = "СоставЧека" Тогда
						
						Для Каждого СтрокаОсновногоРаздела Из СтрокаЧека.Строки Цикл
							ПечатьФискальныхЧеков.ОбработатьСоставЧека(НовыйНефискальныйДокумент,
								СтрокаОсновногоРаздела, ТаблицаДанных, ПараметрыШаблонаЧека.ПозицииЧека);
						КонецЦикла;
							
						КонецЕсли;
						
					КонецЦикла;
					
				Если НовыйНефискальныйДокумент.ПозицииЧека.Количество() > 0 Тогда
					НовыеПараметрыЧека.НефискальныеДокументы.Добавить(НовыйНефискальныйДокумент.ПозицииЧека);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		СтруктураШаблонаЧека = Новый Структура;
		СтруктураШаблонаЧека.Вставить("Шапка", Новый Массив);
		СтруктураШаблонаЧека.Вставить("МассивТекстаСтрокиШапки", Новый Массив);
		СтруктураШаблонаЧека.Вставить("МассивТекстаСтрокиПодвал", Новый Массив);
		СтруктураШаблонаЧека.Вставить("Подвал", Новый Массив);
		СтруктураШаблонаЧека.Вставить("ОднаФискальнаяСтрока", Ложь);
		СтруктураШаблонаЧека.Вставить("ФискальнаяСтрокаБезПечати", Ложь);
		
		ТаблицаИсходная_Количество = ПараметрыШаблонаЧека.ПозицииЧека.Количество();
		
		Для Итератор = 0 По ТаблицаИсходная_Количество - 1 Цикл
			
			СтруктураШаблонаЧека.МассивТекстаСтрокиШапки.Добавить(Новый Массив);
			СтруктураШаблонаЧека.МассивТекстаСтрокиПодвал.Добавить(Новый Массив);
			
		КонецЦикла;
		
		СтруктураШаблонаЧека.ФискальнаяСтрокаБезПечати = Истина;
		
		МассивТекстаСтрокиШапки = Новый Массив;
		МассивТекстаСтрокиПодвал = Новый Массив;
		
		ПараметрыМакета = Новый Структура;
		ПараметрыМакета.Вставить("СхемаКомпоновкиДанных", Неопределено);
		ПараметрыМакета.Вставить("КомпоновщикМакета", Неопределено);
		ПараметрыМакета.Вставить("КэшМакетов", Неопределено);
		
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ПараметрыШаблонаЧека.ДокументОснование);
		Шаблон = МенеджерОбъекта.МакетФискальногоЧека(ПараметрыШаблонаЧека.ДокументОснование,
			СтруктураХранилища.Шаблон, СтруктураХранилища.ШиринаЧека, ПараметрыМакета);
		СтруктураХранилища.Вставить("Шаблон", Шаблон);
		СтруктураХранилища.Вставить("СоставнойМассив", Новый Массив);
		
		СтруктураШаблонаЧека.Вставить("Шапка", ПечатьФискальныхЧеков.НапечататьСтроки(СтруктураХранилища, "Шапка"));
		
		Для Итератор = 0 По ТаблицаИсходная_Количество - 1 Цикл
			
			МассивСтрокиШапки = ПечатьФискальныхЧеков.НапечататьСтроки(СтруктураХранилища,
				СтрШаблон("ТелоШапка_%1",Итератор));
			МассивТекстаСтрокиШапки.Добавить(МассивСтрокиШапки);
			МассивСтрокиПодвал = ПечатьФискальныхЧеков.НапечататьСтроки(СтруктураХранилища,
				СтрШаблон("ТелоПодвал_%1", Итератор));
			МассивТекстаСтрокиПодвал.Добавить(МассивСтрокиПодвал);
			
		КонецЦикла;
		
		СтруктураШаблонаЧека.Вставить("Подвал", ПечатьФискальныхЧеков.НапечататьСтроки(СтруктураХранилища, "Подвал"));
		СтруктураШаблонаЧека.Вставить("МассивТекстаСтрокиШапки", МассивТекстаСтрокиШапки);
		СтруктураШаблонаЧека.Вставить("МассивТекстаСтрокиПодвал", МассивТекстаСтрокиПодвал);
		СтруктураШаблонаЧека.ОднаФискальнаяСтрока = СтруктураХранилища.ОднаФискальнаяСтрока;
	
		// Печатаем строки чека   
			
		МассивТекстаСтрокиШапки		= СтруктураШаблонаЧека.МассивТекстаСтрокиШапки;
		МассивТекстаСтрокиПодвал	= СтруктураШаблонаЧека.МассивТекстаСтрокиПодвал;
		МассивШапкаЧека				= СтруктураШаблонаЧека.Шапка;
		МассивПодвалЧека			= СтруктураШаблонаЧека.Подвал;
		ОднаФискальнаяСтрока		= СтруктураШаблонаЧека.ОднаФискальнаяСтрока;
		ФискальнаяСтрокаБезПечати	= СтруктураШаблонаЧека.ФискальнаяСтрокаБезПечати;
		
		ИтогПоЧеку = 0;
		ПроцентСкидки = 0;
		НомерСекции = 0;
		
		// Печать шапки чека.
		Для Каждого СтрокаШапки Из МассивШапкаЧека Цикл
			
			ПечатьФискальныхЧеков.ДополнитьПараметрыЧека(НовыеПараметрыЧека, СтрокаШапки);
			НовыеПараметрыЧека.Вставить("ПечатьКлише", Ложь);
			
		КонецЦикла;
		
		// Товарный состав
		Для ИндексМассива = 0 По ТаблицаИсходная_Количество - 1 Цикл
			
			СтрокаИсходная = ПараметрыШаблонаЧека.ПозицииЧека[ИндексМассива];
			
			Если СтрокаИсходная.Свойство("ФискальнаяСтрока") Тогда
			
				// Печать шапки строки.
				Для Каждого СтрокаШапки Из МассивТекстаСтрокиШапки[ИндексМассива] Цикл
					ПечатьФискальныхЧеков.ДополнитьПараметрыЧека(НовыеПараметрыЧека, СтрокаШапки);
				КонецЦикла;
				
				Если ОднаФискальнаяСтрока Тогда
					
					Сумма = ?(СтрокаИсходная.Свойство("Сумма"), СтрокаИсходная.Сумма, 0);
					ИтогПоЧеку = ИтогПоЧеку + Сумма;
					
				Иначе
					
					Если ФискальнаяСтрокаБезПечати Тогда
						Наименование = "";
					Иначе
						Наименование  = ?(СтрокаИсходная.Свойство("Наименование") , СтрокаИсходная.Наименование, "");
					КонецЕсли;
					
					Количество		= ?(СтрокаИсходная.Свойство("Количество"),СтрокаИсходная.Количество, 1);
					Цена			= ?(СтрокаИсходная.Свойство("Цена"),СтрокаИсходная.Цена, 0);
					Сумма			= ?(СтрокаИсходная.Свойство("Сумма"), СтрокаИсходная.Сумма, 0);
					НомерСекции		= ?(СтрокаИсходная.Свойство("НомерСекции"), СтрокаИсходная.НомерСекции , 0);
					СтавкаНДС		= ?(СтрокаИсходная.Свойство("СтавкаНДС"), СтрокаИсходная.СтавкаНДС, 0);
					
					СтрокаПозицииЧека = Новый Структура;
					СтрокаПозицииЧека.Вставить("ФискальнаяСтрока");
					СтрокаПозицииЧека.Вставить("Наименование", Наименование);
					СтрокаПозицииЧека.Вставить("Количество", Количество);
					СтрокаПозицииЧека.Вставить("Цена", Цена);
					СтрокаПозицииЧека.Вставить("Сумма", Сумма);
					СтрокаПозицииЧека.Вставить("НомерСекции", НомерСекции);
					СтрокаПозицииЧека.Вставить("СтавкаНДС", СтавкаНДС);
					
					НовыеПараметрыЧека.ПозицииЧека.Добавить(СтрокаПозицииЧека);
					
				КонецЕсли;
				
				// Печать подвала строки.
				Для Каждого СтрокаПодвала Из МассивТекстаСтрокиПодвал[ИндексМассива] Цикл
					ПечатьФискальныхЧеков.ДополнитьПараметрыЧека(НовыеПараметрыЧека,СтрокаПодвала);
				КонецЦикла;
				
			Иначе
				
				СтрокаПозицииЧека = Новый Структура;
				Для Каждого ПолеИсходное Из СтрокаИсходная Цикл
					СтрокаПозицииЧека.Вставить(ПолеИсходное.Ключ, ПолеИсходное.Значение);
				КонецЦикла;
				НовыеПараметрыЧека.ПозицииЧека.Добавить(СтрокаПозицииЧека);
				
			КонецЕсли;
			
		КонецЦикла;
			
		// если одна фискальная строка в чеке.
		Если ОднаФискальнаяСтрока Тогда
			
			СтрокаПозицииЧека = Новый Структура;
			СтрокаПозицииЧека.Вставить("ФискальнаяСтрока");
			СтрокаПозицииЧека.Вставить("Наименование",НСтр("ru='Всего:'"));
			СтрокаПозицииЧека.Вставить("Количество", 1);
			СтрокаПозицииЧека.Вставить("Цена", ИтогПоЧеку);
			СтрокаПозицииЧека.Вставить("Сумма", ИтогПоЧеку);
			СтрокаПозицииЧека.Вставить("НомерСекции", НомерСекции);
			СтрокаПозицииЧека.Вставить("СтавкаНДС", 0);
			НовыеПараметрыЧека.ПозицииЧека.Добавить(СтрокаПозицииЧека);
			
		КонецЕсли;
		
		// Печать подвала чека.
		Для Каждого СтрокаПодвала Из МассивПодвалЧека Цикл
			ПечатьФискальныхЧеков.ДополнитьПараметрыЧека(НовыеПараметрыЧека,СтрокаПодвала);
		КонецЦикла;
		
		Если НЕ ПустаяСтрока(ДополнительныйТекст) Тогда
			ПечатьФискальныхЧеков.ДополнитьПараметрыЧека(НовыеПараметрыЧека,ДополнительныйТекст);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НовыеПараметрыЧека;
	
КонецФункции

// Устанавливает видимость элементов формы по доступному оборудованию на текущем рабочем месте
//
Процедура УстановитьВидимостьЭлементовПоДоступномуПодключаемомуОборудованию(Элементы, ЭлементыТСД="", ЭлементыВесы="") Экспорт
	
	// отключить видимость элементов
	МассивЭлементыТСД  = СтрРазделить(ЭлементыТСД, ",", Ложь);
	Для Каждого ИмяЭлемента Из МассивЭлементыТСД Цикл
		Элементы[СокрЛП(ИмяЭлемента)].Видимость = Ложь;
	КонецЦикла;
	МассивЭлементыВесы = СтрРазделить(ЭлементыВесы, ",", Ложь);
	Для Каждого ИмяЭлемента Из МассивЭлементыВесы Цикл
		Элементы[СокрЛП(ИмяЭлемента)].Видимость = Ложь;
	КонецЦикла;
	
	Если Не УправлениеНебольшойФирмойПовтИсп.ИспользоватьПодключаемоеОборудование() Тогда
		Возврат;
	КонецЕсли;
	
	// установить видимость элементов по доступному оборудованию
	СписокОборудованияОтбор = МенеджерОборудованияКлиентСервер.СписокОборудованияОтбор();
	СписокОборудованияОтбор.ТипыПО.ЭлектронныеВесы     = Истина;
	СписокОборудованияОтбор.ТипыПО.ТерминалСбораДанных = Истина;
	СписокОборудования = МенеджерОборудования.СписокОборудования(СписокОборудованияОтбор);
	Для Каждого ЭлементОборудования Из СписокОборудования Цикл
		Если ЭлементОборудования.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных Тогда
			Для Каждого ИмяЭлемента Из МассивЭлементыТСД Цикл
				Элементы[СокрЛП(ИмяЭлемента)].Видимость = Истина;
			КонецЦикла;
		ИначеЕсли ЭлементОборудования.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ЭлектронныеВесы Тогда
			Элементы.ЗапасыПолучитьВес.Видимость = Истина;
			Для Каждого ИмяЭлемента Из МассивЭлементыВесы Цикл
				Элементы[СокрЛП(ИмяЭлемента)].Видимость = Истина;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьПараметрыШаблона(ПараметрыШаблонаЧека,НовыйТипШаблона, СКД)
	
	СКД = ПараметрыШаблонаЧека.ШаблонЧека.СхемаКомпоновкиДанных.Получить();
	НовыйТипШаблона = Истина;
	
КонецПроцедуры

#КонецОбласти