
#Область ОписаниеПеременных

&НаКлиенте
Перем СтруктураЗаписейПараметровУчета;

&НаКлиенте
Перем ВыводилисьДанныеДляБанка;

#КонецОбласти


///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		
		Если ЗначениеЗаполнено(Параметры.Организация) Тогда
			Объект.Организация = Параметры.Организация;
		Иначе
			Организация = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.ТекущийПользователь(), "ОсновнаяОрганизация");
			Если Не ЗначениеЗаполнено(Организация) Тогда
				Организация = Справочники.Организации.ПредопределеннаяОрганизация();
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.СобытиеКалендаря) Тогда
		Объект.СобытиеКалендаря = Параметры.СобытиеКалендаря;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.СостояниеСобытия) Тогда
		
		Если ЗначениеЗаполнено(Параметры.СостояниеСобытия) Тогда
			
			Объект.СостояниеСобытия = Параметры.СостояниеСобытия;
			
		Иначе
			
			Объект.СостояниеСобытия = КалендарьОтчетности.ПолучитьСостояниеСобытияКалендаря(
				Объект.Организация,
				Объект.СобытиеКалендаря);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОбъектНалогообложения = РегламентированнаяОтчетностьУСН.ОбъектНалогообложенияНаДату(Объект.Организация,Объект.СобытиеКалендаря);
	Если ОбъектНалогообложения = Перечисления.ВидыОбъектовНалогообложения.ДоходыМинусРасходы Тогда
		ВидВзаиморасчетов = Справочники.ВидыНалогов.АвансовыйПлатежПриУСНРасходы;
	Иначе
		ВидВзаиморасчетов = Справочники.ВидыНалогов.АвансовыйПлатежПриУСН;
	КонецЕсли;
	
	ДатыСобытия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.СобытиеКалендаря, "ДатаДокументаОбработкиСобытия,ДатаОкончанияСобытия,ДатаНачалаДокументов,ДатаОкончанияДокументов");
	
	ДокументВзаиморасчетовСБюджетом = РегламентированнаяОтчетностьУСН.ПолучитьДокументВзаиморасчетовСБюджетом(
		Объект.Организация,
		ВидВзаиморасчетов,
		ДатыСобытия.ДатаДокументаОбработкиСобытия,
		ДатыСобытия.ДатаОкончанияСобытия,
		Истина);
		
	Элементы.ГруппаСтрокаРасчетУведомление.Видимость = Ложь; 
	Элементы.ГруппаСтрокаРасчетУведомлениеПоказатели.Видимость = Ложь;	
	
	УпрощенныйЗачетФиксированныхВзносов = РегламентированнаяОтчетностьУСН.УпрощенныйЗачетФиксированныхВзносов(
	Объект.Организация,	ДатыСобытия.ДатаДокументаОбработкиСобытия);

	ПолучитьДанныеОтчетности(); 	
	
	Элементы.ГруппаУплатыЧерезБанкОписание.Видимость = Ложь;
	Элементы.ГруппаУплатыЧерезКассуОписание.Видимость = Ложь;
	Если ДатыСобытия.ДатаДокументаОбработкиСобытия > Дата('20200401')
		И ДатыСобытия.ДатаДокументаОбработкиСобытия < Дата('20210101') 
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "ПоддержкаИП") Тогда
		Элементы.ДекорацияНалоговыйВычет.Видимость = Истина;
		Элементы.ДекорацияМинус4.Видимость = Истина;
		Элементы.СуммаНалоговыхВычетов.Видимость = Истина;
		Элементы.ДекорацияТекстОписаниеНалоговыйВычет.Видимость = Истина;   
	ИначеЕсли ВзносСДоходовАП + ВзносПоЕдиномуТарифуАП > 0 Тогда
		Элементы.ДекорацияНалоговыйВычет.Видимость = Истина;
		Элементы.ДекорацияМинус4.Видимость = Истина;
		Элементы.СуммаНалоговыхВычетов.Видимость = Истина;
		Элементы.ДекорацияТекстОписаниеНалоговыйВычет2023.Видимость = Истина;     
		
		СобытиеВзносСДоходов = 
		Обработки.ОбработкиНалоговИОтчетности.ПолучитьСобытиеКалендаряПоВносамИПДоходы(
		ДатыСобытия.ДатаОкончанияДокументов, Истина);   
		
		СобытиеВзносПоЕдиномуТарифу = 
		Обработки.ОбработкиНалоговИОтчетности.ПолучитьСобытиеКалендаряПоВносамИПДоходы(
		ДатыСобытия.ДатаОкончанияДокументов);		
		Элементы.ДоляДоходовПоУСН.Видимость = ДоляДоходовПоУСН < 100 И ДоляДоходовПоУСН <> 0;
		Элементы.ВзносОплаченные.Видимость = СуммаСтраховыхВзносовАП <> 0; 
		
		//сумма уплаченных взносов в шапке
		Элементы.ДекорацияМинус3.Видимость = Ложь;                  
		Элементы.ДекорацияСуммаСтраховыхВзносовЕН.Видимость = Ложь; 
		Элементы.ДекорацияОтступ9.Видимость = Ложь; 	
		Элементы.СуммаСтраховыхВзносовЕН.Видимость = Ложь; 
	Иначе
		Элементы.ДекорацияНалоговыйВычет.Видимость = Ложь;
		Элементы.ДекорацияМинус4.Видимость = Ложь;
		Элементы.СуммаНалоговыхВычетов.Видимость = Ложь;
		Элементы.ДекорацияТекстОписаниеНалоговыйВычет.Видимость = Ложь;  
		Элементы.ГруппаВзносыПодлежащиеУплате.Видимость = Ложь;
		Элементы.ДоляДоходовПоУСН.Видимость = Ложь; 
		Элементы.ВзносОплаченные.Видимость = Ложь; 
	КонецЕсли;
	
	ПериодЗадачиПредставление = ПредставлениеПериода(
	ДатыСобытия.ДатаНачалаДокументов,
	КонецДня(ДатыСобытия.ДатаОкончанияДокументов),
	"ФП=Истина"); 
	
	ПериодСобытия = ДатыСобытия.ДатаОкончанияСобытия;
	
	ПлательщикЕНП = РегламентированнаяОтчетностьУСН.ПлательщикЕНП(
	Объект.Организация,
	ПериодСобытия);
	
	ЗаписьКалендаря = Справочники.ЗаписиКалендаряПодготовкиОтчетности.ПолучитьЗаписьКалендаря(Объект.Организация,Объект.СобытиеКалендаря);
	
	ПодаетсяУведомлениеПоНалогуЗаПериод = ?(ПериодСобытия >= '20220701',
	Истина,
	Ложь);
	
	ЗаполнитьУведомления();
	УправлениеФормойБлокУведомление();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.Ознакомиться") Тогда
		
		Элементы.СтраницаАвансовогоПлатежа.ТекущаяСтраница = Элементы.РезультатРасчета;
		
	ИначеЕсли Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.Уплатить") Тогда
		
		Элементы.СтраницаАвансовогоПлатежа.ТекущаяСтраница = Элементы.УплатаАвансовогоПлатежа;
		
	Иначе
		
		Элементы.СтраницаАвансовогоПлатежа.ТекущаяСтраница = Элементы.ЗадачаВыполнена;
		
	КонецЕсли;
	
	НазначитьКнопкуПоУмолчаниюИУстановитьЗаголовок();
	
	ВыводилисьДанныеДляБанка = Ложь;
	
	УстановитьВидимостьИДоступностьЭлементов();  
	
	//провека начисление за 1 квартал 
	Если ПериодСобытия = '20240725' Тогда
		НачисленияКРегистрации = ПроверитьОбновитьНачислениеНалогаПоДоходамУСНПСН();
		
		Если НачисленияКРегистрации.Количество() > 0 Тогда  
			
			Для Каждого Начисления Из НачисленияКРегистрации Цикл 
				Если Начисления.СуммаНачисления = "нет" Тогда
					ТекстИнформации = " отсутствует документ ""Начисление налогов""";
				Иначе
					ТекстИнформации = " есть документ ""Начисление налогов"" на сумму - " + Начисления.СуммаНачисления;
				КонецЕсли;
				
				ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='По уведомлению за 1 квартал на сумму - %1 %2	
				|Создать/обновить его автоматически?'"), 
				Начисления.СуммаВзаиморасчетовСБюджетом, ТекстИнформации);
				ОписаниеОповещения = Новый ОписаниеОповещения("ПриОтветеНаВопросОСозданииНачислениеНалогов",
				ЭтаФорма, НачисленияКРегистрации);
				Кнопки = Новый СписокЗначений;
				Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru='Создать автоматически'"));
				Кнопки.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru='Отмена'"));  			
			КонецЦикла;
			
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки,,КодВозвратаДиалога.Да, НСтр("ru='Сумма уведомления не совпадает с начислением налога'"));
			
		КонецЕсли;  
	КонецЕсли;
	//провека начисление за 1 квартал

	
КонецПроцедуры


Функция ПроверитьОбновитьНачислениеНалогаПоДоходамУСНПСН()
	
	Возврат Обработки.ОбработкиНалоговИОтчетности.ПроверитьОбновитьНачислениеНалогаПоДоходамУСНПСН(Объект.Организация);
	
КонецФункции


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеСостоянияСобытияКалендаря" Тогда
		Если Параметр = Объект.СобытиеКалендаря
				И Источник <> ЭтаФорма
				И Окно<> Неопределено
				И Не Окно.Основное Тогда
			Закрыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ


&НаКлиенте
Процедура УплатаЧерезБанк(Команда)
	Элементы.ГруппаУплатыЧерезБанкОписание.Видимость = Истина;
	Элементы.ГруппаУплатыЧерезКассуОписание.Видимость = Ложь;
	Элементы.УплатаЧерезБанк.Шрифт = Новый Шрифт(Элементы.УплатаЧерезБанк.Шрифт,,,Истина);
	Элементы.УплатаЧерезКассу.Шрифт = Новый Шрифт(Элементы.УплатаЧерезКассу.Шрифт,,,Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УплатаЧерезКассу(Команда)
	Элементы.ГруппаУплатыЧерезБанкОписание.Видимость = Ложь;
	Элементы.ГруппаУплатыЧерезКассуОписание.Видимость = Истина;
	Элементы.УплатаЧерезБанк.Шрифт = Новый Шрифт(Элементы.УплатаЧерезБанк.Шрифт,,,Ложь);
	Элементы.УплатаЧерезКассу.Шрифт = Новый Шрифт(Элементы.УплатаЧерезКассу.Шрифт,,,Истина);
КонецПроцедуры

&НаКлиенте
Процедура СтраницыРезультатаРасчетаПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "РезультатРасчетаПредставляение" Тогда
		// Возможно необходимо перерасчет
		// пересчитаем
		ОбновитьРасчет();
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура Пересчитать(Команда) 
	
	КлючФоновогоЗадания = "ОбновлениеЗадачОтчетности";
	Если Объект.Организация <> Неопределено Тогда 
		КлючФоновогоЗадания = КлючФоновогоЗадания + Объект.Организация.УникальныйИдентификатор();
	КонецЕсли;
	
	ОчиститьСообщения();
	ЕстьАктивныеФоновыеЗаданияОбновлениеЗадачОтчетности = КалендарьОтчетности.ЕстьАктивныеФоновыеЗаданияОбновлениеЗадачОтчетности(КлючФоновогоЗадания);
	Если ЕстьАктивныеФоновыеЗаданияОбновлениеЗадачОтчетности Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "В данный момент выполняется обновление и расчет задач календаря отчетности. Повторите позже.";
		Сообщение.Сообщить();		
		Возврат;
	КонецЕсли;
	
	ОбновитьРасчет();
	
КонецПроцедуры   

&НаКлиенте
Процедура ОтразитьРасходыВПрограмме(Команда)
	
	
	Если ВсегоКУплате = 0 Тогда
		ПоказатьПредупреждение(,НСтр("ru='Сумма нулевая. Уплата не требуется.'"));
		Возврат;
	КонецЕсли;
	
	
	ДанныеПоНачислениям = Новый Массив;
	Если РегламентированнаяОтчетностьУСН.ПлательщикЕНП(Объект.Организация, ПериодСобытия) Тогда
		ДанныеПоНачислениям.Добавить(Новый Структура("НачислениеНалогов,Сумма,Представление", ДокументВзаиморасчетовСБюджетом, ВсегоКУплате, НСтр("ru='Единый налоговый платеж'")));	
	Иначе
		ДанныеПоНачислениям.Добавить(Новый Структура("НачислениеНалогов,Сумма,Представление", ДокументВзаиморасчетовСБюджетом, ВсегоКУплате, НСтр("ru='Авансовый платеж УСН'")));
	КонецЕсли;
	
	ОткрытьФорму(
		"Обработка.ОбработкиНалоговИОтчетности.Форма.ГрупповаяРегистрацияРасходов",
		Новый Структура(
			"Организация,ДанныеПоНачислениям, СобытиеКалендаря", 
			Объект.Организация,
			ДанныеПоНачислениям,Объект.СобытиеКалендаря));
	
КонецПроцедуры


&НаКлиенте
Процедура СуммаДоходовЗаГодЕННажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПериодПараметр = КалендарьОтчетностиПовтИсп.ПолучитьСтандартныйПериодДокументовДляСобытия(Объект.СобытиеКалендаря);
	
	ОткрытьФорму(
		"Отчет.ДоходыРасходы.ФормаОбъекта",
		Новый Структура("Организация,СформироватьПриОткрытии, Период,ВидОтчета", Объект.Организация, Истина, ПериодПараметр, "Доходы"));
КонецПроцедуры

&НаКлиенте
Процедура СуммаРасходовЗаГодЕННажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ОбъектНалогообложения = ПредопределенноеЗначение("Перечисление.ВидыОбъектовНалогообложения.Доходы") Тогда
		
		СпсКнопок = Новый СписокЗначений;
		СпсКнопок.Добавить(КодВозвратаДиалога.Да, НСтр("ru='Показать расходы'"));
		СпсКнопок.Добавить(КодВозвратаДиалога.Нет, НСтр("ru='Закрыть'"));
		оп = Новый ОписаниеОповещения("ОповещениеПоказатьРасходы", ЭтотОбъект);
		ПоказатьВопрос(
			оп,
			НСтр("ru='Вы используете объект налоогообложения «Доходы».
					|В этом случае расходы не учитываются при расчете налога.'"),
			СпсКнопок);
		Возврат;
	
	КонецЕсли;
	
	ПериодПараметр = КалендарьОтчетностиПовтИсп.ПолучитьСтандартныйПериодДокументовДляСобытия(Объект.СобытиеКалендаря);
	
	ОткрытьФорму(
		"Отчет.ДоходыРасходы.ФормаОбъекта",
		Новый Структура("Организация, СформироватьПриОткрытии, Период,ВидОтчета",Объект.Организация, Истина, ПериодПараметр, "Расходы"));
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеПоказатьРасходы(Ответ, Параметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПериодПараметр = КалендарьОтчетностиПовтИсп.ПолучитьСтандартныйПериодДокументовДляСобытия(Объект.СобытиеКалендаря);
		
		ОткрытьФорму(
			"Отчет.ДоходыРасходы.ФормаОбъекта",
			Новый Структура("Организация, СформироватьПриОткрытии, Период,ВидОтчета",Объект.Организация, Истина, ПериодПараметр, "Расходы"));
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СуммаАвансовыхПлатежейЗаГодЕННажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПериодПараметр = КалендарьОтчетностиПовтИсп.ПолучитьСтандартныйПериодДокументовДляСобытия(Объект.СобытиеКалендаря);
	
	// Выбираем ближайшие 45 дней или последний прошедший платеж
	ПериодПараметр.ДатаОкончания = ПериодПараметр.ДатаОкончания + 60*60*24*45;
	
	СпсВидов = Новый СписокЗначений;
	СпсВидов.Добавить(ПредопределенноеЗначение("Справочник.ВидыНалогов.АвансовыйПлатежПриУСН"));
	СпсВидов.Добавить(ПредопределенноеЗначение("Справочник.ВидыНалогов.АвансовыйПлатежПриУСНРасходы"));
	
	СпсЗадач = Новый СписокЗначений;
	СпсЗадач.Добавить(ПредопределенноеЗначение("Справочник.ЗадачиКалендаряПодготовкиОтчетности.СтраховыеВзносыИП"));
	СпсЗадач.Добавить(ПредопределенноеЗначение("Справочник.ЗадачиКалендаряПодготовкиОтчетности.АвансовыйПлатежПоУСН")); 
	
	ОткрытьФорму(
		"Отчет.УплатыНалоговИВзносов.ФормаОбъекта",
		Новый Структура(
			"Организация, СформироватьПриОткрытии, Период,ВидВзаиморасчетов, УчетВыплатТекущегоГода, ЗадачиКалендаря",
			Объект.Организация,
			Истина,
			ПериодПараметр,
			СпсВидов,
			Истина,
			СпсЗадач));
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаСтраховыхВзносовЕННажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ОбъектНалогообложения = ПредопределенноеЗначение("Перечисление.ВидыОбъектовНалогообложения.ДоходыМинусРасходы") Тогда
		
		СпсКнопок = Новый СписокЗначений;
		СпсКнопок.Добавить(КодВозвратаДиалога.Да, НСтр("ru='Показать страховые взносы'"));
		СпсКнопок.Добавить(КодВозвратаДиалога.Нет, НСтр("ru='Закрыть'"));
		
		оп = Новый ОписаниеОповещения("ОповещениеПоказСтраховыхВзносов", ЭтотОбъект);
		ПоказатьВопрос(
			оп,
			НСтр("ru='Вы используете объект налоогообложения «Доходы, уменьшенные на величину расходов».
					|В этом случае страховые взносы включены в состав расходов.'"),
			СпсКнопок);
		Возврат;
	ИначеЕсли СуммаСтраховыхВзносовКУплатеАП <> СуммаСтраховыхВзносовАП Тогда
		
		// К вычету принимается 50 процентов от суммы налога
		СпсКнопок = Новый СписокЗначений;
		СпсКнопок.Добавить(КодВозвратаДиалога.Да, НСтр("ru='Показать страховые взносы'"));
		СпсКнопок.Добавить(КодВозвратаДиалога.Нет, НСтр("ru='Закрыть'"));
		оп = Новый ОписаниеОповещения("ОповещениеПоказСтраховыхВзносов", ЭтотОбъект);
		Если Зачет100ПроцСтрахВзносовАП Тогда
			ПоказатьВопрос(
				оп,
				НСтр("ru='Сумма страховых взносов превысила сумму налога.
						|В этом случае сумма страховых взносов вычитается не полностью.'"),
				СпсКнопок);
			
		Иначе
			ПоказатьВопрос(
				оп,
				НСтр("ru='Сумма страховых взносов превысила 50% от суммы налога.
						|В этом случае сумма налога уменьшается на 50%.'"),
				СпсКнопок);
		КонецЕсли;
		Возврат;
		
	КонецЕсли;
	
	ОткрытьФормуСтраховыхВзносов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСтраховыхВзносов() 
	
	ПериодПараметр = КалендарьОтчетностиПовтИсп.ПолучитьСтандартныйПериодДокументовДляСобытия(Объект.СобытиеКалендаря);
	
	СпсВидов = Новый СписокЗначений;
	СпсВидов.Добавить(ПредопределенноеЗначение("Справочник.ВидыНалогов.ПФРНакопительная"));
	СпсВидов.Добавить(ПредопределенноеЗначение("Справочник.ВидыНалогов.ПФРСтраховая"));
	СпсВидов.Добавить(ПредопределенноеЗначение("Справочник.ВидыНалогов.ПФРСвыше300ТР"));
	СпсВидов.Добавить(ПредопределенноеЗначение("Справочник.ВидыНалогов.ТФОМС"));
	СпсВидов.Добавить(ПредопределенноеЗначение("Справочник.ВидыНалогов.ФФОМС"));
	СпсВидов.Добавить(ПредопределенноеЗначение("Справочник.ВидыНалогов.ПФРНакопительнаяСотрудники"));
	СпсВидов.Добавить(ПредопределенноеЗначение("Справочник.ВидыНалогов.ПФРСтраховаяСотрудники"));
	СпсВидов.Добавить(ПредопределенноеЗначение("Справочник.ВидыНалогов.ФСССотрудники"));
	СпсВидов.Добавить(ПредопределенноеЗначение("Справочник.ВидыНалогов.ФССТравматизмСотрудники"));
	СпсВидов.Добавить(ПредопределенноеЗначение("Справочник.ВидыНалогов.ФОМССотрудники"));   
	СпсВидов.Добавить(ПредопределенноеЗначение("Справочник.ВидыНалогов.ФиксированныеВзносы_СтраховыеВзносыЕдиныйТариф"));     
	СпсВидов.Добавить(ПредопределенноеЗначение("Справочник.ВидыНалогов.СтраховыеВзносыЕдиныйТариф"));
	
	СпсЗадач = Новый СписокЗначений;
	СпсЗадач.Добавить(ПредопределенноеЗначение("Справочник.ЗадачиКалендаряПодготовкиОтчетности.СтраховыеВзносыИП"));
	СпсЗадач.Добавить(ПредопределенноеЗначение("Справочник.ЗадачиКалендаряПодготовкиОтчетности.НалогиСотрудников"));
	СпсЗадач.Добавить(ПредопределенноеЗначение("Справочник.ЗадачиКалендаряПодготовкиОтчетности.СтраховыеВзносыПриДоходахСвыше300ТР"));  
	СпсЗадач.Добавить(ПредопределенноеЗначение("Справочник.ЗадачиКалендаряПодготовкиОтчетности.СтраховыеВзносыЗаСотрудников"));
	
	ОткрытьФорму(
		"Отчет.УплатыНалоговИВзносов.ФормаОбъекта",
		Новый Структура(
			"Организация, СформироватьПриОткрытии, Период,ВидВзаиморасчетов, ЗадачиКалендаря",
			Объект.Организация,
			Истина,
			ПериодПараметр,
			СпсВидов,
			СпсЗадач));

КонецПроцедуры

&НаКлиенте
Процедура ОповещениеПоказСтраховыхВзносов(Ответ, Параметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОткрытьФормуСтраховыхВзносов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНалогаЕННажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ЗначениеЗаполнено(СтруктураЗаписейПараметровУчета) Тогда
		СтруктураЗаписейПараметровУчета = ПолучитьСтруктуруЗаписиПараметровУчета(Объект.Организация, Объект.СобытиеКалендаря);
	КонецЕсли;
	
	ОткрытьФорму(
		"РегистрСведений.СистемыНалогообложенияОрганизаций.ФормаЗаписи",
		СтруктураЗаписейПараметровУчета);
	

КонецПроцедуры

&НаКлиенте
Процедура РаспечататьПлатежноеПоручение(Команда)
	
	Если ВсегоКУплатеАП = "0,00 р." Тогда
		ПоказатьПредупреждение(,НСтр("ru='Сумма нулевая. Уплата не требуется.'"));
		Возврат;
	КонецЕсли;
	
	ВыводилисьДанныеДляБанка = Истина;
	
	Если ПлатежноеПоручение.Пустая() Тогда
		оп = Новый ОписаниеОповещения("ОповещениеВыбораСчета", ЭтотОбъект, Новый Структура("Файл", Ложь));
		РегламентированнаяОтчетностьУСНКлиент.ПолучитьБанковскийСчетДляУплатыНалога(оп, Объект.Организация);
		Возврат;
	КонецЕсли;
	
	РаспечататьПлатежноеПоручениеЗавершение();
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеВыбораСчета(БанковскийСчет, Параметры) Экспорт
	Если НЕ ЗначениеЗаполнено(БанковскийСчет) Тогда
		Возврат;
	КонецЕсли;
	БанковскийСчетПоУмолчанию = БанковскийСчет;
	
	Если Параметры.Файл Тогда
		БанкСчетСтруктура = Новый Структура("БанковскийСчет", БанковскийСчетПоУмолчанию);
		
		ПлатежноеПоручение = РегламентированнаяОтчетностьУСН.СоздатьБезналичноеСписаниеПоВзаиморасчетамСБюджетом(ДокументВзаиморасчетовСБюджетом, БанковскийСчетПоУмолчанию,, ВсегоКУплате);
		
		СписокПлатежек = Новый СписокЗначений;
		СписокПлатежек.Добавить(ПлатежноеПоручение);
		ОткрытьФорму(
			"Обработка.КлиентБанкУНФ.Форма.СохранениеПлатежек",
			Новый Структура("БанковскийСчет, СписокПлатежек",БанковскийСчетПоУмолчанию ,СписокПлатежек),,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Если ПроверитьНаличиеГосОргана("РаспечататьПлатежноеПоручениеЗавершение") Тогда
			РаспечататьПлатежноеПоручениеЗавершение();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФайлВыгрузкиДляКлиентБанка(Команда)
	
	ВыводилисьДанныеДляБанка = Истина;
	
	Если ВсегоКУплатеАП = "0,00 р." Тогда
		ПоказатьПредупреждение(,НСтр("ru='Сумма нулевая. Уплата не требуется.'"));
		Возврат;
	КонецЕсли;
	
	Если ПлатежноеПоручение.Пустая() Тогда
		оп = Новый ОписаниеОповещения("ОповещениеВыбораСчета", ЭтотОбъект, Новый Структура("Файл", Истина));
		РегламентированнаяОтчетностьУСНКлиент.ПолучитьБанковскийСчетДляУплатыНалога(оп, Объект.Организация);
		Возврат;
	КонецЕсли;
	СписокПлатежек = Новый СписокЗначений;
	СписокПлатежек.Добавить(ПлатежноеПоручение);
	ОткрытьФорму(
		"Обработка.КлиентБанкУНФ.Форма.СохранениеПлатежек",
		Новый Структура("БанковскийСчет, СписокПлатежек",БанковскийСчетПоУмолчанию ,СписокПлатежек),,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспечататьКвитанциюДляСбербанка(Команда)
	
	Если ПроверитьНаличиеГосОргана("РаспечататьКвитанциюЗавершение") Тогда
		РаспечататьКвитанциюЗавершение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВзносПоЕдиномуТарифуНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(СобытиеВзносПоЕдиномуТарифу) Тогда 
		Результат = РегламентированнаяОтчетностьУСНКлиент.ОбработатьСобытиеКалендаря(
		Объект.Организация,
		СобытиеВзносПоЕдиномуТарифу);   
		
		ПараметрыФормы = Новый Структура(
		"Организация,СобытиеКалендаря", 
		Объект.Организация,
		СобытиеВзносПоЕдиномуТарифу);
		ОткрытьФорму(Результат.ИмяФормыРезультата, ПараметрыФормы);   
	КонецЕсли; 
	
КонецПроцедуры 

&НаКлиенте
Процедура ВзносСДоходовНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(СобытиеВзносСДоходов) Тогда 
		Результат = РегламентированнаяОтчетностьУСНКлиент.ОбработатьСобытиеКалендаря(
		Объект.Организация,
		СобытиеВзносСДоходов);   
		
		ПараметрыФормы = Новый Структура(
		"Организация,СобытиеКалендаря", 
		Объект.Организация,
		СобытиеВзносСДоходов);
		ОткрытьФорму(Результат.ИмяФормыРезультата, ПараметрыФормы);   
	КонецЕсли; 
	
КонецПроцедуры 
// -----------------------------------------------------------------------------
// События переходов


&НаКлиенте
Процедура ПереходЗаполнение(Команда)
	
	Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.Заполнить");
	
	КалендарьОтчетности.ЗаписатьСостояниеСобытияКалендаря(
		Объект.Организация,
		Объект.СобытиеКалендаря,
		Объект.СостояниеСобытия,
		"");
	
	ПараметрыФормы = Новый Структура("Организация,СобытиеКалендаря", Объект.Организация,Объект.СобытиеКалендаря);
	
	КалендарьОтчетностиКлиент.ОткрытьФормуНачалаЗаполнения(ЭтаФорма,ПараметрыФормы);
	Оповестить("ИзменениеСостоянияСобытияКалендаря", Объект.СобытиеКалендаря, ЭтаФорма);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереходУплата(Команда)
	
	Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.Уплатить");
	
	ЗафиксироватьПереходкУплате(Объект.Организация, Объект.СобытиеКалендаря, Объект.СостояниеСобытия, ВсегоКУплатеАП);
	
	Элементы.СтраницаАвансовогоПлатежа.ТекущаяСтраница = Элементы.УплатаАвансовогоПлатежа;
	НазначитьКнопкуПоУмолчаниюИУстановитьЗаголовок();
	Оповестить("ИзменениеСостоянияСобытияКалендаря", Объект.СобытиеКалендаря, ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗафиксироватьПереходкУплате(Организация, Событие, Состояние, ВсегоКУплате)
	
	КалендарьОтчетности.ЗаписатьСостояниеСобытияКалендаря(
		Организация,
		Событие,
		Состояние,
		ВсегоКУплате);
	
	ЗаписьКалендаря = Справочники.ЗаписиКалендаряПодготовкиОтчетности.ПолучитьЗаписьКалендаря(Организация, Событие);
	Если ЗаписьКалендаря <> Неопределено Тогда
		ОбъектЗаписьКалендаря = ЗаписьКалендаря.ПолучитьОбъект();
		ОбъектЗаписьКалендаря.Завершено = Истина;
		ОбъектЗаписьКалендаря.Записать();
	КонецЕсли;
	ЗаписьКалендаря = Справочники.ЗаписиКалендаряПодготовкиОтчетности.ПолучитьЗаписьКалендаря(Организация, Событие);
	Если ЗаписьКалендаря <> Неопределено Тогда
		ОбъектЗаписьКалендаря = ЗаписьКалендаря.ПолучитьОбъект();
		ОбъектЗаписьКалендаря.Завершено = Ложь;
		ОбъектЗаписьКалендаря.Записать();
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПереходРезультатРасчета1Нажатие(Элемент)
	
	Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.Ознакомиться");
	
	КалендарьОтчетности.ЗаписатьСостояниеСобытияКалендаря(
		Объект.Организация,
		Объект.СобытиеКалендаря,
		Объект.СостояниеСобытия,
		ВсегоКУплатеАП);
	
	Элементы.СтраницаАвансовогоПлатежа.ТекущаяСтраница = Элементы.РезультатРасчета;
	НазначитьКнопкуПоУмолчаниюИУстановитьЗаголовок();
	Оповестить("ИзменениеСостоянияСобытияКалендаря", Объект.СобытиеКалендаря, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереходВыполнил(Команда)
	
	БезСозданияПлатежек = Ложь;
	// ВыводилисьДанныеДляБанка - не инициализируется изначально
	Если СсылкаДокументаНаличнойУплаты.Пустая() И НЕ ВыводилисьДанныеДляБанка И ВсегоКУплатеАП <> "0,00 р." Тогда
		
		оп = Новый ОписаниеОповещения("ПодтверждениеПереходВыполнил", ЭтотОбъект);
		ПоказатьВопрос(
			оп,
			НСтр("ru='Платежки не создавались. Расходы через кассу не зарегистрированы.
			         |Вы уверены, что все выполнено?'"),
			РежимДиалогаВопрос.ДаНет);
		Возврат;
		
	КонецЕсли;
	БезСозданияПлатежек = Истина;
	
	ПереходВыполнил1(БезСозданияПлатежек);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеПереходВыполнил(Ответ, Параметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПереходВыполнил1(Истина);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПереходВыполнил1(БезСозданияПлатежек)
	
	Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.Завершено");
	
	КалендарьОтчетности.ЗавершитьСобытиеКалендаряОтчетности(
		Объект.Организация,
		Объект.СобытиеКалендаря,
		"");
	
	Элементы.СтраницаАвансовогоПлатежа.ТекущаяСтраница = Элементы.ЗадачаВыполнена;
	НазначитьКнопкуПоУмолчаниюИУстановитьЗаголовок();
	
	ОповеститьОбИзменении(Тип("СправочникСсылка.ЗаписиКалендаряПодготовкиОтчетности"));
	Оповестить("Запись_ЗаписиКалендаряПодготовкиОтчетности");
	
КонецПроцедуры


&НаКлиенте
Процедура ДекорацияТекстОписание6ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("ОткрытаИзФормыСобытия,СобытиеКалендаря, Организация", Истина, Объект.СобытиеКалендаря, Объект.Организация);
	ОткрытьФорму("Документ.ЗаписиУСН.Форма.ФормаСпискаЗаписиПрочие", ПараметрыФормы);
КонецПроцедуры


// Конец событий переходов
// -----------------------------------------------------------------------------

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ


// Процедура заполняет данные формы по данным ранее сформированной отчетности
//
&НаСервере
Процедура ПолучитьДанныеОтчетности()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗначенияПоказателейОтчетности.ЗначениеПоказателя КАК ЗначениеПоказателя,
	|	ЗначенияПоказателейОтчетности.ПоказательОтчетности.Код КАК КодОтчетности
	|ИЗ
	|	РегистрСведений.ЗначенияПоказателейОтчетности КАК ЗначенияПоказателейОтчетности
	|ГДЕ
	|	ЗначенияПоказателейОтчетности.Организация = &Организация
	|	И ЗначенияПоказателейОтчетности.ПериодОтчетности = &ПериодОтчетности
	|	И ЗначенияПоказателейОтчетности.ПоказательОтчетности В ИЕРАРХИИ(&ГруппаПоказателя)");
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ПериодОтчетности", Объект.СобытиеКалендаря.ДатаДокументаОбработкиСобытия);
	
	Запрос.УстановитьПараметр("ГруппаПоказателя", ПланыВидовХарактеристик.ПоказателиОтчетности.АвансовыйПлатеж);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.КодОтчетности = "СтавкаНалогаАП" 
			Или Выборка.КодОтчетности = "СтавкаНалогаАППовышенная" Тогда
			ЭтаФорма[Выборка.КодОтчетности] = Формат(Выборка.ЗначениеПоказателя, "ЧЦ=4; ЧДЦ=2; ЧН=" ) + "%";
		ИначеЕсли Выборка.КодОтчетности = "СуммаДоходовАП" Тогда	
			Элементы.ГруппаСтрока2.Видимость = (Выборка.ЗначениеПоказателя > 0);
			ЭтаФорма[Выборка.КодОтчетности] = Формат(Выборка.ЗначениеПоказателя, "ЧДЦ=2; ЧРГ=; ЧН=" ) + " р."; 
		ИначеЕсли Выборка.КодОтчетности = "СуммаАППовышенная" Тогда	
			Элементы.ГруппаСтрока2Продолжение.Видимость = (Выборка.ЗначениеПоказателя > 0);
			ЭтаФорма[Выборка.КодОтчетности] = Формат(Выборка.ЗначениеПоказателя, "ЧДЦ=2; ЧРГ=; ЧН=" ) + " р.";		
			Если Выборка.ЗначениеПоказателя > 0 Тогда
				СуммаАП = ЭтаФорма[Выборка.КодОтчетности];
			КонецЕсли;	 		
		ИначеЕсли Выборка.КодОтчетности = "Зачет100ПроцСтрахВзносовАП" Тогда
			Зачет100ПроцСтрахВзносовАП = Выборка.ЗначениеПоказателя;    
		ИначеЕсли Выборка.КодОтчетности = "ВзносПоЕдиномуТарифуАП" Тогда
			ЭтаФорма[Выборка.КодОтчетности] = Выборка.ЗначениеПоказателя;		
		Иначе
			Если Выборка.КодОтчетности = "ВсегоКУплатеАП" Тогда
				ВсегоКУплате = Выборка.ЗначениеПоказателя;
				СуммаАПИтог  = Формат(Выборка.ЗначениеПоказателя, "ЧДЦ=2; ЧРГ=; ЧН=" ) + " р.";  
			ИначеЕсли Выборка.КодОтчетности = "НалогДляУведомления" Тогда	
				НалогДляУведомленияЧисло = Выборка.ЗначениеПоказателя;
			    Элементы.ГруппаСтрокаРасчетУведомление.Видимость = (Выборка.ЗначениеПоказателя < 0); 
				Элементы.ГруппаСтрокаРасчетУведомлениеПоказатели.Видимость = (Выборка.ЗначениеПоказателя < 0);	
			ИначеЕсли Выборка.КодОтчетности = "АвансовыеПлатежиИсчисленные" Тогда	
				АвансовыеПлатежиИсчисленныеЧисло = Выборка.ЗначениеПоказателя; 
			КонецЕсли;
			ЭтаФорма[Выборка.КодОтчетности] = Формат(Выборка.ЗначениеПоказателя, "ЧДЦ=2; ЧРГ=; ЧН=" ) + " р.";
		КонецЕсли;
	КонецЦикла; 
	
	ДатаДокументаОбработкиСобытия = КонецДня(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СобытиеКалендаря,"ДатаДокументаОбработкиСобытия"));

	Если УпрощенныйЗачетФиксированныхВзносов Тогда
		
		// Включаем взносы, подлежащие уплате в текущем налоговом периоде
		// Федеральный закон от 31.07.2023 N 389-ФЗ
		
		ВзносыСДоходов = РегламентированнаяОтчетностьУСН.ВзносыСДоходовПодлежащиеУплате(
		Объект.Организация,
		ДатаДокументаОбработкиСобытия);
		
		//ВзносПоЕдиномуТарифуАП = 
		//РегламентированнаяОтчетностьУСН.РассчитатьФиксированныеСтраховыеВзносы(ДатаДокументаОбработкиСобытия, Объект.Организация).ЕдиныйТарифВсего;		
		
		ВзносСДоходовАП = ВзносыСДоходов.Всего;
			
		СистемаНалогообложенияОрганизации = РегистрыСведений.СистемыНалогообложенияОрганизаций.ОпределитьСистемуНалогообложенияОрганизации(Объект.Организация, ДатаДокументаОбработкиСобытия);
		
		ПрименяетсяПСН = СистемаНалогообложенияОрганизации.ПрименяетсяПатент; 
		
		УчитыватьПСН = (ДатаДокументаОбработкиСобытия >= Дата(2021, 1, 1))
		И СистемаНалогообложенияОрганизации.ПрименяетсяПатент;
		
		Если УчитыватьПСН Тогда
			Периодичность = Перечисления.Периодичность.Квартал;
			ДоляДоходовПоУСН = 100 * (1 - РегламентированнаяОтчетностьУСН.ДоляДоходовПатентнойСистемыНалогообложения(
			Объект.Организация,
			ДатаДокументаОбработкиСобытия,
			Периодичность));
		КонецЕсли;
		
		СрокПоЕдиномуТарифу = Объект.СобытиеКалендаря.ДатаНачалаДокументов;
		Обработки.ОбработкиНалоговИОтчетности.УточнитьСрокУплатыВзносовЕдиныйТариф(СрокПоЕдиномуТарифу);
		
		Элементы.ВзносПоЕдиномуТарифу.Подсказка = СтрШаблон(НСтр("ru = 'Срок оплаты - %1
		|Уменьшить налог следует в текущем периоде.'"),
		Формат(СрокПоЕдиномуТарифу, "ДЛФ=DD"));
		
		ТекущийГод = Год(ДатаДокументаОбработкиСобытия);   
		
		Элементы.ВзносСДоходов.Подсказка = СтрШаблон(НСтр("ru = 'Остаток взноса за %1 г. %2 руб. из %3 руб.'"),
		Формат(ТекущийГод - 1, "ЧГ=0"),
		Формат(ВзносыСДоходов.ЗаПредыдущийГод, "ЧДЦ=2; ЧН=0,00"),
		Формат(ВзносыСДоходов.ЗаПредыдущийГодИсчислено, "ЧДЦ=2; ЧН=0,00")); 
		
		ФорматЧиселВПояснении = НСтр("ru = 'ЧДЦ=2; ЧН=0,00; ЧГ=3,0'");		
		Если (ВзносПоЕдиномуТарифуАП + ВзносСДоходовАП) > 0 Тогда
			// Выводим расчет с учетом взносов, подлежащих уплате
			Если ДоляДоходовПоУСН < 100 И ДоляДоходовПоУСН > 0 Тогда
				// Есть совмещение с ПСН 			
				Элементы.СуммаНалоговыхВычетов.Подсказка = НСтр("ru = 'Налоговый вычет = (По единому тарифу + Взнос с доходов + Уплаченные взносы) * Доля доходов по УСН'")
				+ Символы.ПС + СтрШаблон("(%1 + %2 + %3) * %4",
				Формат(ВзносПоЕдиномуТарифуАП, ФорматЧиселВПояснении),
				Формат(ВзносСДоходовАП, ФорматЧиселВПояснении),
				Формат(ДоляДоходовПоУСН, ФорматЧиселВПояснении),
				Формат(СуммаСтраховыхВзносовАП, ФорматЧиселВПояснении));  
			Иначе
				Элементы.СуммаНалоговыхВычетов.Подсказка = НСтр("ru = 'Налоговый вычет = По единому тарифу + Взнос с доходов + Уплаченные взносы'")
				+ Символы.ПС + СтрШаблон("%1 + %2 + %3",
				Формат(ВзносПоЕдиномуТарифуАП, ФорматЧиселВПояснении),
				Формат(ВзносСДоходовАП, ФорматЧиселВПояснении),
				Формат(СуммаСтраховыхВзносовАП, ФорматЧиселВПояснении));
			КонецЕсли;
			
		Иначе
			Элементы.СуммаНалоговыхВычетов.Подсказка = НСтр("ru = 'Налоговый вычет: взносы в фиксированном размере'");
		КонецЕсли;
		
	КонецЕсли;
	
	НайтиДокументОплаты();
	
КонецПроцедуры

// Процедура устанавливает видимость и доступность элементов управления
//
&НаКлиенте
Процедура УстановитьВидимостьИДоступностьЭлементов()
	
	НазначитьКнопкуПоУмолчаниюИУстановитьЗаголовокНаКлиенте();
	
	Элементы.ГруппаСтрока10.Видимость = Истина;
	Элементы.ГруппаСтрока11.Видимость = Истина;
	Элементы.ГруппаСтрока12.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьРасчет()	
	
	ДатаДокументаОбработкиСобытия = КонецДня(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СобытиеКалендаря,"ДатаДокументаОбработкиСобытия"));
	РегламентированнаяОтчетностьУСН.ВыполнитьФормированияВсехЗаписейКУДИР(ДатаДокументаОбработкиСобытия);
	РегламентированнаяОтчетностьУСН.ВыполнитьРасчетАвансовогоПлатежа(
		Объект.Организация,
		ДатаДокументаОбработкиСобытия,
		Объект.СобытиеКалендаря);
	
	ПолучитьДанныеОтчетности();
	
	ЗаполнитьУведомления();
	УправлениеФормойБлокУведомление();
	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьКнопкуПоУмолчаниюИУстановитьЗаголовок()
	
	ИмяКнопки = ПолучитьИмяЭлементаКнопкиПоУмолчанию(Элементы.СтраницаАвансовогоПлатежа.ТекущаяСтраница.Имя);
	
	Если НЕ ПустаяСтрока(ИмяКнопки) Тогда
		Элементы[ИмяКнопки].КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Элементы.СтраницаАвансовогоПлатежа.ТекущаяСтраница.Заголовок, ПериодЗадачиПредставление);
	РегламентированнаяОтчетностьУСНКлиентСервер.УстановитьЗаголовокФормыЗадачи(ЭтаФорма, Объект.Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьКнопкуПоУмолчаниюИУстановитьЗаголовокНаКлиенте()
	
	ИмяСтраницы = Элементы.СтраницаАвансовогоПлатежа.ТекущаяСтраница.Имя;
	ИмяКнопки = ПолучитьИмяЭлементаКнопкиПоУмолчанию(ИмяСтраницы);
	
	Если НЕ ПустаяСтрока(ИмяКнопки) Тогда
		Элементы[ИмяКнопки].КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Элементы.СтраницаАвансовогоПлатежа.ТекущаяСтраница.Заголовок, ПериодЗадачиПредставление);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьИмяЭлементаКнопкиПоУмолчанию(ИмяСтраницы)
	
	Если ИмяСтраницы = "РезультатРасчета" Тогда
		Возврат "ПереходДалее";
	ИначеЕсли ИмяСтраницы = "УплатаАвансовогоПлатежа" Тогда
		Возврат "ПереходВыполнил";
	ИначеЕсли ИмяСтраницы = "ЗадачаВыполнена" Тогда
		Возврат "";
	Иначе
		ВызватьИсключение НСтр("ru='Неизвестное имя текущей страницы'");
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруЗаписиПараметровУчета(Организация, СобытиеКалендаря)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СистемыНалогообложенияОрганизацийСрезПоследних.Период,
	|	СистемыНалогообложенияОрганизацийСрезПоследних.Организация
	|ИЗ
	|	РегистрСведений.СистемыНалогообложенияОрганизаций.СрезПоследних(
	|			&Дата,
	|			 Организация = &Организация) КАК СистемыНалогообложенияОрганизацийСрезПоследних");
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Дата", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СобытиеКалендаря,"ДатаДокументаОбработкиСобытия"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Ключ = РегистрыСведений.СистемыНалогообложенияОрганизаций.СоздатьКлючЗаписи(
			Новый Структура(
				"Период,Организация",
				Выборка.Период,
				Выборка.Организация));
		
		Возврат Новый Структура("Ключ",Ключ);
		
	Иначе
		Возврат Новый Структура; // мы не должны попадать в эту форму, если параметры на дату события не заполнены
	КонецЕсли;
	
	
КонецФункции

&НаСервере
Процедура НайтиДокументОплаты()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РасходДенежныхСредствИзКассы.Ссылка
	|ИЗ
	|	Документ.РасходИзКассы КАК РасходДенежныхСредствИзКассы
	|ГДЕ
	|	РасходДенежныхСредствИзКассы.Организация = &Организация
	|	И РасходДенежныхСредствИзКассы.ДокументОснование = &ДокументОснование
	|	И РасходДенежныхСредствИзКассы.Проведен");
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ДокументОснование", ДокументВзаиморасчетовСБюджетом);
	
	Выборка  = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СсылкаДокументаНаличнойУплаты = Выборка.Ссылка;
	Иначе
		СсылкаДокументаНаличнойУплаты = Документы.РасходИзКассы.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспечататьКвитанциюЗавершение() Экспорт
	
	СтруктураПечати = ВыгрузитьДокументВФайл(Новый Структура("НачислениеНалогов,Сумма", ДокументВзаиморасчетовСБюджетом, ВсегоКУплате), "Квитанция");
	Если СтруктураПечати.АдресФайла = Неопределено Тогда
		
		Сообщить(НСтр("ru='Произошла ошибка при выгрузке документа '")+Объект);
		Возврат;
		
	КонецЕсли;
	
	ПолучитьФайл(СтруктураПечати.АдресФайла, НСтр("ru = 'Квитанция.pdf'"), Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспечататьПлатежноеПоручениеЗавершение() Экспорт
	
	ПлатежноеПоручение = РегламентированнаяОтчетностьУСН.СоздатьБезналичноеСписаниеПоВзаиморасчетамСБюджетом(ДокументВзаиморасчетовСБюджетом, БанковскийСчетПоУмолчанию,, ВсегоКУплате);
	СтруктураПечати = ВыгрузитьДокументВФайл(ПлатежноеПоручение, "ПлатежноеПоручение");
	Если СтруктураПечати.АдресФайла = Неопределено Тогда
		
		Сообщить(НСтр("ru='Произошла ошибка при выгрузке документа '")+Объект);
		Возврат;
		
	КонецЕсли;
	
	ПолучитьФайл(СтруктураПечати.АдресФайла, СтруктураПечати.НаименованиеФайла, Истина);
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьНаличиеГосОргана(ИмяПроцедурыПоЗавершениюСозданияГосОргана)
	КодГосОргана = "";
	Если ГосОрганСуществует(Объект.Организация, КодГосОргана) Тогда
		Возврат Истина;
	Иначе
		ДопПараметры = Новый Структура("ИмяПроцедурыПоЗавершениюСозданияГосОргана, КодГосОргана", ИмяПроцедурыПоЗавершениюСозданияГосОргана, КодГосОргана);
		ТекстВопроса = НСтр("ru='В справочнике «Контрагенты» не задан налоговый орган для уплаты налога.
			|Создать его автоматически?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ПриОтветеНаВопросОСозданииГосОргана",
			ЭтаФорма, ДопПараметры);
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru='Создать автоматически'"));
		Кнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru='Создать вручную'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru='Отмена'"));
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки,,КодВозвратаДиалога.Да, НСтр("ru='Отсутствует налоговый орган'"));
		
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПриОтветеНаВопросОСозданииГосОргана(РезультатВопроса, ДопПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ВыполнитьЗаполнениеСведенийОНалоговойИнспекции(ДопПараметры);
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ВидГосударственногоОргана", ПредопределенноеЗначение("Перечисление.ВидыГосударственныхОрганов.НалоговыйОрган"));
		ПараметрыФормы.Вставить("КодГосударственногоОргана", ДопПараметры.КодГосОргана);
		ПараметрыФормы.Вставить("ИмяПроцедурыПоЗавершениюСозданияГосОргана",ДопПараметры.ИмяПроцедурыПоЗавершениюСозданияГосОргана);
		ПараметрыФормы.Вставить("ЗапретРедактированияКода", Истина);
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьИзменениеПлатежныхРеквизитовФНС", ЭтотОбъект, ПараметрыФормы);
		
		ОткрытьФорму("Справочник.Контрагенты.Форма.РеквизитыГосударственныхОрганов", ПараметрыФормы, ЭтотОбъект, ЭтотОбъект, , , ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОтветеНаВопросОСозданииНачислениеНалогов(РезультатВопроса, НачисленияКРегистрации) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда	
		ЗарегистироватьАвтоматическиНачисленияНалогов(НачисленияКРегистрации); 
		ОбновитьРасчет();
	КонецЕсли;
	
КонецПроцедуры   

Процедура ЗарегистироватьАвтоматическиНачисленияНалогов(НачисленияКРегистрации)
	
	Для Каждого Начисление Из НачисленияКРегистрации Цикл
	РегламентированнаяОтчетностьУСН.ЗарегистрироватьВзаиморасчетыСБюджетом(Начисление, 
	Начисление.СуммаВзаиморасчетовСБюджетом, 
	Истина, 
	"Регистрация начисления при проверки"); 	

КонецЦикла;	


				
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаполнениеСведенийОНалоговойИнспекции(ДопПараметры)
	
	ОписаниеОшибки = "";
	ЗаполнитьСведенияОНалоговойИнспекцииПоКоду(ОписаниеОшибки, ДопПараметры.КодГосОргана);
	
	// Обработка ошибок
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		Если ОписаниеОшибки = "НеУказаныПараметрыАутентификации" Тогда
			
			ТекстВопроса = НСтр("ru='Для автоматического создания налогового органа
				|в справочнике «Контрагенты» необходимо подключиться к Интернет-поддержке
				|пользователей. Подключиться сейчас?'");
				
			ПараметрыВопроса = Новый Структура("ВызовПослеПодключения,ИмяПроцедурыПоЗавершениюСозданияГосОргана", "ЗаполнитьСведенияОНалоговойИнспекцииПоКоду, КодГосОргана", ДопПараметры.ИмяПроцедурыПоЗавершениюСозданияГосОргана, ДопПараметры.КодГосОргана);
			ОписаниеОповещения = Новый ОписаниеОповещения("ПодключитьИнтернетПоддержку", ЭтотОбъект, ПараметрыВопроса);
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			
		Иначе
			ПоказатьПредупреждение(, ОписаниеОшибки);
		КонецЕсли;
	Иначе
		Если ДопПараметры.ИмяПроцедурыПоЗавершениюСозданияГосОргана = "РаспечататьКвитанциюЗавершение" Тогда
			РаспечататьКвитанциюЗавершение();
		ИначеЕсли ДопПараметры.ИмяПроцедурыПоЗавершениюСозданияГосОргана = "РаспечататьПлатежноеПоручениеЗавершение" Тогда
			РаспечататьПлатежноеПоручениеЗавершение();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьИнтернетПоддержку(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПодключитьИнтернетПоддержкуЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ИнтернетПоддержкаПользователейКлиент.ПодключитьИнтернетПоддержкуПользователей(Оповещение, ЭтотОбъект);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПодключитьИнтернетПоддержкуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Если ДополнительныеПараметры.Свойство("ВызовПослеПодключения") Тогда
			
			Если ДополнительныеПараметры.ВызовПослеПодключения = "ЗаполнитьСведенияОНалоговойИнспекцииПоКоду" Тогда
				
				ЗаполнитьСведенияОНалоговойИнспекцииПоКоду(,ДополнительныеПараметры.КодГосОргана);
				
				Если ДополнительныеПараметры.ИмяПроцедурыПоЗавершениюСозданияГосОргана = "РаспечататьКвитанциюЗавершение" Тогда
					РаспечататьКвитанциюЗавершение();
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьСведенияОНалоговойИнспекцииПоКоду(ОписаниеОшибки = "", КодНалоговогоОрганаПолучателя)
	
	РеквизитыНалоговогоОргана = ДанныеГосударственныхОрганов.РеквизитыНалоговогоОрганаПоКоду(КодНалоговогоОрганаПолучателя);
	
	Если ЗначениеЗаполнено(РеквизитыНалоговогоОргана.ОписаниеОшибки) Тогда
		ОписаниеОшибки = РеквизитыНалоговогоОргана.ОписаниеОшибки;
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(РеквизитыНалоговогоОргана.Ссылка) Тогда
		ДанныеГосударственныхОрганов.ОбновитьДанныеГосударственногоОргана(РеквизитыНалоговогоОргана);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеПлатежныхРеквизитовФНС(Ответ, ДопПараметры) Экспорт
	Если ТипЗнч(Ответ) = Тип("Структура") Тогда
		Если ДопПараметры.ИмяПроцедурыПоЗавершениюСозданияГосОргана = "РаспечататьКвитанциюЗавершение" Тогда
			РаспечататьКвитанциюЗавершение();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ГосОрганСуществует(Организация, КодГосОргана)
	КодГосОргана = Организация.КодНалоговогоОрганаПолучателя;
	ГосОрган = ДанныеГосударственныхОрганов.ГосударственныйОрган(Перечисления.ВидыГосударственныхОрганов.НалоговыйОрган, КодГосОргана);
	
	Возврат ЗначениеЗаполнено(ГосОрган.Ссылка);
	
КонецФункции

&НаСервереБезКонтекста
Функция ВыгрузитьДокументВФайл(Объект, ВидФайла)
	
	ТабДок = Новый ТабличныйДокумент;
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Объект);
	
	Если ВидФайла = "Квитанция" Тогда
		Для Каждого Объект Из МассивОбъектов Цикл
			
			ТабДокОбъекта = Документы.НачислениеНалогов.СформироватьКвитанцию(Объект.НачислениеНалогов, Объект.Сумма);
			ТабДокОбъекта.Область().СоздатьФорматСтрок();
			Если ТабДок = Неопределено Тогда
				ТабДок = ТабДокОбъекта;
			Иначе
				ТабДок.Вывести(ТабДокОбъекта);
			КонецЕсли;
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЦикла;
	ИначеЕсли ВидФайла = "ПлатежноеПоручение" Тогда
		ОбъектыПечати = Новый СписокЗначений;
		ТабДок = Документы.ПлатежноеПоручение.ПечатнаяФорма(МассивОбъектов, ОбъектыПечати);
	КонецЕсли;
	
	СтруктураПечати = Новый Структура ("АдресФайла, НаименованиеФайла");
	
	Если ТабДок = Неопределено Тогда
		Возврат СтруктураПечати;
	КонецЕсли;
	
	Каталог = КаталогВременныхФайлов()+РаботаВМоделиСервиса.ЗначениеРазделителяСеанса()+"\";
	
	ПроверкаКаталога = Новый Файл(Каталог);
	Если НЕ ПроверкаКаталога.Существует() Тогда
		СоздатьКаталог(Каталог);
	КонецЕсли;
	ПризнакОшибки = Ложь;
	РасширениеФайла = ".pdf" ;
	НаименованиеФайла = Строка(Объект);
	НаименованиеФайла = ?(СтрДлина(НаименованиеФайла)+СтрДлина(РасширениеФайла)>64, Лев(НаименованиеФайла,64 - СтрДлина(РасширениеФайла)),НаименованиеФайла);
	НаименованиеФайла = СтрЗаменить(НаименованиеФайла, ":","_");
	
	ПолноеИмяФайла = Каталог + НаименованиеФайла + РасширениеФайла;
	ПолноеИмяФайла = СтрЗаменить(ПолноеИмяФайла, """","");
	
	Попытка
		ТабДок.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.PDF);
		
	Исключение
		ПризнакОшибки = Истина;
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Ошибка сохранения файла на сервере'"),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru= 'При сохранении файла на сервере в области данных %1 произошла ошибка:
						|%2'"),
				РаботаВМоделиСервиса.ЗначениеРазделителяСеанса(),
				ОписаниеОшибки()),
			РежимТранзакцииЗаписиЖурналаРегистрации.Независимая);
		
		Возврат СтруктураПечати;
		
	КонецПопытки;
	ДанныеФайла = Новый ДвоичныеДанные(ПолноеИмяФайла);
	АдресФайла = ПоместитьВоВременноеХранилище(ДанныеФайла, Новый УникальныйИдентификатор);
	УдалитьФайлы(ПолноеИмяФайла);
	СтруктураПечати.АдресФайла = АдресФайла;
	СтруктураПечати.НаименованиеФайла = НаименованиеФайла+РасширениеФайла;
	
	Возврат СтруктураПечати;
	
КонецФункции

#Область Уведомления
// -----------------------------------------------------------------------------
// Уведомления

&НаКлиенте
Процедура ВыполнитьДействиеСформироватьУведомление(Команда)
	
	ОткрытьДокументОповещение = Новый ОписаниеОповещения("ОбработатьРедактированиеУведомления", ЭтотОбъект);
	
	ПараметрыУведомления = Новый Структура;
	ПараметрыУведомления.Вставить("Организация",                 Объект.Организация);
	ПараметрыУведомления.Вставить("ЗаписьКалендаря",                     ЗаписьКалендаря);
	ПараметрыУведомления.Вставить("ПериодСобытия",               ПериодСобытия);
	ПараметрыУведомления.Вставить("АдресХранилищаТаблицыНалоги", ОписаниеТаблицыНалоги());
	ПараметрыУведомления.Вставить("КонтекстныйВызов",            Истина);
	
	ОткрытьФорму("Документ.УведомлениеОбИсчисленныхСуммахНалогов.Форма.ФормаДокумента",
		ПараметрыУведомления,
		ЭтотОбъект,
		,
		,
		,
		ОткрытьДокументОповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры  
	
&НаКлиенте
Процедура ВыполнитьДействиеСформироватьОперациюПоЕНС(Команда)
	
	ВыполненоВТихомРежиме = Ложь;
	СформироватьОперациюПоЕНСВТихомРежиме(ВыполненоВТихомРежиме);
	Если ВыполненоВТихомРежиме Тогда
		// Только перерисуем форму
		ОбработатьРедактированиеУведомления();
		Возврат;
	КонецЕсли;
	
	ОткрытьДокументОповещение = Новый ОписаниеОповещения("ОбработатьРедактированиеУведомления", ЭтотОбъект);
	
	ПараметрыУведомления = Новый Структура;
	ПараметрыУведомления.Вставить("Организация",                 Объект.Организация);
	ПараметрыУведомления.Вставить("ЗаписьКалендаря",                     ЗаписьКалендаря);
	ПараметрыУведомления.Вставить("ПериодСобытия",               ПериодСобытия);
	ПараметрыУведомления.Вставить("АдресХранилищаТаблицыНалоги", ОписаниеТаблицыНалоги());
	ПараметрыУведомления.Вставить("КонтекстныйВызов",            Истина);
	
	ОткрытьФорму("Документ.ОперацияПоЕдиномуНалоговомуСчету.Форма.ФормаДокумента",
		ПараметрыУведомления,
		ЭтотОбъект,
		,
		,
		,
		ОткрытьДокументОповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОперациюПоЕНСВТихомРежиме(ВыполненоВТихомРежиме)
	
	ЕдиныйНалоговыйСчет.СформироватьОперациюПоЕНСВТихомРежиме(Объект.Организация,
		ОписаниеТаблицыНалоги(),
		ЗаписьКалендаря,
		Объект.ПериодРегистрации,
		ВыполненоВТихомРежиме);
	
КонецПроцедуры
	
&НаСервере
Функция ОписаниеТаблицыНалоги()
	
	ТаблицаНалоги = ТаблицаНалогиДляУведомления();
		
	ТаблицыНалогов = Документы.УведомлениеОбИсчисленныхСуммахНалогов.ОписаниеТаблицНалогов();
	ТаблицыНалогов.ТаблицаНалоги = ТаблицаНалоги;
	
	АдресХранилищаТаблицыНалоги = ПоместитьВоВременноеХранилище(ТаблицыНалогов, УникальныйИдентификатор);
	
	Возврат АдресХранилищаТаблицыНалоги;
	
КонецФункции 

&НаСервере
Функция ТаблицаНалогиДляУведомления() Экспорт
	
	ТаблицаНалоги = Документы.УведомлениеОбИсчисленныхСуммахНалогов.ОписаниеТаблицыНалогов();
	
	ОбъектНалогообложения = РегламентированнаяОтчетностьУСН.ОбъектНалогообложенияНаДату(Объект.Организация,Объект.СобытиеКалендаря);
	Если ОбъектНалогообложения = Перечисления.ВидыОбъектовНалогообложения.ДоходыМинусРасходы Тогда
		ВидВзаиморасчетов = Справочники.ВидыНалогов.АвансовыйПлатежПриУСНРасходы;
	Иначе
		ВидВзаиморасчетов = Справочники.ВидыНалогов.АвансовыйПлатежПриУСН;
	КонецЕсли;
	
	Если НалогДляУведомленияЧисло <> 0 Тогда 
		
		НоваяСтрока = ТаблицаНалоги.Добавить();
		НоваяСтрока.РегистрацияВНалоговомОргане = Объект.Организация.РегистрацияВНалоговомОргане;
		НоваяСтрока.КодПоОКТМО                  = НоваяСтрока.РегистрацияВНалоговомОргане.КодПоОКТМО;
		НоваяСтрока.Налог                       = ВидВзаиморасчетов;
		НоваяСтрока.КодБК                       = Справочники.ВидыНалогов.КБК(НоваяСтрока.Налог,, Объект.СобытиеКалендаря.ДатаОкончанияСобытия);
		НоваяСтрока.СчетУчета                   = НоваяСтрока.Налог.СчетУчета;
		НоваяСтрока.Сумма = НалогДляУведомленияЧисло;
		НоваяСтрока.СрокУплаты                  = РегламентированнаяОтчетностьУСН.ОпределитьСрокПлатежаПоЕНП(Объект.СобытиеКалендаря.ДатаОкончанияСобытия);
		НоваяСтрока.НачалоПериода = Объект.СобытиеКалендаря.ДатаНачалаДокументов;
		НоваяСтрока.КонецПериода = Объект.СобытиеКалендаря.ДатаОкончанияДокументов;
		
	КонецЕсли;
	
	Возврат ТаблицаНалоги;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРедактированиеУведомления(РезультатЗакрытия = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	ОбновитьСведенияОбУведомлениях();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСведенияОбУведомлениях()
	
	Если Не ПлательщикЕНП Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьУведомления();
	
	УправлениеФормойБлокУведомление();
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьУведомления()
	
	ТаблицаУведомления = ЕдиныйНалоговыйСчет.ДанныеДляУведомлений(ЗаписьКалендаря, Объект.Организация, ПериодСобытия);
	УведомленияОбИсчисленныхНалогах.Загрузить(ТаблицаУведомления);
	
	УведомлениеОбИсчисленныхНалогахПодготовлено = УведомленияОбИсчисленныхНалогах.Количество() > 0;
	
КонецПроцедуры 

&НаКлиенте
Процедура УведомлениеНажатие(Команда)
	
	// Команды генерируются в КопироватьЭлементСПодчиненными() и содержат числовой идентификатор,
	// совпадающий с идентификаторами строк в списке Платежи
	Идентификатор = ЕдиныйНалоговыйСчетКлиент.Идентификатор(Команда.Имя);
	Если Идентификатор = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьУведомление(Идентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьУведомление(Идентификатор)
	
	ОткрытьДокументОповещение = Новый ОписаниеОповещения("ОбработатьРедактированиеУведомления", ЭтотОбъект);
	
	ПараметрыФормыУведомления = ПараметрыФормыУведомления(Идентификатор);
	
	Если ПодаетсяУведомлениеПоНалогуЗаПериод Тогда
		ИмяОбъекта = "УведомлениеОбИсчисленныхСуммахНалогов";
	Иначе
		ИмяОбъекта = "ОперацияПоЕдиномуНалоговомуСчету";
	КонецЕсли;
	
	ОткрытьФорму("Документ.УведомлениеОбИсчисленныхСуммахНалогов.ФормаОбъекта",
		ПараметрыФормыУведомления,
		ЭтотОбъект,
		,
		,
		,
		ОткрытьДокументОповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыФормыУведомленияПоСтроке(СтрокаУведомления)
	
	Если ЗначениеЗаполнено(СтрокаУведомления.Уведомление) Тогда
		Возврат Новый Структура("Ключ", СтрокаУведомления.Уведомление);
	Иначе
		Возврат ПараметрыФормыПустогоУведомления();
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПараметрыФормыПустогоУведомления()
	
	ЗначенияЗаполнения = Новый Структура("Организация", Объект.Организация);
	
	Возврат Новый Структура("ЗначенияЗаполнения, ПериодСобытия, СобытиеКалендаря",
	ЗначенияЗаполнения, Объект.ПериодРегистрации, Объект.СобытиеКалендаря);
	
КонецФункции

&НаСервере
Функция ПараметрыФормыУведомления(Идентификатор)
	
	Если Идентификатор = Неопределено Тогда 
		// Получим параметры формы для пустого документа
		Возврат ПараметрыФормыПустогоУведомления();
	КонецЕсли;
	
	СтрокаУведомления = УведомленияОбИсчисленныхНалогах.НайтиПоИдентификатору(Идентификатор);
	Если СтрокаУведомления = Неопределено Тогда
		Возврат ПараметрыФормыПустогоУведомления();
	КонецЕсли;
	
	Возврат ПараметрыФормыУведомленияПоСтроке(СтрокаУведомления);
	
КонецФункции

&НаСервере
Процедура УправлениеФормойБлокУведомление()
	
	ЕдиныйНалоговыйСчет.УправлениеФормойБлокУведомление(ЭтотОбъект,
		НалогДляУведомленияЧисло <> 0, , 2);
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаНалоговыхВычетовНажатие(Элемент, СтандартнаяОбработка)
	СуммаСтраховыхВзносовЕННажатие(Элемент, СтандартнаяОбработка)
КонецПроцедуры

#КонецОбласти





