
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	СформироватьОтборНомеровГТД();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьНомераГТД()
	
	УсловияОтбора = Новый Структура;
	УсловияОтбора.Вставить("Организация");
	УсловияОтбора.Вставить("Номенклатура");
	УсловияОтбора.Вставить("Характеристика");
	УсловияОтбора.Вставить("Партия");
	УсловияОтбора.Вставить("СтранаПроисхождения");
	УсловияОтбора.Вставить("ПоддержкаИнтеркампани");
	ЗаполнитьЗначенияСвойств(УсловияОтбора, Параметры);
	
	Если Не Параметры.Свойство("ПоддержкаИнтеркампани") Тогда
		УсловияОтбора.ПоддержкаИнтеркампани = Истина;
	КонецЕсли;
	
	Возврат Справочники.НомераГТД.ПолучитьМассивИспользуемыхНомеровГТД(УсловияОтбора);
	
КонецФункции

&НаСервере
Процедура СформироватьОтборНомеровГТД()
	
	МассивГТД = ПолучитьНомераГТД();
	Если МассивГТД.Количество() > 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", МассивГТД,
			ВидСравненияКомпоновкиДанных.ВСписке, НСтр("ru = 'Отбор по номеру ГТД'"), Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
