#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСоответствиеПолейДокументовОснований(Форма, СоответствиеПолей) Экспорт
	
	ИнтеграцияИСМПУНФКлиентСервер.ЗаполнитьСоответствиеПолейДокументовОснований(Форма, СоответствиеПолей);
	
КонецПроцедуры

// Реализовать получение значения Признать определяемого типа ВариантДействийПоРасхождениямКодовМаркировкиИСМП.
// Параметры:
//  ВариантДействия - ОпределяемыйТип.ВариантДействийПоРасхождениямКодовМаркировкиИСМП - значение варината действия.
//
Процедура ПриОпределенииВариантаДействийПоРасхождениямКодовМаркировкиИСМППризнать(ВариантДействия) Экспорт
	
	
КонецПроцедуры

// Реализовать получение значения НеПризнать определяемого типа ВариантДействийПоРасхождениямКодовМаркировкиИСМП.
//
// Параметры:
//  ВариантДействия - ОпределяемыйТип.ВариантДействийПоРасхождениямКодовМаркировкиИСМП - значение варината действия.
//
Процедура ПриОпределенииВариантаДействийПоРасхождениямКодовМаркировкиИСМПНеПризнать(ВариантДействия) Экспорт
	
	
КонецПроцедуры

#КонецОбласти
