////////////////////////////////////////////////////////////////////////////////
// Подсистема "Интеграция с 1С:Документооборотом"
// Модуль ИнтеграцияС1СДокументооборот3КлиентПовтИсп, клиент, повт. использование
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Проверяет описывает ли переданный тип документ ДО3.
//
// Параметры:
//   ТипОбъектаXDTO - Строка - тип объекта.
//
// Возвращаемое значение:
//   Булево
//
Функция ЭтоДокументДО3(ТипОбъектаXDTO) Экспорт
	
	Возврат ИнтеграцияС1СДокументооборот3ВызовСервера.ЭтоДокументДО3(ТипОбъектаXDTO);
	
КонецФункции

// Возвращает значение настройки ПредупреждатьПриЗащитеУчастника.
//
// Возвращаемое значение:
//   Булево
//
Функция ПредупреждатьПриЗащитеУчастника() Экспорт
	
	Возврат ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
		"НастройкиБольшеНеПоказывать",
		"ПоказыватьПредупреждениеПриУстановкеЗащитыУчастникаДействия",
		Истина);
	
КонецФункции

#КонецОбласти