
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Временное решение. Обход ошибки первоначального заполнения.
	Если Не Справочники.ВидыНачисленийИУдержаний.НалогНаДоходы.Используется Тогда
		НалогНаДоходыОбъект = Справочники.ВидыНачисленийИУдержаний.НалогНаДоходы.ПолучитьОбъект();
		НалогНаДоходыОбъект.Используется = Истина;
		Попытка
			НалогНаДоходыОбъект.Записать();
		Исключение
			ТекстСообщенияОбОшибке = НСтр("ru = 'Не получилось изменить элемент налоги на доходы.'");
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(НалогНаДоходыОбъект, ТекстСообщенияОбОшибке);
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры
