#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ТипНоменклатурыВключен(ПараметрТипНоменклатуры) Экспорт
	
	Если ПараметрТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПодарочныйСертификат")
		И Не ПолучитьФункциональнуюОпцию("ИспользоватьПодарочныеСертификаты") Тогда
		Возврат Ложь;
	ИначеЕсли ПараметрТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ВидРабот")
		И Не ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуРаботы") Тогда
		Возврат Ложь;
	ИначеЕсли ПараметрТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа")
		И Не ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуРаботы") Тогда
		Возврат Ложь;
	ИначеЕсли ПараметрТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Операция")
		И Не ПолучитьФункциональнуюОпцию("ИспользоватьТехоперации") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если ОбщегоНазначенияУНФ.ЭтоРозница() Тогда

		СтандартнаяОбработка = Ложь;

		СписокВыбора = Новый СписокЗначений;
		СписокВыбора.Добавить(Перечисления.ТипыНоменклатуры.Запас);
		СписокВыбора.Добавить(Перечисления.ТипыНоменклатуры.Операция);
		СписокВыбора.Добавить(Перечисления.ТипыНоменклатуры.ПодарочныйСертификат);
		СписокВыбора.Добавить(Перечисления.ТипыНоменклатуры.Услуга);
		
		ДанныеВыбора = СписокВыбора;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
