
#Область ПрограммныйИнтерфейс

// Определяет путь дополнительного файда лога.
// 
// Параметры:
//  ПутьКФайлу - Строка - Путь к файлу
Процедура ПриОпределенииПутиКФайлуЛогирования(ПутьКФайлу) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для БРМК. Определяет коды маркировки на оборудовании розлива по переданной таблице товаров.
// Необходимо заполнить выходной параметр КегиНаОборудованииРозлива
// 
// Параметры:
//  КегиНаОборудованииРозлива - ТаблицаЗначений - Коды маркировки подключенные к оборудованию розлива:
//  * Номенклатура - ОпределяемыйТип.Номенклатура - номенклатура кода маркировки кега
//  * Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатуры - характеристика кода маркировки кега
//  * Серия - ОпределяемыйТип.СерияНоменклатуры - серия кода маркировки кега
//  * ИндексИсходнойСтроки - Число - Служебный, в переопределении можно не заполнять
//  * УчитыватьСерии - Булево - учитвать серии исходной таблицы товаров
//  * ВариантЧастичногоВыбытия - ПеречислениеСсылка.ВариантыУчетаЧастичногоВыбытияИС - настройка частичного выбытия номенклатуры
//  * КодМаркировки - ОпределяемыйТип.ШтрихкодУпаковкиИС - код маркировки кега
//  * Комментарий - ОпределяемыйТип.ОборудованиеРозливаИСМП - описание оборудования, к которому подключен кег см. РегистрыСведений.КегиНаОборудованииРозливаИСМП
//  * КодМаркировкиСтрокой - Строка - представление кода маркировки см. РегистрыСведений.КегиНаОборудованииРозливаИСМП
//  * ПолныйКодМаркировки - Строка - полный код маркировки кега Base64 см. РегистрыСведений.КегиНаОборудованииРозливаИСМП
//  ТаблицаТовары - см. РегистрыСведений.КегиНаОборудованииРозливаИСМП.НоваяТаблицаПоискаКодовМаркировкиНаОборудованииРозлива
//  ПараметрыСканирования - см. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования
//  ТолькоПолноеСоответствие - Булево - Искать без учета подменной номенклатуры
Процедура ПриОпределенииКодовМаркировкиКегНаОборудованииРозлива(КегиНаОборудованииРозлива, ТаблицаТовары, ПараметрыСканирования, ТолькоПолноеСоответствие) Экспорт
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти
