
#Область ПрограммныйИнтерфейс

// Функция показывает является ли текущая конфигурация конфигурацией УправлениеНебольшойФирмой
// 
// Возвращаемое значение:
//  Булево - признак является ли текущая конфигурация конфигурацией УправлениеНебольшойФирмой
//
Функция ЭтоУНФ() Экспорт
	
	Возврат ВозможностиПриложения.ЭтоУНФ();
	
КонецФункции

// Функция показывает является ли текущая конфигурация конфигурацией Розница
// 
// Возвращаемое значение:
//  Булево - признак является ли текущая конфигурация конфигурацией Розница
//
Функция ЭтоРозница() Экспорт
	
	Возврат ВозможностиПриложения.ЭтоРозница();
	
КонецФункции

#КонецОбласти
