
#Область СлужебныйПрограммныйИнтерфейс

Функция ЗагрузитьСтатусыОплатыЗапускЗадания(УникальныйИдентификатор) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(
		УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания
		= НСтр("ru = 'Загрузка статусов операций.'");
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьВФоне(
		"ИнтеграцияСПлатежнымиСистемамиУНФ.ПолучитьСтатусыОперацияC2B",
		,
		ПараметрыВыполнения);
	
	Возврат РезультатВыполнения;
	
КонецФункции

Процедура ЗаписатьДанныеКассовойСсылки(КассаККМ, КассовыеСсылки, Отказ = Ложь) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Если КассовыеСсылки = Неопределено Тогда
		ОбщегоНазначения.УдалитьДанныеИзБезопасногоХранилища(КассаККМ, "КассовыеСсылкиСБП");
	Иначе
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(КассаККМ, КассовыеСсылки, "КассовыеСсылкиСБП");
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьКассовыеСсылки(СпособОплаты, НастройкиКассовыхСсылокСБП, Отказ) Экспорт

	Для Каждого НастройкаПодключения Из НастройкиКассовыхСсылокСБП.НастройкиПодключения Цикл
		
		Если НастройкаПодключения.СпособОплаты = СпособОплаты Тогда
			
			РезультатСоздания = ПереводыСБПc2b.КассоваяСсылка(НастройкаПодключения.Интеграция);
			
			Если ЗначениеЗаполнено(РезультатСоздания.КодОшибки) Тогда
				
				Отказ 				= Истина;
				РезультатСоздания 	= РезультатСоздания.СообщениеОбОшибке;
				
			КонецЕсли;
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
    Возврат РезультатСоздания;
	
КонецФункции

Функция ШаблонСообщенияОплатаСБП(Предмет = Неопределено, ПлатежнаяСсылка = "", СуммаСсылкиСБП = 0) Экспорт

    Возврат ИнтеграцияСПлатежнымиСистемамиУНФ.ШаблонСообщенияОплатаСБП(Предмет, ПлатежнаяСсылка, СуммаСсылкиСБП);
	
КонецФункции

Процедура НастройкаДекорацииПодключенияКассовыхСсылок(НастройкиЭлемента, Интеграция, Организация, ТорговыйОбъект, СпособОплаты) Экспорт
	
	ВсеНастройкиЭлемента = Новый Структура;
	
	ИнтеграцияСПлатежнымиСистемамиУНФ.НастройкаДекорацииПодключенияКассовыхСсылок(
		ВсеНастройкиЭлемента, 
		Интеграция, 
		Организация, 
		ТорговыйОбъект, 
		СпособОплаты);

	Если ВсеНастройкиЭлемента.Количество() Тогда

		НастройкиЭлемента.Вставить("Заголовок", "");
		НастройкиЭлемента.Вставить("Видимость", Ложь);
		
		ЗаполнитьЗначенияСвойств(НастройкиЭлемента, ВсеНастройкиЭлемента);

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
