////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы (УНФ)
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииПодсистемы
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Имя = "УправлениеНебольшойФирмой";
	Описание.Версия = "3.0.8.73";
	Описание.ИдентификаторИнтернетПоддержки = "SmallBusiness";
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления 
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	#Область ПервыйЗапуск
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.0.1";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ПервыйЗапуск_РазделенныеДанные";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.0.1";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ПервыйЗапуск_ОбщиеДанные";
	Обработчик.ОбщиеДанные = Истина;
	
	#КонецОбласти
	
	#Область Обработчики_3_0_5
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.4";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "Документы.ВводНачальныхОстатков.ЗаполнитьПризнакЗакупкиКУДиРОтдельнымДокументом";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("97cdc7ae-3b7c-4084-ab5a-af3f6ad7e018");
	Обработчик.Комментарий = НСтр("ru = 'Установка флага ЗакупкаКУДиРОтдельнымДокументом документов ""Ввод начальных остатков"" с разделом учета ""Запасы""'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.31";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ЗаполнитьПараметрыСчетовУчетаНДС";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("ccf2dc6a-1ad9-1095-98bb-4e383a9b90c5");
	Обработчик.Комментарий = НСтр("ru = 'Заполнить параметры счетов учета НДС.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.31";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ЗаполнитьСчетаУчетаНДСВНоменклатуре";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("9be0bbeb-87fa-46df-a6f7-c9a64a613ab3");
	Обработчик.Комментарий = НСтр("ru = 'Заполняет счета учета НДС в номенклатуре'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.36";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.УстановитьНастройкиОрдерныхСкладов";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("4e68bae8-a132-48e9-8e8f-530c3e08d3dc");
	Обработчик.Комментарий = НСтр("ru = 'Устанавливает новые настройки ордерных складов'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.38";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ЗаполнитьСлужебныеРеквизитыКонтактнойИнформацииКонтрагентов";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("d603b3f9-f562-464c-b99f-4db9c6e4e0b9");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение служебных реквизитов контактной информации контрагентов'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.68";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.УдалитьНеотмеченныеДоговорыИзАктовСверкиВзаиморасчетов";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("81ea64b5-d062-4335-add5-43402624071e");
	Обработчик.Комментарий = НСтр("ru = 'Удаление неотмеченных договоров из документов Сверка взаиморасчетов'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.84";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.УстановитьХранениеКартЛояльностиВРМК";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("8274c557-8146-4b82-b45d-c7354c30c7b7");
	Обработчик.Комментарий = НСтр("ru = 'Установка признака хранения карт лояльности в РМК'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.85";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ЗаполнитьСчетаУчетаНДСВоВнеоборотныхАктивах";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("9be0bbeb-87fa-4b82-add5-c8a64a613ab2");
	Обработчик.Комментарий = НСтр("ru = 'Заполняет счета учета НДС во внеоборотных активах'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.91";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "Документы.ЗаданиеНаРаботу.ЗаполнитьДатаНачалаОкончания";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("6d57dc70-a476-47db-af77-8798ede1241e");
	Обработчик.Комментарий = НСтр("ru = 'Заполнить реквизиты Начало/Окончания документов Задание на работу.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.99";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.УстановитьИспользованиеПроцессовСостояний";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("cefd8f19-4e21-47d6-870c-0e00c394635b");
	Обработчик.Комментарий = НСтр("ru = 'Установка признака использования процессов состояний'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.99";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьОтчеты_3_0_5";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("79df2cbb-68a8-4fc4-bbc1-a398ace81332");
	Обработчик.Комментарий = НСтр("ru = 'Обновление настроек вариантов отчетов.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.113";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ИнтеграцияСИнтернетМагазиномСервер.ОбновлениеИнформационнойБазыУстановитьРеквизитВыгружатьЗаказыНаСайт";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("b593777f-6aa3-431b-92b0-01f6fdd1d3cc");
	Обработчик.Комментарий = НСтр("ru = 'Выборочное включение нового флажка ВыгружатьЗаказыНаСайт в справочнике НастройкиИнтеграцииСИнтернетМагазином.'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.6.37";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ИнтеграцияСМаркетплейсомOzonСервер.ОбновлениеИнформационнойБазыУстановитьРеквизитыВыгрузкиПоВидамДанных";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("9483423a-f8f9-444f-84ae-ca5ad7bdcdc6");
	Обработчик.Комментарий = НСтр("ru = 'Включение новых флажков по видам данных для выгрузки в Ozon.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.6.80";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ИнтеграцияСЯндексМаркетСервер.ОбновлениеИнформационнойБазыУстановитьРеквизитУникальнаяЦенаДляКаждогоМагазина";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("898a0e9d-df9e-4a37-b6dc-0012302f2a18");
	Обработчик.Комментарий = НСтр("ru = 'Включение нового флажка ""Уникальная цена для каждого магазина"" в Яндекс Маркет.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.112";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.УстановитьНастройкиКонтроляДублейКонтактныхЛиц";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("3f2c4048-04c9-4c73-9839-650919d93d08");
	Обработчик.Комментарий = НСтр("ru = 'Установка настройки поиска дублей по номеру телефона'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.115";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьВидыНалоговПоСтраховымВзносам";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("4200b9d2-a02d-4e7a-98c2-5242149dc735");
	Обработчик.Комментарий = НСтр("ru = 'Обработать виды налогов по страховым взносам.'"); 
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.115";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбработатьДанныеПоСтраховыеВзносамПосле2023";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("d2c933cd-a928-4350-8498-4ec77c583bbc");
	Обработчик.Комментарий = НСтр("ru = 'Обработать документы по страховым взносам после 2023 года.'");  
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.121";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьКалендарьНалоговИОтчетностьИОчиститьКоды";
	Обработчик.Комментарий = НСтр("ru = 'Обновить задачи календаря налоговой отчетности.'"); 
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.126";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "УправлениеКонтактнойИнформациейУНФ.ОбновитьВидКонтактнойИнформацииТорговыеТочки";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("b5b5399c-a4d9-4a80-95ca-95b669bbac50");
	Обработчик.Комментарий = НСтр("ru = 'Восстановить значения реквизитов вида контактной информации Торговые точки к ожидаемым значениям.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.129";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "УправлениеКонтактнойИнформациейУНФ.ОбновитьВидыКонтактнойИнформации";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("10dfc42f-121a-4773-9543-84639125fe8d");
	Обработчик.Комментарий = НСтр("ru = 'Перенести настройку ОтображатьВсегда из регистра в справочник и привести к ожидаемому реквизит ВидРедактирования.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.142";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.УстановитьКонстантуПодключаемоеОборудование";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("682388a4-3d33-4547-9274-41109e01cba6");
	Обработчик.Комментарий = НСтр("ru = 'Установить константу подключаемого оборудования'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.143";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.СоздатьПредопределенныйЭлементНДС";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("ccf2dc6a-1ad9-4547-98bb-82639125fe8d");
	Обработчик.Комментарий = НСтр("ru = 'Создать предопределенный вид налога НДС.'");
	
	#КонецОбласти
	
	#Область Обработчики_3_0_6
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "3.0.6.4";   
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыУНФ.ЗаполнитьДвиженияПоУведомлениямСОтрицательнойСуммой";
	Обработчик.Комментарий         = НСтр("ru = 'Заполняет движения по Уведомлениям УСН с отрицательной суммой'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.6.14";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ПечатьДокументовУНФ.ОбновитьСКДШаблоновЭтикеток";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("fa9ddc1c-de74-4140-bb87-ee1bf96d9b9b");
	Обработчик.Комментарий = НСтр("ru = 'Обновить схемы компоновки данных в шаблонах этикеток и ценников.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.6.16";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ИнтеграцияБЗКБУНФ.ВключитьИспользованиеРеглУчетаЗарплатыКадров";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("bd793c9a-22da-4db8-9f2e-8d643371237c");
	Обработчик.Комментарий = НСтр("ru = 'Включение опции Регламентированный учет зарплаты и кадров, если были включены опции БЗКБ'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.6.18";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьОтчеты_3_0_6";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("755d5276-ff13-4354-99e3-06e0c7d5091f");
	Обработчик.Комментарий = НСтр("ru = 'Обновление настроек вариантов отчетов.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.6.24";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.УстановитьВыкупКомиссионераВПолитикиУчетаСерийУправлениеОстатками";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("3e796356-df57-4c70-bbaa-3497679fb2cb");
	Обработчик.Комментарий = НСтр("ru = 'Обновить типы документов в политиках учета серий.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.6.29";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.УстановитьВозвратВыкупленногоТовараКомиссионераВПолитикиУчетаСерийУправлениеОстатками";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("8543a84f-7066-46bc-a1dd-ebe0e782b240");
	Обработчик.Комментарий = НСтр("ru = 'Обновить типы документов в политиках учета серий - Возврат выкупленных товаров комиссионером.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.6.37";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ИнтеграцияБЗКБУНФ.ОбработатьДубльПаспортаИностранногоГражданина";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("57053407-f278-4f96-8aa6-d185c9a0859d");
	Обработчик.Комментарий = НСтр("ru = 'Переименование вида документа физ. лица Иностранный паспорт'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.6.50";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ПометитьНаУдалениеЗадачуВзносыИП";
	Обработчик.Комментарий = НСтр("ru = 'Обновить задачи календаря налоговой отчетности.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.6.58";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.УстановитьПризнакиУзлаУРМК";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("83076805-b8bb-42f9-bd6d-50704aec6e36");
	Обработчик.Комментарий = НСтр("ru = 'Установка признака выгрузки серий и физических лиц в РМК'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.6.59";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ЗаполнитьНовыеРеквизитыБонусныхПрограмм";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("de03ca23-4567-4322-90f0-b0da3e383839");
	Обработчик.Комментарий = НСтр("ru = 'Установка значений новых настроек бонусных программ'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.6.66";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.УстановитьПризнакМножественностиДляРеквизитовСписка";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("e8b2bb60-b387-4fc3-b9a4-3d438f2765d1");
	Обработчик.Комментарий = НСтр("ru = 'Взведение флага множественности реквизитов списка контрагентов и номенклатуры'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.6.66";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ЗаполнитьРеквизитСегментДляСпискаВСоставеСегментаКонтрагентов";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("51b037c1-23f8-4857-a2e9-941a4ac9d1c1");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение служебного реквизита сегмента контрагентов для вывода в список'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.6.66";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ЗаполнитьРеквизитСегментДляСпискаВСоставеСегментаНоменклатуры";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("6a36b793-828e-4ba1-9a3a-8756a7dd6892");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение служебного реквизита сегмента номенклатуры для вывода в список'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.6.68";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбменСВнешнимиКалендарями.ОбновитьПараметрВесьДеньДляВсехЗадачСотрудника";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("8772e799-c07f-42ae-9861-5c28dca01027");
	Обработчик.Комментарий = НСтр("ru = 'Установка флага Весь День для задач сотрудника'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.6.75";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "Документы.МассоваяРассылка.УстановитьНовоеСостояниеДляВнешнихСервисов";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("fa30d252-2e81-4d6d-a0ba-55eb2dbc804e");
	Обработчик.Комментарий = НСтр("ru = 'Поменять состояние Отправлено на ВнешнийСервис'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.6.75";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "Документы.МассоваяРассылка.УстановитьНовыеСостоянияДляРассылок";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("05203b44-b749-4722-96ab-46d9839326fb");
	Обработчик.Комментарий = НСтр("ru = 'Заменить состояния Отправлено, Сформировано на ошибочные, если были ошибки отправки'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.6.76";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ИсправитьДатуОкончанияСобытияПерсСведенияОФизическихЛицах";
	Обработчик.Комментарий = НСтр("ru = 'Обновить задачу персонифицированные сведения о физических лицах (за ноябрь 2023 г.)'"); 
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.6.89";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьКонстантуПредопределенныеШаблоныСообщений";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("05203b44-b749-4722-96ab-46d9839326fe");
	Обработчик.Комментарий = НСтр("ru = 'Замена параметров шаблона сообщений для отправки частичной оплаты СБП'");
	
	// При изменении поставляемых данных следует переносить обработчик на новую версию, а не копировать,
	// за исключением ситуаций, когда обработчик важно выполнить заведомо до обработчика обновления зависимых данных
	// (о таких исключениях должно быть написано в комментарии к обработчику).
	// При переносе обработчика следует переносить и этот комментарий.
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "3.0.6.113";
	Обработчик.Процедура           = "РегистрыСведений.РазмерФиксированныхВзносовОтНесчастныхСлучаевАУСН.ЗаполнитьПоставляемыеДанные";
	Обработчик.НачальноеЗаполнение = Ложь; // Для начального заполнения вызывается в 3.0.127.28
	Обработчик.ОбщиеДанные         = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.6.127";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.ОбщиеДанные = Истина;           
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьКалендарьНалоговИОтчетность2024";
	Обработчик.Комментарий = НСтр("ru = 'Заполнить задачи календаря налоговой отчетности на 2024 год.'"); 
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "3.0.6.133";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура           = "РегистрыНакопления.РасчетыПоЕдиномуНалоговомуСчету.ЗаполнитьГоловнуюОрганизацию";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение головной организации РасчетыПоЕдиномуНалоговомуСчету.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "3.0.6.133";  
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура           = "РегистрыНакопления.РасчетыПоНалогамНаЕдиномНалоговомСчете.ЗаполнитьГоловнуюОрганизацию";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение головной организации РасчетыПоНалогамНаЕдиномНалоговомСчете.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "3.0.6.133";   
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура           = "РегистрыНакопления.РасчетыПоСанкциямНаЕдиномНалоговомСчете.ЗаполнитьГоловнуюОрганизацию";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение головной организации РасчетыПоСанкциямНаЕдиномНалоговомСчете.'");
	
    Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.6.147";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.ОбщиеДанные = Истина;           
	Обработчик.Процедура = "РегистрыСведений.ПредельнаяВеличинаБазыСтраховыхВзносовУНФ.УстановитьПредельнуюВеличинуБазыСтраховыхВзносов";
	Обработчик.Комментарий = НСтр("ru = 'Заполнить Предельную величину базы страховых взносов (упр.)'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.6.185";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.УдалитьРегистрациюИзмененийДопустимыеЗначенияПотребительскихСвойствЗЕРНО";
	Обработчик.Комментарий = НСтр("ru = 'Удалить зарегистрированные изменения на узлах обмена регистра ""ДопустимыеЗначенияПотребительскихСвойствЗЕРНО"".'");
	#КонецОбласти
	
	#Область Обработчики_3_0_7
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.7.2";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ПереносОстатковНоменклатурыПоставщиков";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("05a19b07-d22c-44f6-b02a-b60190213aee");
	Обработчик.Комментарий = НСтр("ru = 'Перенос остатков номенклатуры поставщиков.'");
	
	// При изменении поставляемых данных следует переносить обработчик на новую версию, а не копировать,
	// за исключением ситуаций, когда обработчик важно выполнить заведомо до обработчика обновления зависимых данных
	// (о таких исключениях должно быть написано в комментарии к обработчику).
	// При переносе обработчика следует переносить и этот комментарий.
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "3.0.7.6";
	Обработчик.Процедура           = "РегистрыСведений.РазмерФиксированныхВзносовОтНесчастныхСлучаевАУСН.ЗаполнитьПоставляемыеДанные";
	Обработчик.НачальноеЗаполнение = Ложь; // Для начального заполнения вызывается в 3.0.127.28
	Обработчик.ОбщиеДанные         = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.7.8";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьОтчеты_3_0_7";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("4b3f83c6-f3fa-41b6-827f-05a2ba526349");
	Обработчик.Комментарий = НСтр("ru = 'Обновление настроек вариантов отчетов.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.7.30";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьПроизвольныеУсловияСкидок";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("2c57a989-e796-4cf4-be1b-cbda11b9c447");
	Обработчик.Комментарий = НСтр("ru = 'Обновление типового макета произвольного условия скидок'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.7.33";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОчиститьСохраненныеОтборыПечатиЭтикеток";
	Обработчик.Комментарий = НСтр("ru = 'Очистка сохраненных отборов печати этикеток для применения новых настроек.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.7.34";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ИнтеграцияБЗКБУНФ.ЗаполнитьДолжностьНаименованиеКраткое";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("fba8c663-b841-4408-85b2-581301b32832");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение поля Краткое наименование в справочнике Должности'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.7.34";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "РегистрыСведений.ФИОФизическихЛиц.ЗаполнитьИнициалы";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("bb4eb711-60e0-4c61-ba8f-267a95fb3dbe");
	Обработчик.Комментарий = НСтр("ru = 'Заполняет инициалы в регистре сведений ""Фамилия, имя, отчество физического лица"".'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.7.34";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ИнтеграцияБЗКБУНФ.ЗаполнитьФИОФизическихЛиц";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("c189c3d7-cb3a-467f-a436-0dfee92e5811");
	Обработчик.Комментарий = НСтр("ru = 'Заполняет ФИО и инициалы в справочнике Физические лица'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.7.35";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.УстановитьВариантВыводаСуммыБезСкидки";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("59d1f1db-bfea-437d-866a-a6adea9f618f");
	Обработчик.Комментарий = НСтр("ru = 'Устанавливает вариант вывода на печать суммы без скидки.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.7.40";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "Справочники.ПодписиПисем.ПереместитьОбъектыВНовыйТекущийСправочник";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("123738b6-57aa-42d0-beb2-4b42a3f7fef4");
	Обработчик.Комментарий = НСтр("ru = 'Перенос объектов в новый справочник.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.7.46";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ЗаполнитьНастройкиПредпросмотра";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("99b27363-47ad-445b-81c8-d8cde624252b");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение настроек предпросмотра документов в формах списков.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.7.77";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.СоздатьЗаданияЗаписиОтложенныхСообщенийВСистемуВзаимодействия";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("05ba6c1a-ad22-40c3-be81-43f7ab7afb15");
	Обработчик.Комментарий = НСтр("ru = 'Создание заданий записи отложенных сообщений в Систему взаимодействия.'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.7.78";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.Процедура = "ИнтеграцияБЗКБУНФ.ОбновитьВидыДоходовВычетовНДФЛ2024";
	Обработчик.Комментарий = НСтр("ru = 'Создать новые виды доходов и вычетов НДФЛ с 2024 года'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.7.85";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.ОбщиеДанные = Истина;           
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ПометитьНаУдалениеЗадачиВзносыИПДоходы";
	Обработчик.Комментарий = НСтр("ru = 'Пометить на удаление квартальные задачи взносы ИП ПСН и УСН Доходы.'");  

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.7.89";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.УстановитьНастройкиКонтроляМаркировкиРМК";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("1b67852b-5f78-4a36-b8eb-6506e6a06601");
	Обработчик.Комментарий = НСтр("ru = 'Устанавливает настройки контроля маркировки РМК.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "3.0.7.98";
	Обработчик.Процедура           = "ОбновлениеИнформационнойБазыУНФ.ЗаполнитьРегистрНастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС";
	Обработчик.НачальноеЗаполнение = Истина; 
	Обработчик.Комментарий         = НСтр("ru = 'Заполняет тариф фиксированных взносов ИП'");
	Обработчик.РежимВыполнения     = "Отложенно";
	Обработчик.Идентификатор       = Новый УникальныйИдентификатор("d320f800-1f35-430b-81fb-61f044a66e58"); 
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.7.103";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.ОбщиеДанные = Истина;           
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбработатьДублиСправочникаВидыТарифовСтраховыхВзносовУНФ";
	Обработчик.Комментарий = НСтр("ru = 'Обработать дубли и актуализировать справочник ""Виды тарифов страховых взносов""'");

		
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.7.121";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьМакетыШаблоновЧекаККМ";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("bd95237e-e21d-4c73-be58-995a57adfec4");
	Обработчик.Комментарий = НСтр("ru = 'Обновление типового макета шаблона чека ККМ'");
	
		
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.7.122";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьПризнакПредметаРасчетаПивоИМех";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("21d13301-ceee-4ee8-b9c9-f34fce484ea7");
	Обработчик.Комментарий = НСтр("ru = 'Обновление признака предмета расчета по пиву, продающемуся в розлив, и меховым изделиям'");
	
	#КонецОбласти
	
	#Область Обработчики_3_0_8
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.8.28";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьЗаданияЗаписиОтложенныхСообщенийВСистемуВзаимодействия";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("c0ad00be-df9b-4b73-a2bc-dd255880332e");
	Обработчик.Комментарий = НСтр("ru = 'Обновление заданий записи отложенных сообщений в Систему взаимодействия.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.8.39";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбработатьДанныеОбновлениеДатРазрешительногоРежима";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("6be2b7d6-5b1b-453c-a6ec-5add55b6ac64");
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "ОбновлениеИнформационнойБазыУНФ.ЗарегистрироватьДанныеКОбработкеОбновлениеДатРазрешительногоРежима";
	Обработчик.ОчередьОтложеннойОбработки = 1;
	Обработчик.ЧитаемыеОбъекты = "РегистрСведений.НастройкиУчетаМаркируемойПродукцииИСМП";
	Обработчик.ИзменяемыеОбъекты = "РегистрСведений.НастройкиУчетаМаркируемойПродукцииИСМП";
	Обработчик.БлокируемыеОбъекты = "";
	Обработчик.Комментарий = НСтр("ru = 'Обновляет даты начала действия разрешительного режима при розничной продаже'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.8.42";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.ОбщиеДанные = Истина;           
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьЗаписиСтраховыеВзносыПриДоходахСвыше300тр";
	Обработчик.Комментарий = НСтр("ru = 'Обновить срок по задаче взносов с доходов за I квартал 2024'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.8.63";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.ОбщиеДанные = Истина;           
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ПометитьНаУдалениеЗадачиВзносыИПДоходы";
	Обработчик.Комментарий = НСтр("ru = 'Пометить на удаление квартальные задачи взносы ИП ПСН и УСН Доходы.'"); 
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.8.68";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ИсправитьНумерациюСогласийПД";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("b40b38c3-b78b-4aaa-983b-ab64c4701bd0");
	Обработчик.Комментарий = НСтр("ru = 'Исправление нумерации согласий на обработку персональных данных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.8.72";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ВидыПриложенийУНФ.УстановитьРасширениеВидаПриложенияПриНеобходимости";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("c1d9d460-483d-44dc-be8e-a62732bf8ea1");
	Обработчик.Комментарий = НСтр("ru = 'Установить расширение вида приложения при необходимости'");

	#КонецОбласти
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыБСП.ПередОбновлениемИнформационнойБазы
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
	Возврат;
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыБСП.ПослеОбновленияИнформационнойБазы
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия, Знач ВыполненныеОбработчики,
	ВыводитьОписаниеОбновлений, Знач МонопольныйРежим) Экспорт
	
	Возврат;
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыПереопределяемый.ПриПодготовкеМакетаОписанияОбновлений
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	Возврат;
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковПереходаСДругойПрограммы
Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.ПредыдущееИмяКонфигурации = "Розница";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновлениеРозницыДоУНФ";
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыПереопределяемый.ПриОпределенииНастроек
Процедура ПриОпределенииНастроекОбновленияИнформационнойБазы(Параметры) Экспорт
	
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.АвтоматическиеСкидки);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.Валюты);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ВидыДокументовФизическихЛиц);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ВидыДоходовПоСтраховымВзносамУНФ);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ВидыЗаказНарядов);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ВидыЗаказовПокупателей);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ВидыНалогов);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ВидыНачисленийИУдержаний);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ВидыРабочегоВремени);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ВидыЦен);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ДополнительныеУсловия);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ИсточникиПривлеченияПокупателей);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.КатегорииНоменклатуры);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.Кассы);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.КлассификаторЕдиницИзмерения);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.КодыДоходовНДФЛ);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.НаправленияДеятельности);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.Организации);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ПоказателиРасчетов);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ПочтовыеЯщики);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ПараметрыРасчетовДоставки);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ПричиныНеуспешногоЗавершенияРаботыСЛидом);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СегментыКонтрагентов);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СлужбыДоставки);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СостоянияЗаказовПокупателей);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СостоянияЗаказНарядов);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СостоянияЗаказовПоставщикам);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СостоянияЗаказовНаПроизводство);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СостоянияЗаказовНаПеремещение);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СостоянияЛидов);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СостоянияСобытий);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СтавкиНДС);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СтатьиДвиженияДенежныхСредств);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СтруктурныеЕдиницы);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.СценарииПланирования);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ШаблоныЗаполненияГрафиковРабочегоВремени);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.ПланыСчетов.Управленческий);
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.ПланыВидовХарактеристик.РеквизитыДляСписка);
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыБСП.ПриОпределенииРежимаОбновленияДанных
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыБСП.ПриЗавершенииПереходаСДругойПрограммы
Процедура ПриЗавершенииПереходаСДругойПрограммы(Знач ПредыдущееИмяКонфигурации, Знач ПредыдущаяВерсияКонфигурации,
	Параметры) Экспорт
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СлужебныеПервыйЗапуск_ОбщиеДанные

// (5.Общий) Заполняем справочник ОКУН
Процедура ЗагрузитьОКУН()
	
	Справочники.ОКУН.ЗагрузитьКлассификатор();
	Справочники.ОКУН.ПроставитьВидДеятельностиОКУН();
	
КонецПроцедуры

// (6.Общий) Заполняет РС КоэффициентДефлятор
//
Процедура ЗаполнитьКоэффициентДефлятор()
	
	// переписываем сразу весь набор
	Набор = РегистрыСведений.КоэффициентДефлятор.СоздатьНаборЗаписей();
	
	Запись = Набор.Добавить();
	Запись.Период = '20030101';
	Запись.Значение = 1;
	
	Запись = Набор.Добавить();
	Запись.Период = '20040101';
	Запись.Значение = 1.133;
	
	Запись = Набор.Добавить();
	Запись.Период = '20050101';
	Запись.Значение = 1.104;
	
	Запись = Набор.Добавить();
	Запись.Период = '20060101';
	Запись.Значение = 1.132;
	
	Запись = Набор.Добавить();
	Запись.Период = '20070101';
	Запись.Значение = 1.096;
	
	Запись = Набор.Добавить();
	Запись.Период = '20080101';
	Запись.Значение = 1.081;
	
	Запись = Набор.Добавить();
	Запись.Период = '20090101';
	Запись.Значение = 1.148;
	
	Запись = Набор.Добавить();
	Запись.Период = '20100101';
	Запись.Значение = 1.295;
	
	Запись = Набор.Добавить();
	Запись.Период = '20110101';
	Запись.Значение = 1.372;
	
	Запись = Набор.Добавить();
	Запись.Период = '20120101';
	Запись.Значение = 1.4942;
	
	Запись = Набор.Добавить();
	Запись.Период = '20130101';
	Запись.Значение = 1.569;
	
	Запись = Набор.Добавить();
	Запись.Период = '20140101';
	Запись.Значение = 1.672;
	
	Запись = Набор.Добавить();
	Запись.Период = '20150101';
	Запись.Значение = 1.798;
	
	Запись = Набор.Добавить();
	Запись.Период = '20160101';
	Запись.Значение = 1.798;
	
	Запись = Набор.Добавить();
	Запись.Период = '20180101';
	Запись.Значение = 1.868;
	
	Запись = Набор.Добавить();
	Запись.Период = '20190101';
	Запись.Значение = 1.915;
	
	Запись = Набор.Добавить();
	Запись.Период = '20200101';
	Запись.Значение = 2.005;
	
	Набор.Записать();
	
КонецПроцедуры

// (7.Общий) Заполнять РС МРОТ
//
Процедура ЗагрузитьМРОТ()
	
	Набор = РегистрыСведений.МРОТ.СоздатьНаборЗаписей();
	
	Запись = Набор.Добавить();
	
	Запись.Период = '20000701';
	Запись.Значение = 132;
	
	Запись = Набор.Добавить();
	
	Запись.Период = '20010101';
	Запись.Значение = 200;
	
	Запись = Набор.Добавить();
	
	Запись.Период = '20010701';
	Запись.Значение = 300;
	
	Запись = Набор.Добавить();
	
	Запись.Период = '20020501';
	Запись.Значение = 450;
	
	Запись = Набор.Добавить();
	
	Запись.Период = '20031001';
	Запись.Значение = 600;
	
	Запись = Набор.Добавить();
	
	Запись.Период = '20050101';
	Запись.Значение = 720;
	
	Запись = Набор.Добавить();
	
	Запись.Период = '20050901';
	Запись.Значение = 800;
	
	Запись = Набор.Добавить();
	
	Запись.Период = '20060501';
	Запись.Значение = 1100;
	
	Запись = Набор.Добавить();
	
	Запись.Период = '20070901';
	Запись.Значение = 2300;
	
	Запись = Набор.Добавить();
	
	Запись.Период = '20090101';
	Запись.Значение = 4330;
	
	Запись = Набор.Добавить();
	
	Запись.Период = '20110601';
	Запись.Значение = 4611;
	
	Запись = Набор.Добавить();
	
	Запись.Период = '20130101';
	Запись.Значение = 5205;
	
	Запись = Набор.Добавить();
	
	Запись.Период = '20140101';
	Запись.Значение = 5554;
	
	Запись = Набор.Добавить();
	
	Запись.Период = '20150101';
	Запись.Значение = 5965;
	
	Запись = Набор.Добавить();
	
	Запись.Период = '20160101';
	Запись.Значение = 6204;
	
	Запись = Набор.Добавить();
	Запись.Период = '20170101';
	Запись.Значение = 7500;
	
	Запись = Набор.Добавить();
	Запись.Период = '20180101';
	Запись.Значение = 7800;
	
	Запись = Набор.Добавить();
	Запись.Период = '20190101';
	Запись.Значение = 11280;
	
	Запись = Набор.Добавить();
	Запись.Период = '20200101';
	Запись.Значение = 12130;
	
	Запись = Набор.Добавить();
	Запись.Период = '20210101';
	Запись.Значение = 12792; 
	
	Запись = Набор.Добавить();
	Запись.Период = '20220101';
	Запись.Значение = 13890;
	
	Запись = Набор.Добавить();
	Запись.Период = '20220601';
	Запись.Значение = 15279;
	
	Запись = Набор.Добавить();
	Запись.Период = '20230101';
	Запись.Значение = 16242;
	
	Запись = Набор.Добавить();
	Запись.Период = '20240101';
	Запись.Значение = 19242;
	
	Набор.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиПервогоЗапуска

// Процедура заполняет пустую ИБ общими данными
//
// К данным относятся неразделенные сведения, например, глобальные настройки сервиса
//
Процедура ПервыйЗапуск_ОбщиеДанные() Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		// 1. Заполним константу ИзвлекатьТекстыФайловНаСервере
		Константы.ИзвлекатьТекстыФайловНаСервере.Установить(Истина);
		Константы.ИспользоватьПроверкуКонтрагентов.Установить(Истина);
		
		Константы.ВыводитьСуммуБезСкидки.Установить(Перечисления.ВариантыВыводаСуммыБезСкидки.Печатать);
		
		// 2. Заполним календарь отчетности
		Справочники.КалендарьПодготовкиОтчетности.ЗагрузитьКалендарьПодготовкиОтчетности();
		
		// 3. Загружаем  тарифы страховых взносов с предельными величинами
		Справочники.ВидыТарифовСтраховыхВзносовУНФ.НачальноеЗаполнение();
		// Тарифы должны видеть новые данные в ВидыТарифовСтраховыхВзносовУНФ 
		ОбновитьПовторноИспользуемыеЗначения();
		РегистрыСведений.ТарифыСтраховыхВзносовУНФ.НачальноеЗаполнение();
		РегистрыСведений.ПредельнаяВеличинаБазыСтраховыхВзносовУНФ.УстановитьПредельнуюВеличинуБазыСтраховыхВзносов();
		
		// 4. Заполняем виды предпринимательской деятельности
		Справочники.ВидыПредпринимательскойДеятельности.ЗаполнитьВидыПредпринимательскойДеятельности();
		
		// 5. Заполняем справочник ОКУН
		ЗагрузитьОКУН();
		
		// 6. Заполняем регистр сведений КоэффициентДефлятор
		ЗаполнитьКоэффициентДефлятор();
		
		// 7. Заполняем регистр сведений МРОТ
		ЗагрузитьМРОТ();
		
		// 8. Заполняем справочник Вычеты НДФЛ
		Справочники.ВычетыНДФЛ.НачальноеЗаполнение();
		
		// 9. Заполним регистр сведений НДФЛРазмерВычетов.
		СотрудникиУНФ.ЗаполнитьРазмерыВычетовНДФЛ();
		
		// 10. Отчетность
		Справочники.ПараметрыИсчисляемогоСтраховогоСтажа.НачальноеЗаполнение();
		Справочники.ОснованияДосрочногоНазначенияПенсии.НачальноеЗаполнение();
		Справочники.ТерриториальныеУсловияПФР.НачальноеЗаполнение();
		РегистрыСведений.ФиксированныеВзносыИП.УстановитьФиксированныеВзносыИП();
		Справочники.ОснованияДосрочногоНазначенияПенсииДляСЗВК.НачальноеЗаполнение();
		Справочники.ОснованияУвольнения.НачальноеЗаполнение(); 
		Справочники.КлассификаторЗанятийУНФ.НачальноеЗаполнение();
		Справочники.ПричиныУвольненияПФР.НачальноеЗаполнение();
		
		РегистрыСведений.РазмерФиксированныхВзносовОтНесчастныхСлучаевАУСН.ЗаполнитьПоставляемыеДанные();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию(); 
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Ошибка выполнения обработчика ПервыйЗапуск_ОбщиеДанные()'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

// Процедура заполняет пустую ИБ данными пользователей
//
Процедура ПервыйЗапуск_РазделенныеДанные() Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		ВозможностиПриложения.ПриПервомЗапуске();
		УстановитьКонстантуПодключаемоеОборудование(Неопределено);
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Ошибка выполнения обработчика ПервыйЗапуск_РазделенныеДанные()'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки);
	КонецПопытки;
	
КонецПроцедуры // ПервыйЗапуск()

#КонецОбласти

#Область ОбработчикиПереходаСДругихПрограмм

// Обработчики перехода с розницы на УНФ
Процедура ОбновлениеРозницыДоУНФ() Экспорт
	
	ВозможностиПриложения.ОбновлениеРозницыДоУНФ();
	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_3_0_5

Процедура ЗаполнитьПараметрыСчетовУчетаНДС() Экспорт
	
	СчетНДСПоПриобретеннымЦенностям = ПланыСчетов.Управленческий.НДСПоПриобретеннымЦенностям.ПолучитьОбъект();
	СчетНДСПоПриобретеннымЦенностям.Наименование = НСтр("ru='НДС по приобретенным ценностям'");
	СчетНДСПоПриобретеннымЦенностям.Вид = ВидСчета.Активный;
	СчетНДСПоПриобретеннымЦенностям.ТипСчета = Перечисления.ТипыСчетов.Дебиторы;
	СчетНДСПоПриобретеннымЦенностям.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(СчетНДСПоПриобретеннымЦенностям);
	
	СчетНДСПоРеализации = ПланыСчетов.Управленческий.Продажи_НДС.ПолучитьОбъект();
	СчетНДСПоРеализации.Наименование = НСтр("ru='Налог на добавленную стоимость'");
	СчетНДСПоРеализации.Родитель = ПланыСчетов.Управленческий.Продажи;
	СчетНДСПоРеализации.Вид = ВидСчета.Активный;
	СчетНДСПоРеализации.ТипСчета = Перечисления.ТипыСчетов.Расходы;
	СчетНДСПоРеализации.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(СчетНДСПоРеализации);
	
КонецПроцедуры

Процедура ЗаполнитьСчетаУчетаНДСВНоменклатуре(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 300
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ЭтоГруппа
	|	И Номенклатура.СчетУчетаНДСПоПриобретеннымЦенностям = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	Иначе
		Параметры.ОбработкаЗавершена = Ложь;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ОбновляемыеДанные = Новый Структура;
	ОбновляемыеДанные.Вставить("СчетУчетаНДСПоПриобретеннымЦенностям", ПланыСчетов.Управленческий.НДСПоПриобретеннымЦенностям);
	ОбновляемыеДанные.Вставить("СчетУчетаНДСПоРеализации", ПланыСчетов.Управленческий.Продажи_НДС);
	
	Пока Выборка.Следующий() Цикл
		
		ОбъектСправочника = Выборка.Ссылка.ПолучитьОбъект();
		
		Попытка
			ОбъектСправочника.Заблокировать();
			ЗаполнитьЗначенияСвойств(ОбъектСправочника, ОбновляемыеДанные);
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектСправочника);
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка выполнения обработчика заполнения ставок НДС в номенклатуре'",
			ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,, ОбъектСправочника, ПодробноеПредставлениеОшибки);
			
			Параметры.ОбработкаЗавершена = Ложь;
			Возврат;
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСчетаУчетаНДСВоВнеоборотныхАктивах(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 300
	|	ВнеоборотныеАктивы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВнеоборотныеАктивы КАК ВнеоборотныеАктивы
	|ГДЕ
	|	НЕ ВнеоборотныеАктивы.ЭтоГруппа
	|	И ВнеоборотныеАктивы.СчетУчетаНДСПоРеализации = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	Иначе
		Параметры.ОбработкаЗавершена = Ложь;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ОбновляемыеДанные = Новый Структура;
	ОбновляемыеДанные.Вставить("СчетУчетаНДСПоРеализации", ПланыСчетов.Управленческий.Продажи_НДС);
	
	Пока Выборка.Следующий() Цикл
		
		ОбъектСправочника = Выборка.Ссылка.ПолучитьОбъект();
		
		Попытка
			ОбъектСправочника.Заблокировать();
			ЗаполнитьЗначенияСвойств(ОбъектСправочника, ОбновляемыеДанные);
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектСправочника);
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка выполнения обработчика заполнения ставок НДС во внеоборотных активах'",
			ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,, ОбъектСправочника, ПодробноеПредставлениеОшибки);
			
			Параметры.ОбработкаЗавершена = Ложь;
			Возврат;
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьНастройкиОрдерныхСкладов(Параметры) Экспорт
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтруктурныеЕдиницы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
		|ГДЕ
		|	СтруктурныеЕдиницы.ОрдерныйСклад";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			СтруктурнаяЕдиница = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			
			СтруктурнаяЕдиница.ИспользоватьОрдернуюСхемуПриОтгрузке = Истина;
			СтруктурнаяЕдиница.ИспользоватьОрдернуюСхемуПриПеремещении = Истина;
			СтруктурнаяЕдиница.ИспользоватьОрдернуюСхемуПриПоступлении = Истина;
			
			СтруктурнаяЕдиница.ВидУчетаОрдерныхСкладов = Перечисления.ВидыУчетаОрдерныхСкладов.ПоСкладуВЦелом;
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(СтруктурнаяЕдиница);
			
		КонецЦикла;
		
		Параметры.ОбработкаЗавершена = Истина;
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ИмяСобытия = НСтр("ru = 'Выполнение обработчика УстановитьНастройкиОрдерныхСкладов'", 
		ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		
		Параметры.ОбработкаЗавершена = Ложь;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьСлужебныеРеквизитыКонтактнойИнформацииКонтрагентов(Параметры) Экспорт
	
	РазмерПорции = 500;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 500
	|	КонтрагентыКонтактнаяИнформация.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И КонтрагентыКонтактнаяИнформация.ОбратныйНомерТелефона = """"
	|	И НЕ КонтрагентыКонтактнаяИнформация.НомерТелефона = """"";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "500", Строка(РазмерПорции));
	
	Выборка = Запрос.Выполнить().Выбрать();
	ВыбраноКонтактов = Выборка.Количество();
	
	Если ВыбраноКонтактов = 0 Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ЕстьОшибки = Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			КонтрагентОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			Для Каждого СтрокаКИ Из КонтрагентОбъект.КонтактнаяИнформация Цикл
				Если СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
					
					СтрокаКИ.ОбратныйНомерТелефона
						= Справочники.Контрагенты.ПолучитьОбратныйНомерТелефонаБезКодаСтраны(СтрокаКИ.НомерТелефона);
					Если СтрокаКИ.ОбратныйНомерТелефона = "" Тогда
						СтрокаКИ.ОбратныйНомерТелефона = "0";
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(КонтрагентОбъект);
		Исключение
			ЕстьОшибки = Истина;
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ТекстСообщения = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			ИмяСобытияЖР = НСтр("ru='Заполнение служебных реквизитов контактной информации контрагентов'",
			ОбщегоНазначения.КодОсновногоЯзыка());
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Ошибка, , Выборка.Ссылка, ТекстСообщения);
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = НЕ ЕстьОшибки И ВыбраноКонтактов < РазмерПорции;
	
КонецПроцедуры

Процедура УстановитьХранениеКартЛояльностиВРМК() Экспорт
	
	ЗапросУзлов = Новый Запрос;
	ЗапросУзлов.Текст =
	"ВЫБРАТЬ
	|	ОбменСУРМК.Ссылка КАК Узел
	|ИЗ
	|	ПланОбмена.ОбменСУРМК КАК ОбменСУРМК
	|ГДЕ
	|	НЕ ОбменСУРМК.ПометкаУдаления
	|	И НЕ ОбменСУРМК.ТорговыйОбъект = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|	И НЕ ОбменСУРМК.ХранитьКартыЛояльностиВРМК";
	РезультатЗапроса = ЗапросУзлов.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаУзлов = РезультатЗапроса.Выбрать();
		Пока ВыборкаУзлов.Следующий() Цикл
			Если Не ВыборкаУзлов.Узел = ПланыОбмена.ОбменСУРМК.ЭтотУзел() Тогда
				ОбъектУзел = ВыборкаУзлов.Узел.ПолучитьОбъект();
				ОбъектУзел.ХранитьКартыЛояльностиВРМК = Истина;
				ОбъектУзел.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьОтчеты_3_0_5(ПараметрыОбработчика) Экспорт
	
	ОтчетыКОбновлению = Новый Массив;
	
	ОтчетыКОбновлению.Добавить(Метаданные.Отчеты.ОрдерныеСклады);
	ОтчетыКОбновлению.Добавить(Метаданные.Отчеты.Склад);
	ОтчетыКОбновлению.Добавить(Метаданные.Отчеты.ПричиныОтменыЗаказаПокупателя);
	ОтчетыКОбновлению.Добавить(Метаданные.Отчеты.ПричиныОтменыЗаказаПоставщику);

	ОтчетыУНФ.ОбновитьОтчетыВыборочно(ОтчетыКОбновлению);
	
	ПараметрыОбработчика.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

Процедура УдалитьНеотмеченныеДоговорыИзАктовСверкиВзаиморасчетов(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 300
	|	СверкаВзаиморасчетовДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СверкаВзаиморасчетов.ДоговорыКонтрагентов КАК СверкаВзаиморасчетовДоговорыКонтрагентов
	|ГДЕ
	|	НЕ СверкаВзаиморасчетовДоговорыКонтрагентов.Отметка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОбъектДокумента = Выборка.Ссылка.ПолучитьОбъект();
		
		Попытка
			ОбъектДокумента.Заблокировать();

			МассивСтрокКУдалению = ОбъектДокумента.ДоговорыКонтрагентов.НайтиСтроки(Новый Структура("Отметка", Ложь));
			
			Для Каждого СтрокаКУдалению Из МассивСтрокКУдалению Цикл
				ОбъектДокумента.ДоговорыКонтрагентов.Удалить(СтрокаКУдалению);	
			КонецЦикла;	
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектДокумента);
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			КодЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
			Событие =
				НСтр("ru = 'Ошибка выполнения обработчика удаления неотмеченных договоров из документов Сверка взаиморасчетов'",
					КодЯзыка);
			ЗаписьЖурналаРегистрации(
			Событие,
			УровеньЖурналаРегистрации.Ошибка, , ОбъектДокумента, ПодробноеПредставлениеОшибки);
			
			Параметры.ОбработкаЗавершена = Ложь;
			Возврат;
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьКалендарьНалоговИОтчетностьИОчиститьКоды() Экспорт
	
	Если ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ() Тогда
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КалендарьПодготовкиОтчетности.Ссылка КАК Событие
		|ИЗ
		|	Справочник.КалендарьПодготовкиОтчетности КАК КалендарьПодготовкиОтчетности
		|ГДЕ
		|	КалендарьПодготовкиОтчетности.Код <> """"";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Событие = ВыборкаДетальныеЗаписи.Событие.ПолучитьОбъект(); 
		Событие.Код = "";
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Событие);
	КонецЦикла;
	
	Справочники.КалендарьПодготовкиОтчетности.ЗагрузитьКалендарьПодготовкиОтчетности();
	
КонецПроцедуры

Процедура УстановитьИспользованиеПроцессовСостояний() Экспорт
		
	Если НЕ Константы.ИспользоватьПроцессыСостояний.Получить() И ОбщегоНазначенияУНФ.ЭтоУНФ() Тогда
		Константы.ИспользоватьПроцессыСостояний.Установить(Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьНастройкиКонтроляДублейКонтактныхЛиц() Экспорт
	
	Если НЕ ОбщегоНазначенияУНФ.ЭтоУНФ() Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиКонтроляДублейКонтакты = Константы.НастройкиКонтроляДублейКонтакты.Получить().Получить();
	
	Если НастройкиКонтроляДублейКонтакты = Неопределено Тогда
		
		Настройки = Новый Соответствие;
		Настройки.Вставить("ПроверятьНаименование", Ложь);
		Настройки.Вставить("ПроверятьТелефон", Истина);
		Настройки.Вставить("ПроверятьАдресЭП", Ложь);
		
		Константы.НастройкиКонтроляДублейКонтакты.Установить(Новый ХранилищеЗначения(Настройки));
		
		Возврат;
		
	КонецЕсли;
	
	Если НастройкиКонтроляДублейКонтакты.Получить("ПроверятьТелефон") Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиКонтроляДублейКонтакты.Вставить("ПроверятьТелефон", Истина);
	Константы.НастройкиКонтроляДублейКонтакты.Установить(Новый ХранилищеЗначения(НастройкиКонтроляДублейКонтакты));
	
КонецПроцедуры

Процедура ОбновитьВидыНалоговПоСтраховымВзносам(ПараметрыОбработчика) Экспорт
	
	ЕстьОшибки = Ложь;
	
    РегистрыСведений.ЗначенияКБК.ЗагрузитьЗначенияКБК();
	
	НачатьТранзакцию();
	
	Попытка
		
		КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
		
    	ЭлементПФРСтраховая =  Справочники.ВидыНалогов.ПФРСтраховая.ПолучитьОбъект();
		ЭлементПФРСтраховая.Наименование = НСтр("ru = 'Фиксированные взносы в ПФР (до 2023 года)'", КодОсновногоЯзыка);
		ЭлементПФРСтраховая.Код = "00-000004";
		ЗаполнитьСчетаУчета(ЭлементПФРСтраховая);     
		ЭлементПФРСтраховая.КодБК = "18210214010061005160";
		ЭлементПФРСтраховая.ВидНалога = Перечисления.ВидыНалогов.ФиксированныеВзносы_ПФР_СтраховаяЧасть;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЭлементПФРСтраховая);  	
		
		ЭлементФФОМС = Справочники.ВидыНалогов.ФФОМС.ПолучитьОбъект();
		ЭлементФФОМС.Наименование = НСтр("ru = 'Фиксированные взносы в ФФОМС (до 2023 года)'", КодОсновногоЯзыка);
		ЗаполнитьСчетаУчета(ЭлементФФОМС);
		ЭлементФФОМС.КодБК = "18210214030081002160";
		ЭлементФФОМС.ВидНалога = Перечисления.ВидыНалогов.ФиксированныеВзносы_ФФОМС;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЭлементФФОМС);
		
		ЭлементПФРСтраховаяСотрудники = Справочники.ВидыНалогов.ПФРСтраховаяСотрудники.ПолучитьОбъект();
		ЭлементПФРСтраховаяСотрудники.Наименование = НСтр("ru = 'Страховые взносы в ПФР (до 2023 года)'",
		КодОсновногоЯзыка);                        
		ЭлементПФРСтраховаяСотрудники.КодБК = "18210214010061001160";
		ЗаполнитьСчетаУчета(ЭлементПФРСтраховаяСотрудники);
		ЭлементПФРСтраховаяСотрудники.ВидНалога = Перечисления.ВидыНалогов.СтраховыеВзносы_ПФР_СтраховаяЧасть;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЭлементПФРСтраховаяСотрудники);     
		
		ЭлементФОМССотрудники =  Справочники.ВидыНалогов.ФОМССотрудники.ПолучитьОбъект();             
		ЭлементФОМССотрудники.Наименование = НСтр("ru = 'Страховые взносы в ФФОМС (до 2023 года)'", КодОсновногоЯзыка);
		ЗаполнитьСчетаУчета(ЭлементФОМССотрудники);
		ЭлементФОМССотрудники.ВидНалога = Перечисления.ВидыНалогов.СтраховыеВзносы_ФФОМС;
		ЭлементФОМССотрудники.КодБК = "18210214030081001160";
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЭлементФОМССотрудники);
		
		ЭлементФСССотрудники = Справочники.ВидыНалогов.ФСССотрудники.ПолучитьОбъект();
		ЭлементФСССотрудники.Наименование = НСтр("ru = 'Страховые взносы на обязательное социальное страхование'", КодОсновногоЯзыка);
		ЗаполнитьСчетаУчета(ЭлементФСССотрудники); 
		ЭлементФСССотрудники.КодБК = "18210214020061001160";
		ЭлементФСССотрудники.ВидНалога = Перечисления.ВидыНалогов.СтраховыеВзносы_ФСС;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЭлементФСССотрудники);
		
		ЭлементПФРСвыше300ТР = Справочники.ВидыНалогов.ПФРСвыше300ТР.ПолучитьОбъект();
		ЭлементПФРСвыше300ТР.Наименование = НСтр("ru = 'Страховые взносы ИП с дохода свыше предела'",
		КодОсновногоЯзыка);
		ЭлементПФРСвыше300ТР.КодБК = "18210203000011000160";
		ЗаполнитьСчетаУчета(ЭлементПФРСвыше300ТР);
		ЭлементПФРСвыше300ТР.ВидНалога = Перечисления.ВидыНалогов.ФиксированныеВзносы_СвышеПредела; 
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЭлементПФРСвыше300ТР);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ИмяСобытия = НСтр("ru = 'Выполнение обработчика обновления видов налогов по страховым взносам'", 
		ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		ЕстьОшибки = Истина;
		
	КонецПопытки;
	
	ПараметрыОбработчика.ОбработкаЗавершена = НЕ ЕстьОшибки;
	
КонецПроцедуры

Процедура ОбработатьДанныеПоСтраховыеВзносамПосле2023(ПараметрыОбработчика) Экспорт
	
	ПараметрыОбработчика.ОбработкаЗавершена = Ложь;
	
	ПроблемныхОбъектов = 0;
	ОбъектовОбработано = 0;  
	
	ВидНалогаПФР = Справочники.ВидыНалогов.ПФРСтраховаяСотрудники;   
	ВидНалогаЕдиныйТариф = Справочники.ВидыНалогов.СтраховыеВзносыЕдиныйТариф;
	ВидУдержания = Справочники.ВидыНачисленийИУдержаний.ПФРПоСуммарномуТарифу;	
	ВидУдержанияЕдиныйТариф = Справочники.ВидыНачисленийИУдержаний.ВзносыПоЕдиномуТарифу;  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 500
	|	УведомлениеОбИсчисленныхСуммахНалогов.Ссылка КАК Ссылка,
	|	УведомлениеОбИсчисленныхСуммахНалогов.Дата КАК Дата
	|ИЗ
	|	Документ.УведомлениеОбИсчисленныхСуммахНалогов КАК УведомлениеОбИсчисленныхСуммахНалогов
	|ГДЕ
	|	УведомлениеОбИсчисленныхСуммахНалогов.Дата >= &ДатаНачалаЕНП
	|	И УведомлениеОбИсчисленныхСуммахНалогов.ПометкаУдаления = ЛОЖЬ
	|	И УведомлениеОбИсчисленныхСуммахНалогов.Проведен = ИСТИНА
	|	И УведомлениеОбИсчисленныхСуммахНалогов.СуммаДокумента > 0
	|	И УведомлениеОбИсчисленныхСуммахНалогов.Налоги.Налог = &ПФРСтраховаяСотрудники
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 500
	|	ОперацияПоЕдиномуНалоговомуСчету.Ссылка,
	|	ОперацияПоЕдиномуНалоговомуСчету.Дата
	|ИЗ
	|	Документ.ОперацияПоЕдиномуНалоговомуСчету КАК ОперацияПоЕдиномуНалоговомуСчету
	|ГДЕ
	|	ОперацияПоЕдиномуНалоговомуСчету.Ссылка.Дата >= &ДатаНачалаЕНП
	|	И ОперацияПоЕдиномуНалоговомуСчету.ПометкаУдаления = ЛОЖЬ
	|	И ОперацияПоЕдиномуНалоговомуСчету.Проведен = ИСТИНА
	|	И ОперацияПоЕдиномуНалоговомуСчету.СуммаДокумента > 0
	|	И ОперацияПоЕдиномуНалоговомуСчету.Налоги.Налог = &ПФРСтраховаяСотрудники
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 500
	|	НачислениеНалогов.Ссылка,
	|	НачислениеНалогов.Дата
	|ИЗ
	|	Документ.НачислениеНалогов КАК НачислениеНалогов
	|ГДЕ
	|	НачислениеНалогов.Дата >= &ДатаНачалаЕНП
	|	И НачислениеНалогов.ПометкаУдаления = ЛОЖЬ
	|	И НачислениеНалогов.Проведен = ИСТИНА
	|	И НачислениеНалогов.СуммаДокумента > 0
	|	И НачислениеНалогов.Налоги.ВидНалога = &ПФРСтраховаяСотрудники
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 500
	|	НачислениеЗарплатыУНФ.Ссылка,
	|	НачислениеЗарплатыУНФ.Дата
	|ИЗ
	|	Документ.НачислениеЗарплатыУНФ КАК НачислениеЗарплатыУНФ
	|ГДЕ
	|	НачислениеЗарплатыУНФ.Дата >= &ДатаНачалаЕНП
	|	И НачислениеЗарплатыУНФ.ПометкаУдаления = ЛОЖЬ
	|	И НачислениеЗарплатыУНФ.Проведен = ИСТИНА
	|	И НачислениеЗарплатыУНФ.СуммаДокумента > 0
	|	И НачислениеЗарплатыУНФ.Взносы.ВидНачисленияУдержания = &ПФРПоСуммарномуТарифу
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 500
	|	ЗакрытиеМесяца.Ссылка,
	|	ЗакрытиеМесяца.Дата
	|ИЗ
	|	РегистрНакопления.РасчетыПоНалогамНаЕдиномНалоговомСчете КАК РасчетыПоНалогамНаЕдиномНалоговомСчете
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗакрытиеМесяца КАК ЗакрытиеМесяца
	|			ПРАВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоНалогам КАК РасчетыПоНалогам
	|			ПО (РасчетыПоНалогам.Регистратор = ЗакрытиеМесяца.Ссылка)
	|		ПО РасчетыПоНалогамНаЕдиномНалоговомСчете.Регистратор = ЗакрытиеМесяца.Ссылка
	|ГДЕ
	|	ЗакрытиеМесяца.Дата >= &ДатаНачалаЕНП
	|	И ЗакрытиеМесяца.ПометкаУдаления = ЛОЖЬ
	|	И ЗакрытиеМесяца.Проведен = ИСТИНА
	|	И ЗакрытиеМесяца.ЗачетАвансаПоЕдиномуНалоговомуСчету = ИСТИНА
	|	И (РасчетыПоНалогамНаЕдиномНалоговомСчете.Налог = &ПФРСтраховаяСотрудники
	|			ИЛИ РасчетыПоНалогам.СрокУплаты = &ПФРСтраховаяСотрудники)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("ДатаНачалаЕНП", '20230101'); 
	Запрос.УстановитьПараметр("ПФРПоСуммарномуТарифу", ВидУдержания);
	Запрос.УстановитьПараметр("ПФРСтраховаяСотрудники", ВидНалогаПФР);
	КоличествоОбработанных = 0;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
		НачатьТранзакцию();
		
		Попытка
			
			ПричинаИсключения = "Блокировка"; 
			ДокументПоВзносам = ВыборкаДетальныеЗаписи.Ссылка;
			ДокументПоВзносам = ДокументПоВзносам.ПолучитьОбъект();						
			ДокументПоВзносам.Заблокировать();
			
			
			Если ТипЗнч(ДокументПоВзносам) = Тип("ДокументОбъект.УведомлениеОбИсчисленныхСуммахНалогов") 
				ИЛИ ТипЗнч(ДокументПоВзносам) = Тип("ДокументОбъект.ОперацияПоЕдиномуНалоговомуСчету") Тогда
				
				Для Каждого СтрокаНалог Из ДокументПоВзносам.Налоги Цикл
					Если СтрокаНалог.Налог = ВидНалогаПФР Тогда
						СтрокаНалог.Налог = ВидНалогаЕдиныйТариф;					
					КонецЕсли;  
				КонецЦикла; 				
				
			ИначеЕсли ТипЗнч(ДокументПоВзносам) = Тип("ДокументОбъект.НачислениеНалогов") Тогда
				
				Для Каждого СтрокаНалог Из ДокументПоВзносам.Налоги Цикл
					Если СтрокаНалог.ВидНалога = ВидНалогаПФР Тогда
						СтрокаНалог.ВидНалога = ВидНалогаЕдиныйТариф;					
					КонецЕсли;
				КонецЦикла;
				
			ИначеЕсли ТипЗнч(ДокументПоВзносам) = Тип("ДокументОбъект.НачислениеЗарплатыУНФ") Тогда 
				
				Для Каждого СтрокаВзнос Из ДокументПоВзносам.Взносы Цикл
					Если СтрокаВзнос.ВидНачисленияУдержания = ВидУдержания Тогда
						СтрокаВзнос.ВидНачисленияУдержания = ВидУдержанияЕдиныйТариф;					
					КонецЕсли;
				КонецЦикла;	
			КонецЕсли;
			
			ПричинаИсключения = "Запись";
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументПоВзносам,Истина,Ложь,РежимЗаписиДокумента.Запись); 		
			
			ОбработатьДвиженияРасчетыПоНалогам(ДокументПоВзносам, ВидНалогаПФР, ВидНалогаЕдиныйТариф);
			ОбработатьДвиженияРасчетыПоНалогамНаЕНС(ДокументПоВзносам, ВидНалогаПФР, ВидНалогаЕдиныйТариф);
			
			ДокументПоВзносам.Разблокировать();
			
			ОбъектовОбработано = ОбъектовОбработано + 1;
			ЗафиксироватьТранзакцию();
			
			
		Исключение
			ОтменитьТранзакцию();
			
			ИмяСобытия = НСтр("ru = 'Выполнение обработчика документов по страховым взносам после 2023 года.'",
			ОбщегоНазначения.КодОсновногоЯзыка()); 
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось обработать документ по страховым взносам после 2023 года по причине:
			|%1'"), ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			
			ЗаписьЖурналаРегистрации(ИмяСобытия,
			УровеньЖурналаРегистрации.Ошибка,
			,
			ВыборкаДетальныеЗаписи.Ссылка,
			ТекстСообщения);   
			
			 // Если не удалось обработать какой-либо документ из-за конфликта блокировки, повторяем попытку снова.
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			Если ПричинаИсключения <> "Блокировка" Тогда
				ВызватьИсключение ТекстСообщения;
			КонецЕсли;
			
		КонецПопытки;
		
	КонецЦикла; 		
	
	Если ОбъектовОбработано = 0 И ПроблемныхОбъектов = 0 Тогда
		ПараметрыОбработчика.ОбработкаЗавершена = Истина;
	КонецЕсли;	  
	
КонецПроцедуры

Процедура ОбработатьДвиженияРасчетыПоНалогам(ДокументПоВзносам, ВидНалогаПФР, ВидНалогаЕдиныйТариф) 
	
	НаборЗаписейРасчетыПоНалогам = РегистрыНакопления.РасчетыПоНалогам.СоздатьНаборЗаписей();
	НаборЗаписейРасчетыПоНалогам.Отбор.Регистратор.Установить(ДокументПоВзносам.Ссылка);	
	НаборЗаписейРасчетыПоНалогам.Прочитать();
	
	Для Каждого СтрокаРасчетыПоНалогам Из НаборЗаписейРасчетыПоНалогам Цикл 
		Если СтрокаРасчетыПоНалогам.ВидНалога = ВидНалогаПФР Тогда
			СтрокаРасчетыПоНалогам.ВидНалога = ВидНалогаЕдиныйТариф;    
		КонецЕсли;
	КонецЦикла;
	
	ПричинаИсключения = "Запись";
	Если НаборЗаписейРасчетыПоНалогам.Количество() > 0 Тогда
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейРасчетыПоНалогам);	
	КонецЕсли;	
	
КонецПроцедуры     

Процедура ОбработатьДвиженияРасчетыПоНалогамНаЕНС(ДокументПоВзносам, ВидНалогаПФР, ВидНалогаЕдиныйТариф)  
	
	НаборЗаписейРасчетыПоНалогам = РегистрыНакопления.РасчетыПоНалогамНаЕдиномНалоговомСчете.СоздатьНаборЗаписей();
	НаборЗаписейРасчетыПоНалогам.Отбор.Регистратор.Установить(ДокументПоВзносам.Ссылка); 
	НаборЗаписейРасчетыПоНалогам.Прочитать();
	
	Для Каждого СтрокаРасчетыПоНалогам Из НаборЗаписейРасчетыПоНалогам Цикл 
		Если СтрокаРасчетыПоНалогам.Налог = ВидНалогаПФР Тогда
			СтрокаРасчетыПоНалогам.Налог = ВидНалогаЕдиныйТариф;
		КонецЕсли;			
	КонецЦикла;
	
	ПричинаИсключения = "Запись";
	Если НаборЗаписейРасчетыПоНалогам.Количество() > 0 Тогда
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейРасчетыПоНалогам);	
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСчетаУчета(ЭлементВидНалога)
	ЭлементВидНалога.СчетУчета = ПланыСчетов.Управленческий.Налоги;
	ЭлементВидНалога.СчетУчетаКВозмещению = ПланыСчетов.Управленческий.НалогиКВозмещению;
КонецПроцедуры

Процедура СоздатьПредопределенныйЭлементНДС() Экспорт
	
	Если ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыНалогов.НДС") = Неопределено Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ВидыНалогов.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ВидыНалогов КАК ВидыНалогов
			|ГДЕ
			|	ВидыНалогов.ВидНалога = ЗНАЧЕНИЕ(Перечисление.ВидыНалогов.НДС)";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаНДС = РезультатЗапроса.Выбрать();
		
		Если ВыборкаНДС.Следующий() Тогда
			ЭлементНДС = ВыборкаНДС.Ссылка.ПолучитьОбъект();
			ЭлементНДС.ИмяПредопределенныхДанных = "НДС";
		Иначе
			ЭлементНДС = Справочники.ВидыНалогов.СоздатьЭлемент();
			ЭлементНДС.ИмяПредопределенныхДанных = "НДС";
			ЭлементНДС.Наименование = НСтр("ru = 'НДС'");
			ЭлементНДС.Код = "01-000019";
			ЭлементНДС.СчетУчета = ПланыСчетов.Управленческий.Налоги;
			ЭлементНДС.СчетУчетаКВозмещению = ПланыСчетов.Управленческий.НалогиКВозмещению;
			ЭлементНДС.ВидНалога = Перечисления.ВидыНалогов.НДС;
		КонецЕсли;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЭлементНДС);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьКонстантуПодключаемоеОборудование(ПараметрыОбработчика) Экспорт
	
	Если Не Константы.ФункциональнаяОпцияИспользоватьПодключаемоеОборудование.Получить() Тогда
		Константы.ФункциональнаяОпцияИспользоватьПодключаемоеОборудование.Установить(Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДвиженияПоУведомлениямСОтрицательнойСуммой() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетыПоНалогамНаЕдиномНалоговомСчете.Регистратор КАК Уведомление
		|ИЗ
		|	РегистрНакопления.РасчетыПоНалогамНаЕдиномНалоговомСчете КАК РасчетыПоНалогамНаЕдиномНалоговомСчете
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(РасчетыПоНалогамНаЕдиномНалоговомСчете.Регистратор) = ТИП(Документ.УведомлениеОбИсчисленныхСуммахНалогов)
		|	И РасчетыПоНалогамНаЕдиномНалоговомСчете.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И РасчетыПоНалогамНаЕдиномНалоговомСчете.Налог В(&Налоги)
		|	И ВЫРАЗИТЬ(РасчетыПоНалогамНаЕдиномНалоговомСчете.Регистратор КАК Документ.УведомлениеОбИсчисленныхСуммахНалогов).Дата >= &ДатаНачала";
	
	Налоги = Новый Массив;
	Налоги.Добавить(Справочники.ВидыНалогов.АвансовыйПлатежПриУСН);
	Налоги.Добавить(Справочники.ВидыНалогов.АвансовыйПлатежПриУСНРасходы);
	Налоги.Добавить(Справочники.ВидыНалогов.ЕдиныйНалогПриУСН); 
	Налоги.Добавить(Справочники.ВидыНалогов.ЕдиныйНалогПриУСНРасходы);
	
	Запрос.УстановитьПараметр("Налоги", Налоги);
	// Выбираем документы, только с начала месяца действия письма по отрицательному уведомлению
	Запрос.УстановитьПараметр("ДатаНачала", Дата(2023, 07 , 01));
	ТаблицаУведомлений = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаУведомления из ТаблицаУведомлений Цикл
		
		НачатьТранзакцию();
		Попытка
			Уведомление = СтрокаУведомления.Уведомление.ПолучитьОбъект();
			Уведомление.Записать(РежимЗаписиДокумента.Проведение);  
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Уведомление, Истина, Истина, РежимЗаписиДокумента.Проведение); 
			
			ЗафиксироватьТранзакцию();
	
		Исключение  
			ОтменитьТранзакцию();
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось провести Уведомление по причине:
				|%1'"),
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,, 
				, ТекстСообщения);
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьВыкупКомиссионераВПолитикиУчетаСерийУправлениеОстатками(ПараметрыОбработчика) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПолитикаУчетаСерий.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий
	|ГДЕ
	|	ПолитикаУчетаСерий.ТипПолитики = ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.УправлениеОстаткамиСерий)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПараметрыПоиска = Новый Структура("ТипДокумента, Операция", 
										ОбщегоНазначения.СтроковоеПредставлениеТипа(Тип("ДокументСсылка.РасходнаяНакладная")), Перечисления.ВидыОперацийРасходнаяНакладная.ВыкупТоваровКомиссионером);
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Ссылка.НастройкиПолитики.НайтиСтроки(ПараметрыПоиска).Количество() Тогда
			Продолжить
		КонецЕсли;
		
		Политика = Выборка.Ссылка.ПолучитьОбъект();
		
		Попытка
			Политика.Заблокировать();
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Фоновое обновление типов документов в политиках учета серий'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,, Политика, ПодробноеПредставлениеОшибки);
			
			ПараметрыОбработчика.ОбработкаЗавершена = Ложь;
			Возврат;
			
		КонецПопытки;
		
		НастройкиПолитики = Политика.НастройкиПолитики;
		
		НоваяСтрока = НастройкиПолитики.Добавить();
		НоваяСтрока.ТипДокумента = ОбщегоНазначения.СтроковоеПредставлениеТипа(Тип("ДокументСсылка.РасходнаяНакладная"));
		НоваяСтрока.Операция = Перечисления.ВидыОперацийРасходнаяНакладная.ВыкупТоваровКомиссионером;
		НоваяСтрока.ТипПолитики = Политика.ТипПолитики;
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Политика);
	
	КонецЦикла;
	
	ПараметрыОбработчика.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

Процедура УстановитьВозвратВыкупленногоТовараКомиссионераВПолитикиУчетаСерийУправлениеОстатками(ПараметрыОбработчика) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПолитикаУчетаСерий.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий
	|ГДЕ
	|	ПолитикаУчетаСерий.ТипПолитики = ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.УправлениеОстаткамиСерий)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПараметрыПоиска = Новый Структура("ТипДокумента, Операция", 
										ОбщегоНазначения.СтроковоеПредставлениеТипа(Тип("ДокументСсылка.ПриходнаяНакладная")), Перечисления.ВидыОперацийПриходнаяНакладная.ВыкупленныеКомиссионеромТовары);
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Ссылка.НастройкиПолитики.НайтиСтроки(ПараметрыПоиска).Количество() Тогда
			Продолжить
		КонецЕсли;
		
		Политика = Выборка.Ссылка.ПолучитьОбъект();
		
		Попытка
			Политика.Заблокировать();
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Фоновое обновление типов документов в политиках учета серий'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,, Политика, ПодробноеПредставлениеОшибки);
			
			ПараметрыОбработчика.ОбработкаЗавершена = Ложь;
			Возврат;
			
		КонецПопытки;
		
		НастройкиПолитики = Политика.НастройкиПолитики;
		
		НоваяСтрока = НастройкиПолитики.Добавить();
		НоваяСтрока.ТипДокумента = ОбщегоНазначения.СтроковоеПредставлениеТипа(Тип("ДокументСсылка.ПриходнаяНакладная"));
		НоваяСтрока.Операция = Перечисления.ВидыОперацийПриходнаяНакладная.ВыкупленныеКомиссионеромТовары;
		НоваяСтрока.ТипПолитики = Политика.ТипПолитики;
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Политика);
	
	КонецЦикла;
	
	ПараметрыОбработчика.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

Процедура ИсправитьДатуОкончанияСобытияПерсСведенияОФизическихЛицах() Экспорт
	
	Если ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ() Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьОшибки = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КалендарьПодготовкиОтчетности.Ссылка КАК Ссылка,
	|	КалендарьПодготовкиОтчетности.ПометкаУдаления КАК ПометкаУдаления,
	|	КалендарьПодготовкиОтчетности.Наименование КАК Наименование
	|ИЗ
	|	Справочник.КалендарьПодготовкиОтчетности КАК КалендарьПодготовкиОтчетности
	|ГДЕ
	|	КалендарьПодготовкиОтчетности.Задача = &Задача
	|	И КалендарьПодготовкиОтчетности.ДатаОкончанияДокументов = &ДатаОкончанияСобытия";
	
	Запрос.УстановитьПараметр("ДатаОкончанияСобытия", '20231030');
	Запрос.УстановитьПараметр("Задача", Справочники.ЗадачиКалендаряПодготовкиОтчетности.ПерсСведенияОФизлицах);
	
	Попытка
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
			
			ЗадачаКалендаря = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();  
			ЗадачаКалендаря.ДатаОкончанияДокументов = '20231031'; 
			ЗадачаКалендаря.ДатаДокументаОбработкиСобытия = '20231031';
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЗадачаКалендаря);  
 		
		КонецЦикла;  
		
		Справочники.КалендарьПодготовкиОтчетности.ЗагрузитьКалендарьПодготовкиОтчетности();
		
	Исключение
		
		ЕстьОшибки = Истина;
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ИмяСобытия = НСтр("ru = 'Выполнение обработчика ИсправитьДатуОкончанияСобытияПерсСведенияОФизическихЛицах'", 
		ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		
	КонецПопытки;   	                                       	
			
КонецПроцедуры

Процедура УстановитьПризнакиУзлаУРМК(Параметры) Экспорт
	
	ЗапросУзлов = Новый Запрос;
	ЗапросУзлов.Текст =
	"ВЫБРАТЬ
	|	ОбменСУРМК.Ссылка КАК Узел,
	|	ОбменСУРМК.ВыгружатьФизическихЛиц КАК ВыгружатьФизическихЛиц,
	|	ОбменСУРМК.ВыгружатьСерии КАК ВыгружатьСерии
	|ИЗ
	|	ПланОбмена.ОбменСУРМК КАК ОбменСУРМК
	|ГДЕ
	|	НЕ ОбменСУРМК.ПометкаУдаления
	|	И НЕ ОбменСУРМК.ТорговыйОбъект = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|	И (НЕ ОбменСУРМК.ВыгружатьФизическихЛиц
	|			ИЛИ НЕ ОбменСУРМК.ВыгружатьСерии)";
	РезультатЗапроса = ЗапросУзлов.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	Иначе
		Параметры.ОбработкаЗавершена = Ложь;
	КонецЕсли;
	
	ВыборкаУзлов = РезультатЗапроса.Выбрать();
	Пока ВыборкаУзлов.Следующий() Цикл
		Если Не ВыборкаУзлов.Узел = ПланыОбмена.ОбменСУРМК.ЭтотУзел() Тогда
			ОбъектУзел = ВыборкаУзлов.Узел.ПолучитьОбъект();
			ОбъектУзел.ОбменДанными.Загрузка = Истина;
			Если НЕ ВыборкаУзлов.ВыгружатьФизическихЛиц Тогда
				ОбъектУзел.ВыгружатьФизическихЛиц = Истина;
			КонецЕсли;
			Если НЕ ВыборкаУзлов.ВыгружатьСерии Тогда
				ОбъектУзел.ВыгружатьСерии = Истина;
			КонецЕсли;
			Попытка
				ОбъектУзел.Записать();
				Параметры.ОбработкаЗавершена = Истина;
			Исключение
				ИнформацияОбОшибке = ИнформацияОбОшибке();
				ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
				ИмяСобытия = НСтр("ru = 'Выполнение обработчика УстановитьПризнакиУзлаУРМК'", 
					ОбщегоНазначения.КодОсновногоЯзыка());
				ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
				Параметры.ОбработкаЗавершена = Ложь;
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_3_0_6

Процедура ОбновитьОтчеты_3_0_6(ПараметрыОбработчика) Экспорт
	
	ОтчетыКОбновлению = Новый Массив;
	
	ОтчетыКОбновлению.Добавить(Метаданные.Отчеты.ОтчетПоЧекам);
	ОтчетыКОбновлению.Добавить(Метаданные.Отчеты.СтатистикаЧеков);
	ОтчетыКОбновлению.Добавить(Метаданные.Отчеты.РасчетыПоПрочимОперациям);
	
	ОтчетыУНФ.ОбновитьОтчетыВыборочно(ОтчетыКОбновлению);
	
	ПараметрыОбработчика.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

Процедура ПометитьНаУдалениеЗадачуВзносыИП() Экспорт
	
	Если ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ() Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьОшибки = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КалендарьПодготовкиОтчетности.Ссылка КАК Ссылка,
	|	КалендарьПодготовкиОтчетности.ПометкаУдаления КАК ПометкаУдаления,
	|	КалендарьПодготовкиОтчетности.Наименование КАК Наименование
	|ИЗ
	|	Справочник.КалендарьПодготовкиОтчетности КАК КалендарьПодготовкиОтчетности
	|ГДЕ
	|	КалендарьПодготовкиОтчетности.Задача = &Задача
	|	И КалендарьПодготовкиОтчетности.ДатаОкончанияСобытия = &ДатаОкончанияСобытия";
	
	Запрос.УстановитьПараметр("ДатаОкончанияСобытия", '20231225');
	Запрос.УстановитьПараметр("Задача", Справочники.ЗадачиКалендаряПодготовкиОтчетности.СтраховыеВзносыИП);
	
	Попытка
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
			
			ЗадачаКалендаря = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			
			ЗадачаКалендаря.Наименование = "Удалить" + Строка(ЗадачаКалендаря.Ссылка.УникальныйИдентификатор()) + ЗадачаКалендаря.Наименование; 
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЗадачаКалендаря);
			ЗадачаКалендаря.УстановитьПометкуУдаления(Истина);  
 		
		КонецЦикла; 
		
		Справочники.КалендарьПодготовкиОтчетности.ЗагрузитьКалендарьПодготовкиОтчетности();
		
	Исключение
		
		ЕстьОшибки = Истина;
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ИмяСобытия = НСтр("ru = 'Выполнение обработчика ОбновитьЗадачуВзносыИП'", 
		ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		
	КонецПопытки;   	                                       	
			
КонецПроцедуры

Процедура ЗаполнитьНовыеРеквизитыБонусныхПрограмм(ПараметрыОбработчика) Экспорт
	
	Если ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ() Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьОшибки = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БонусныеПрограммы.Ссылка КАК Ссылка,
	|	БонусныеПрограммы.Назначение КАК Назначение,
	|	БонусныеПрограммы.НачислятьДатойЗаказа КАК НачислятьДатойЗаказа
	|ИЗ
	|	Справочник.БонусныеПрограммы КАК БонусныеПрограммы
	|ГДЕ
	|	БонусныеПрограммы.Назначение = ЗНАЧЕНИЕ(Перечисление.НазначенияАвтоматическихСкидок.ПустаяСсылка)";
		
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
		БонуснаяПрограмма = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Попытка
			БонуснаяПрограмма.Заблокировать();
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Фоновое обновление бонусных программ'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,, БонуснаяПрограмма, ПодробноеПредставлениеОшибки);
			
			ПараметрыОбработчика.ОбработкаЗавершена = Ложь;
			Возврат;
			
		КонецПопытки;
		БонуснаяПрограмма.Назначение = ПредопределенноеЗначение("Перечисление.НазначенияАвтоматическихСкидок.Везде");
		БонуснаяПрограмма.НачислятьДатойЗаказа = Истина;
		БонуснаяПрограмма.КурсБонусов = 1;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(БонуснаяПрограмма);
 	
	КонецЦикла; 
 	                                       	
	ПараметрыОбработчика.ОбработкаЗавершена = Истина;		
КонецПроцедуры

Процедура ЗаполнитьРеквизитСегментДляСпискаВСоставеСегментаКонтрагентов(Параметры) Экспорт
	
	РазмерПорции = 500;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 500
	|	СоставСегментаКонтрагентов.Сегмент КАК Сегмент,
	|	СоставСегментаКонтрагентов.СпособДобавления КАК СпособДобавления,
	|	СоставСегментаКонтрагентов.Контрагент КАК Контрагент,
	|	СоставСегментаКонтрагентов.СегментДляСписка КАК СегментДляСписка
	|ИЗ
	|	РегистрСведений.СоставСегментаКонтрагентов КАК СоставСегментаКонтрагентов
	|ГДЕ
	|	СоставСегментаКонтрагентов.СегментДляСписка = &СегментДляСписка";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "500", Строка(РазмерПорции));
	Запрос.УстановитьПараметр("СегментДляСписка", ПланыВидовХарактеристик.РеквизитыДляСписка.ПустаяСсылка());
	
	Выборка = Запрос.Выполнить().Выбрать();
	ВыбраноЗаписей = Выборка.Количество();
	
	Если ВыбраноЗаписей = 0 Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	Запись = РегистрыСведений.СоставСегментаКонтрагентов.СоздатьМенеджерЗаписи();
	ЕстьОшибки = Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			
			Запись.Сегмент = Выборка.Сегмент;
			Запись.СпособДобавления = Выборка.СпособДобавления;
			Запись.Контрагент = Выборка.Контрагент;
			Запись.Прочитать();
			Если Запись.Выбран() Тогда
				Запись.СегментДляСписка = ПланыВидовХарактеристик.РеквизитыДляСписка.СегментыКонтрагентов;
				Запись.Записать();
			КонецЕсли;
		Исключение
			ЕстьОшибки = Истина;
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ТекстСообщения = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			ИмяСобытияЖР = НСтр("ru='Заполнение реквизита СегментДляСписка в составе сегментов контрагента'",
			ОбщегоНазначения.КодОсновногоЯзыка());
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Ошибка, , Выборка.Сегмент, ТекстСообщения);
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = НЕ ЕстьОшибки И ВыбраноЗаписей < РазмерПорции;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитСегментДляСпискаВСоставеСегментаНоменклатуры(Параметры) Экспорт
	
	РазмерПорции = 500;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 500
	|	СоставСегментаНоменклатуры.Сегмент КАК Сегмент,
	|	СоставСегментаНоменклатуры.СпособДобавления КАК СпособДобавления,
	|	СоставСегментаНоменклатуры.Номенклатура КАК Номенклатура,
	|	СоставСегментаНоменклатуры.Характеристика КАК Характеристика,
	|	СоставСегментаНоменклатуры.СегментДляСписка КАК СегментДляСписка
	|ИЗ
	|	РегистрСведений.СоставСегментаНоменклатуры КАК СоставСегментаНоменклатуры
	|ГДЕ
	|	СоставСегментаНоменклатуры.СегментДляСписка = &СегментДляСписка";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "500", Строка(РазмерПорции));
	Запрос.УстановитьПараметр("СегментДляСписка", ПланыВидовХарактеристик.РеквизитыДляСписка.ПустаяСсылка());
	
	Выборка = Запрос.Выполнить().Выбрать();
	ВыбраноЗаписей = Выборка.Количество();
	
	Если ВыбраноЗаписей = 0 Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	Запись = РегистрыСведений.СоставСегментаНоменклатуры.СоздатьМенеджерЗаписи();
	ЕстьОшибки = Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			
			Запись.Сегмент = Выборка.Сегмент;
			Запись.СпособДобавления = Выборка.СпособДобавления;
			Запись.Номенклатура = Выборка.Номенклатура;
			Запись.Характеристика = Выборка.Характеристика;
			Запись.Прочитать();
			Если Запись.Выбран() Тогда
				Запись.СегментДляСписка = ПланыВидовХарактеристик.РеквизитыДляСписка.СегментыНоменклатуры;
				Запись.Записать();
			КонецЕсли;
		Исключение
			ЕстьОшибки = Истина;
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ТекстСообщения = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			ИмяСобытияЖР = НСтр("ru='Заполнение реквизита СегментДляСписка в составе сегментов номенклатуры'",
			ОбщегоНазначения.КодОсновногоЯзыка());
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Ошибка, , Выборка.Сегмент, ТекстСообщения);
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = НЕ ЕстьОшибки И ВыбраноЗаписей < РазмерПорции;
	
КонецПроцедуры

Процедура УстановитьПризнакМножественностиДляРеквизитовСписка() Экспорт
	
	РеквизитСегментКонтрагентов = ПланыВидовХарактеристик.РеквизитыДляСписка.СегментыКонтрагентов.ПолучитьОбъект();
	РеквизитСегментКонтрагентов.Наименование = НСтр("ru='Сегменты'");
	РеквизитСегментКонтрагентов.Множественный = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(РеквизитСегментКонтрагентов);
	
	РеквизитСегментНоменклатуры = ПланыВидовХарактеристик.РеквизитыДляСписка.СегментыНоменклатуры.ПолучитьОбъект();
	РеквизитСегментНоменклатуры.Наименование = НСтр("ru='Сегменты'");
	РеквизитСегментНоменклатуры.Множественный = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(РеквизитСегментНоменклатуры);
	
КонецПроцедуры

Процедура ОбновитьКонстантуПредопределенныеШаблоныСообщений(Параметры) Экспорт
	
	ТекстЗапросаНаЗамену = 
	
	"ВЫБРАТЬ
	|	ШаблоныСообщений.Ссылка КАК Ссылка,
	|	ИСТИНА КАК НеобходимоИзменитьТекстШаблонаСМС,
	|	ЛОЖЬ КАК НеобходимоИзменитьТекстШаблонаПисьма,
	|	ЛОЖЬ КАК НеобходимоИзменитьТекстШаблонаПисьмаHTML,
	|	ЛОЖЬ КАК НеобходимоИзменитьТемуПисьма
	|ПОМЕСТИТЬ табШаблоны
	|ИЗ
	|	Справочник.ШаблоныСообщений КАК ШаблоныСообщений
	|ГДЕ
	|	ШаблоныСообщений.Ссылка В(&ШаблоныДляОбновления)
	|	И ШаблоныСообщений.ТекстШаблонаSMS ПОДОБНО &ЗаменяемыйПараметр
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ШаблоныСообщений.Ссылка,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	Справочник.ШаблоныСообщений КАК ШаблоныСообщений
	|ГДЕ
	|	ШаблоныСообщений.Ссылка В(&ШаблоныДляОбновления)
	|	И ШаблоныСообщений.ТекстШаблонаПисьма ПОДОБНО &ЗаменяемыйПараметр
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ШаблоныСообщений.Ссылка,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	ЛОЖЬ
	|ИЗ
	|	Справочник.ШаблоныСообщений КАК ШаблоныСообщений
	|ГДЕ
	|	ШаблоныСообщений.Ссылка В(&ШаблоныДляОбновления)
	|	И ШаблоныСообщений.ТекстШаблонаПисьмаHTML ПОДОБНО &ЗаменяемыйПараметр
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ШаблоныСообщений.Ссылка,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ИСТИНА
	|ИЗ
	|	Справочник.ШаблоныСообщений КАК ШаблоныСообщений
	|ГДЕ
	|	ШаблоныСообщений.Ссылка В(&ШаблоныДляОбновления)
	|	И ШаблоныСообщений.ТемаПисьма ПОДОБНО &ЗаменяемыйПараметр
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	табШаблоны.Ссылка КАК Ссылка,
	|	МАКСИМУМ(табШаблоны.НеобходимоИзменитьТекстШаблонаСМС) КАК НеобходимоИзменитьТекстШаблонаСМС,
	|	МАКСИМУМ(табШаблоны.НеобходимоИзменитьТекстШаблонаПисьма) КАК НеобходимоИзменитьТекстШаблонаПисьма,
	|	МАКСИМУМ(табШаблоны.НеобходимоИзменитьТекстШаблонаПисьмаHTML) КАК НеобходимоИзменитьТекстШаблонаПисьмаHTML,
	|	МАКСИМУМ(табШаблоны.НеобходимоИзменитьТемуПисьма) КАК НеобходимоИзменитьТемуПисьма
	|ИЗ
	|	табШаблоны КАК табШаблоны
	|
	|СГРУППИРОВАТЬ ПО
	|	табШаблоны.Ссылка";
	
	
	Если Не ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		ЕстьОшибки = Ложь;
		
		УстановитьПривилегированныйРежим(Истина);
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Константа.ПредопределенныеШаблоныСообщенийСБП");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		СоответствиеШаблонов = Константы.ПредопределенныеШаблоныСообщенийСБП.Получить();
		СоответствиеШаблонов = ?(СоответствиеШаблонов = Неопределено, СоответствиеШаблонов, СоответствиеШаблонов.Получить());
		
		Если СоответствиеШаблонов <> Неопределено Тогда
			
			ШаблоныДляОбновления 	  = Новый Массив;
			
			Для Каждого ЭлементСоответствия Из СоответствиеШаблонов Цикл 
				
				Для Каждого ЭлементТипДокумента Из ЭлементСоответствия.Значение Цикл
					
					ШаблонСообщения = XMLЗначение(Тип("СправочникСсылка.ШаблоныСообщений"), Строка(ЭлементТипДокумента.Значение));
					
					ШаблоныДляОбновления.Добавить(ШаблонСообщения);
					
				КонецЦикла;
				
			КонецЦикла;
			
			ЗапросШаблонов = Новый Запрос(ТекстЗапросаНаЗамену);
			
			ЗапросШаблонов.УстановитьПараметр("ЗаменяемыйПараметр", "%.СуммаДокумента]%");
			ЗапросШаблонов.УстановитьПараметр("ШаблоныДляОбновления", ШаблоныДляОбновления);
			
			ВыборкаШаблонов = ЗапросШаблонов.Выполнить().Выбрать();
			
			Пока ВыборкаШаблонов.Следующий() Цикл
				
				ШаблонСообщенияОбъект = ВыборкаШаблонов.Ссылка.ПолучитьОбъект();
				
				Если ВыборкаШаблонов.НеобходимоИзменитьТекстШаблонаСМС Тогда

					ШаблонСообщенияОбъект.ТекстШаблонаSMS = СтрЗаменить(
						ШаблонСообщенияОбъект.ТекстШаблонаSMS,
						".СуммаДокумента]",
						".СуммаСсылкиСБП]");
						
				КонецЕсли;
				
				Если ВыборкаШаблонов.НеобходимоИзменитьТекстШаблонаПисьма Тогда
					
					ШаблонСообщенияОбъект.ТекстШаблонаПисьма = СтрЗаменить(
						ШаблонСообщенияОбъект.ТекстШаблонаПисьма,
						".СуммаДокумента]",
						".СуммаСсылкиСБП]");
						
				КонецЕсли;
				
				Если ВыборкаШаблонов.НеобходимоИзменитьТемуПисьма Тогда

					ШаблонСообщенияОбъект.ТемаПисьма = СтрЗаменить(
						ШаблонСообщенияОбъект.ТемаПисьма,
						".СуммаДокумента]",
						".СуммаСсылкиСБП]");
						
				КонецЕсли;
				
				Если ВыборкаШаблонов.НеобходимоИзменитьТекстШаблонаПисьмаHTML Тогда
					
					ШаблонСообщенияОбъект.ТекстШаблонаПисьмаHTML = СтрЗаменить(
						ШаблонСообщенияОбъект.ТекстШаблонаПисьмаHTML,
						".СуммаДокумента]",
						".СуммаСсылкиСБП]");
						
				КонецЕсли;
				
				Если ШаблонСообщенияОбъект.Модифицированность() Тогда 
					ШаблонСообщенияОбъект.Записать();
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Ложь);
			
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ЕстьОшибки		= Истина;
		ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось выполнить обновление предопределенных шаблонов сообщений СБП:
				|%1'"),
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение ТекстИсключения;
		
	КонецПопытки;

	Параметры.ОбработкаЗавершена = НЕ ЕстьОшибки;
	
КонецПроцедуры

Процедура ОбновитьПроизвольныеУсловияСкидок(Параметры) Экспорт
	
	Если Не ПланыОбмена.ГлавныйУзел() = Неопределено Тогда 
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос();
	ТекстЗапроса =
	"	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Условия.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УсловияПредоставленияСкидокНаценок КАК Условия
	|Где Условия.УсловиеПредоставления = Значение(Перечисление.УсловияПредоставленияСкидокНаценок.ПроизвольныйЗапрос)
	|	И Не Условия.СхемаСКДМодифицированаВручную";
	Запрос.Текст = ТекстЗапроса;
	
	ВыбУсловия = Запрос.Выполнить().Выбрать();
	ЕстьОшибки = Ложь;
	ВыбраноЗаписей = ВыбУсловия.Количество();
	Попытка
		НачатьТранзакцию();
		Пока ВыбУсловия.Следующий() Цикл 
			Спр = ВыбУсловия.Ссылка.ПолучитьОбъект();
			СхемаКомпановкиДанныхУсловия = Справочники.УсловияПредоставленияСкидокНаценок.ПолучитьМакет(Спр.ИмяСхемыКомпоновкиДанных);		
			Если Не СхемаКомпановкиДанныхУсловия = Неопределено Тогда
				// Схема и настройки нужны для полного восстановления, и возможности редактирования интерактивно
				Спр.ХранилищеСхемыКомпоновкиДанных = Новый ХранилищеЗначения(СхемаКомпановкиДанныхУсловия);

				СуществующиеНастройки = Спр.ХранилищеНастроекКомпоновкиДанных.Получить();
				АдресСхемыКомпановкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпановкиДанныхУсловия);
				ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпановкиДанных);
				КомпановщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
				КомпановщикНастроек.Инициализировать(ИсточникНастроек);
				КомпановщикНастроек.ЗагрузитьНастройки(СуществующиеНастройки);
				КомпановщикНастроек.Восстановить();
				НастройкаКомпановкиДанных = КомпановщикНастроек.ПолучитьНастройки();
				Спр.ХранилищеНастроекКомпоновкиДанных = Новый ХранилищеЗначения(НастройкаКомпановкиДанных);
				
				// Фактически, для выполнения будет использоваться уже заранее скомпанованный макет.
				// Для каждого отдельного документа будут обновляться значения параметров, и данные в менеджере временных таблиц
				КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
				МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпановкиДанныхУсловия, НастройкаКомпановкиДанных,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
				Спр.ХранилищеСкомпанованногоМакета = Новый ХранилищеЗначения(МакетКомпоновки);
				Спр.Записать();
			КонецЕсли;
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение 
		ОтменитьТранзакцию();
		ЕстьОшибки = Истина;
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;

	Параметры.ОбработкаЗавершена = НЕ ЕстьОшибки;
	
КонецПроцедуры

Процедура УдалитьРегистрациюИзмененийДопустимыеЗначенияПотребительскихСвойствЗЕРНО() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Полный.Ссылка КАК Ссылка
	|ИЗ
	|	ПланОбмена.Полный КАК Полный
	|ГДЕ
	|	Полный.ЭтотУзел = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СОтборами.Ссылка
	|ИЗ
	|	ПланОбмена.СОтборами КАК СОтборами
	|ГДЕ
	|	СОтборами.ЭтотУзел = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АвтономнаяРабота.Ссылка
	|ИЗ
	|	ПланОбмена.АвтономнаяРабота КАК АвтономнаяРабота
	|ГДЕ
	|	АвтономнаяРабота.ЭтотУзел = ЛОЖЬ";
	
	УзлыОбмена = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Если УзлыОбмена.Количество() Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(УзлыОбмена, Метаданные.РегистрыСведений.ДопустимыеЗначенияПотребительскихСвойствЗЕРНО);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_3_0_7

Процедура ОбновитьОтчеты_3_0_7(ПараметрыОбработчика) Экспорт
	
	ОтчетыКОбновлению = Новый Массив;
	
	ОтчетыКОбновлению.Добавить(Метаданные.Отчеты.КонвертацияПосетителей);
	ОтчетыКОбновлению.Добавить(Метаданные.Отчеты.СтатистикаЧековПоДнямНедели);
	ОтчетыКОбновлению.Добавить(Метаданные.Отчеты.СтатистикаЧековПоЧасам);
	
	ОтчетыУНФ.ОбновитьОтчетыВыборочно(ОтчетыКОбновлению);
	
	ПараметрыОбработчика.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

Процедура ПереносОстатковНоменклатурыПоставщиков(ПараметрыОбработчика) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 500
	|	НоменклатураПоставщиков.Ссылка КАК НоменклатураПоставщика,
	|	НоменклатураПоставщиков.УдалитьОстаток КАК Количество
	|ИЗ
	|	Справочник.НоменклатураПоставщиков КАК НоменклатураПоставщиков
	|ГДЕ
	|	НоменклатураПоставщиков.УдалитьОстаток > 0";
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Не Результат.Количество() Тогда
		ПараметрыОбработчика.ОбработкаЗавершена = Истина;
		Возврат
	КонецЕсли;
	
	
	Пока Результат.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			НоменклатураПоставщика = Результат.НоменклатураПоставщика;
			НоменклатураПоставщика = НоменклатураПоставщика.ПолучитьОбъект();
			НоменклатураПоставщика.Заблокировать();
			
			НаборЗаписей = РегистрыСведений.ОстаткиТоваровПоставщиков.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.НоменклатураПоставщика.Установить(Результат.НоменклатураПоставщика); 
			
			НоваяЗапись = НаборЗаписей.Добавить(); 
			НоваяЗапись.НоменклатураПоставщика = Результат.НоменклатураПоставщика; 
			НоваяЗапись.Количество = Результат.Количество; 
			
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей, Истина);
			
			НоменклатураПоставщика.УдалитьОстаток = 0;
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НоменклатураПоставщика, Истина);
			
			НоменклатураПоставщика.Разблокировать();
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ИмяСобытия = НСтр("ru = 'Выполнение обработчика переноса остатков номенклатуры поставщиков.'", ОбщегоНазначения.КодОсновногоЯзыка()); 
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не удалось обработать номенклатуру поставщика по причине:
			|%1'"), ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,, Результат.НоменклатураПоставщика, ТекстСообщения);
			
		КонецПопытки
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьКалендарьНалоговИОтчетность2024() Экспорт
	
	Если ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ() Тогда
		Возврат;
	КонецЕсли; 
	
	Справочники.КалендарьПодготовкиОтчетности.ЗагрузитьКалендарьПодготовкиОтчетности();
	
КонецПроцедуры

Процедура УстановитьВариантВыводаСуммыБезСкидки(ПараметрыОбработчика) Экспорт
	
	Если ЗначениеЗаполнено(Константы.ВыводитьСуммуБезСкидки.Получить()) Тогда
		Возврат;
	КонецЕсли;
	
	Константы.ВыводитьСуммуБезСкидки.Установить(Перечисления.ВариантыВыводаСуммыБезСкидки.НеПечатать);
	
КонецПроцедуры

Процедура ОчиститьСохраненныеОтборыПечатиЭтикеток() Экспорт
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ПечатьЭтикетокИЦенниковНастройкиФормыБПО", "", Неопределено);
	
КонецПроцедуры

Процедура ЗаполнитьНастройкиПредпросмотра(ПараметрыОбработчика) Экспорт
	
	СписокПользователей = Новый Массив();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Пользователи.Ссылка КАК Пользователь
	               |ИЗ
	               |	Справочник.Пользователи КАК Пользователи
	               |ГДЕ
	               |	Пользователи.Служебный = ЛОЖЬ
	               |	И Пользователи.ПометкаУдаления = ЛОЖЬ";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокПользователей.Добавить(Выборка.Пользователь);
	КонецЦикла;
	
	Для Каждого Пользователь Из СписокПользователей Цикл
		РегистрыСведений.НастройкиПользователей.Установить(Истина, "ПоказыватьПредпросмотрЗаказовПокупателей",
			 Пользователь);
		РегистрыСведений.НастройкиПользователей.Установить(Истина, "ПоказыватьПредпросмотрЗаказНарядов",
			 Пользователь);
	КонецЦикла;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

Процедура СоздатьЗаданияЗаписиОтложенныхСообщенийВСистемуВзаимодействия(ПараметрыОбработчика) Экспорт
	
	ОбсужденияУНФ.ВыполнитьПереходНаЗаданиеЗаписиОтложенныхСообщенийВСистемуВзаимодействия();
	
	ПараметрыОбработчика.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

Процедура ПометитьНаУдалениеЗадачиВзносыИПДоходы() Экспорт
	
	Если ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ() Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьОшибки = Ложь;
	
	Справочники.КалендарьПодготовкиОтчетности.ЗагрузитьКалендарьПодготовкиОтчетности();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаписиКалендаряПодготовкиОтчетности.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.СистемыНалогообложенияОрганизаций КАК СистемыНалогообложенияОрганизаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗаписиКалендаряПодготовкиОтчетности КАК ЗаписиКалендаряПодготовкиОтчетности
	|		ПО СистемыНалогообложенияОрганизаций.Организация = ЗаписиКалендаряПодготовкиОтчетности.Организация
	|ГДЕ
	|	ЗаписиКалендаряПодготовкиОтчетности.СобытиеКалендаря.Задача В(&МассивЗадачВзносыИП)
	|	И ГОД(ЗаписиКалендаряПодготовкиОтчетности.СобытиеКалендаря.ДатаОкончанияСобытия) >= 2023
	|	И (ЕСТЬNULL(СистемыНалогообложенияОрганизаций.ПлательщикУСН, ЛОЖЬ)
	|				И СистемыНалогообложенияОрганизаций.ОбъектНалогообложения = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовНалогообложения.Доходы)
	|			ИЛИ СистемыНалогообложенияОрганизаций.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.ОсобыйПорядок)
	|				И ЕСТЬNULL(СистемыНалогообложенияОрганизаций.ПрименяетсяПатент, ЛОЖЬ))
	|	И ВЫБОР
	|			КОГДА ЗаписиКалендаряПодготовкиОтчетности.СобытиеКалендаря.Задача = ЗНАЧЕНИЕ(Справочник.ЗадачиКалендаряПодготовкиОтчетности.СтраховыеВзносыИП)
	|					И ЗаписиКалендаряПодготовкиОтчетности.СобытиеКалендаря.УпрощенныйЗачетФиксированныхВзносов = ЛОЖЬ
	|				ТОГДА ИСТИНА
	|			КОГДА ЗаписиКалендаряПодготовкиОтчетности.СобытиеКалендаря.Задача = ЗНАЧЕНИЕ(Справочник.ЗадачиКалендаряПодготовкиОтчетности.СтраховыеВзносыПриДоходахСвыше300ТР)
	|					И ЗаписиКалендаряПодготовкиОтчетности.СобытиеКалендаря.УпрощенныйЗачетФиксированныхВзносов = ЛОЖЬ
	|				ТОГДА ИСТИНА
	|			КОГДА ЗаписиКалендаряПодготовкиОтчетности.СобытиеКалендаря.Задача = ЗНАЧЕНИЕ(Справочник.ЗадачиКалендаряПодготовкиОтчетности.СтраховыеВзносыЗаСотрудников)
	|					И ЗаписиКалендаряПодготовкиОтчетности.СобытиеКалендаря.ДатаОкончанияСобытия = &ДатаОкончанияСтраховыеВзносыЗаСотрудников
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И ЗаписиКалендаряПодготовкиОтчетности.ПометкаУдаления = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаписиКалендаряПодготовкиОтчетности.Ссылка
	|ИЗ
	|	Справочник.ЗаписиКалендаряПодготовкиОтчетности КАК ЗаписиКалендаряПодготовкиОтчетности
	|ГДЕ
	|	ГОД(ЗаписиКалендаряПодготовкиОтчетности.СобытиеКалендаря.ДатаОкончанияСобытия) >= 2023
	|	И ВЫБОР
	|			КОГДА ЗаписиКалендаряПодготовкиОтчетности.СобытиеКалендаря.Задача = ЗНАЧЕНИЕ(Справочник.ЗадачиКалендаряПодготовкиОтчетности.СтраховыеВзносыЗаСотрудников)
	|					И ЗаписиКалендаряПодготовкиОтчетности.СобытиеКалендаря.ДатаОкончанияСобытия = &ДатаОкончанияСтраховыеВзносыЗаСотрудников
	|				ТОГДА ИСТИНА
	|			КОГДА ЗаписиКалендаряПодготовкиОтчетности.СобытиеКалендаря.Задача = ЗНАЧЕНИЕ(Справочник.ЗадачиКалендаряПодготовкиОтчетности.СтраховыеВзносыИП)
	|					И ЗаписиКалендаряПодготовкиОтчетности.СобытиеКалендаря.ДатаОкончанияСобытия = &ДатаОкончанияСтраховыеВзносыИП
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И ЗаписиКалендаряПодготовкиОтчетности.ПометкаУдаления = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КалендарьПодготовкиОтчетности.Ссылка
	|ИЗ
	|	Справочник.КалендарьПодготовкиОтчетности КАК КалендарьПодготовкиОтчетности
	|ГДЕ
	|	(КалендарьПодготовкиОтчетности.Задача = ЗНАЧЕНИЕ(Справочник.ЗадачиКалендаряПодготовкиОтчетности.СтраховыеВзносыЗаСотрудников)
	|				И КалендарьПодготовкиОтчетности.ДатаОкончанияСобытия = &ДатаОкончанияСтраховыеВзносыЗаСотрудников
	|			ИЛИ КалендарьПодготовкиОтчетности.Задача = ЗНАЧЕНИЕ(Справочник.ЗадачиКалендаряПодготовкиОтчетности.СтраховыеВзносыИП)
	|				И КалендарьПодготовкиОтчетности.ДатаОкончанияСобытия = &ДатаОкончанияСтраховыеВзносыИП)
	|	И КалендарьПодготовкиОтчетности.ПометкаУдаления = ЛОЖЬ";
	
	МассивЗадачВзносыИП = 	Новый Массив;
	МассивЗадачВзносыИП.Добавить(Справочники.ЗадачиКалендаряПодготовкиОтчетности.СтраховыеВзносыИП); 
	МассивЗадачВзносыИП.Добавить(Справочники.ЗадачиКалендаряПодготовкиОтчетности.СтраховыеВзносыПриДоходахСвыше300ТР);  
	
	Запрос.УстановитьПараметр("МассивЗадачВзносыИП", МассивЗадачВзносыИП); 
	Запрос.УстановитьПараметр("ДатаОкончанияСтраховыеВзносыЗаСотрудников", '20240326');     
	Запрос.УстановитьПараметр("ДатаОкончанияСтраховыеВзносыИП", '20250109');
	
	Попытка
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
			
			ЗадачаКалендаря = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ЗадачаКалендаря.УстановитьПометкуУдаления(Истина);  
 		
		КонецЦикла; 
		
	Исключение
		
		ЕстьОшибки = Истина;
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ИмяСобытия = НСтр("ru = 'Выполнение обработчика ПометитьНаУдалениеЗадачиВзносыИПДоходы'", 
		ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		
	КонецПопытки;   	                                       	
			
КонецПроцедуры

Процедура УстановитьНастройкиКонтроляМаркировкиРМК(ПараметрыОбработчика) Экспорт
	
	ЗапрашиватьДанныеСервисаИСМП = Константы.ЗапрашиватьДанныеСервисаИСМП.Получить();
	ВестиУчетМаркированнойПродукции = Константы.ВестиУчетМаркируемойПродукцииИСМП.Получить();
	ОжидатьРезультатПроверкиМарок = ЗапрашиватьДанныеСервисаИСМП И ВестиУчетМаркированнойПродукции;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиРабочегоМестаКассира.Ссылка КАК Ссылка,
	|	НастройкиРабочегоМестаКассира.ОжидатьРезультатПроверкиМарок КАК ОжидатьРезультатПроверкиМарок
	|ИЗ
	|	Справочник.НастройкиРабочегоМестаКассира КАК НастройкиРабочегоМестаКассира
	|ГДЕ
	|	НЕ НастройкиРабочегоМестаКассира.ПометкаУдаления
	|	И НастройкиРабочегоМестаКассира.ОжидатьРезультатПроверкиМарок <> &ОжидатьРезультатПроверкиМарок";
	
	Запрос.УстановитьПараметр("ОжидатьРезультатПроверкиМарок", ОжидатьРезультатПроверкиМарок);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НастройкаРМК = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
		Попытка
			НастройкаРМК.Заблокировать();
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Фоновое обновление настроек РМК'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,, НастройкаРМК, ПодробноеПредставлениеОшибки);
			
			ПараметрыОбработчика.ОбработкаЗавершена = Ложь;
			Возврат;
			
		КонецПопытки;
		
		НастройкаРМК.ОжидатьРезультатПроверкиМарок = ОжидатьРезультатПроверкиМарок;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НастройкаРМК);
	
	КонецЦикла;
	
	ПараметрыОбработчика.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

Процедура ЗаполнитьРегистрНастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС(ПараметрыОбработчика) Экспорт

	РегистрыСведений.НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.ЗаполнитьРегистр();
	РегистрыСведений.НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.ЗаполнитьТарифФиксированныхВзносов(ПараметрыОбработчика);

КонецПроцедуры

Процедура ОбработатьДублиСправочникаВидыТарифовСтраховыхВзносовУНФ() Экспорт
	
	Если ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ() Тогда
		Возврат;
	КонецЕсли;	
	
	ПометитьНаУдалениеДублиСправочникаВидыТарифовСтраховыхВзносовУНФ();
	УдалитьПомеченныеОбъектыСправочникаВидыТарифовСтраховыхВзносовУНФ();
	Справочники.ВидыТарифовСтраховыхВзносовУНФ.НачальноеЗаполнение(); 
	РегистрыСведений.ТарифыСтраховыхВзносовУНФ.НачальноеЗаполнение();
	
КонецПроцедуры
	
Процедура ПометитьНаУдалениеДублиСправочникаВидыТарифовСтраховыхВзносовУНФ()		
		
		Запрос = Новый Запрос; 
		ТекстЗапроса = 	"ВЫБРАТЬ
		               	|	КОЛИЧЕСТВО(ВидыТарифовСтраховыхВзносовУНФ.Наименование) КАК КоличествоДублей,
		               	|	ВидыТарифовСтраховыхВзносовУНФ.Наименование КАК Наименование
		               	|ИЗ
		               	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
		               	|
		               	|СГРУППИРОВАТЬ ПО
		               	|	ВидыТарифовСтраховыхВзносовУНФ.Наименование
		               	|
		               	|ИМЕЮЩИЕ
		               	|	КОЛИЧЕСТВО(ВидыТарифовСтраховыхВзносовУНФ.Наименование) > 1
		               	|
		               	|ОБЪЕДИНИТЬ ВСЕ
		               	|
		               	|ВЫБРАТЬ
		               	|	КОЛИЧЕСТВО(ВидыТарифовСтраховыхВзносовУНФ.Наименование),
		               	|	ВидыТарифовСтраховыхВзносовУНФ.Наименование
		               	|ИЗ
		               	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
		               	|ГДЕ
		               	|	ВидыТарифовСтраховыхВзносовУНФ.Наименование = ""Организации, применяющие УСН, кроме производственных""
		               	|
		               	|СГРУППИРОВАТЬ ПО
		               	|	ВидыТарифовСтраховыхВзносовУНФ.Наименование";	
		
		Запрос.Текст = ТекстЗапроса;
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НачатьТранзакцию();
			
			Попытка 
				
				СобытиеКУдалению = НайтиЭлементКУдалениюПоНаименованию(ВыборкаДетальныеЗаписи.Наименование);
				Если СобытиеКУдалению <> Неопределено Тогда 
					СобытиеКУдалению = СобытиеКУдалению.Ссылка.ПолучитьОбъект();   
					НаименованиеДляПоиска = СобытиеКУдалению.Наименование; 
					СобытиеКУдалению.Наименование = "Удалить" + Строка(СобытиеКУдалению.Ссылка.УникальныйИдентификатор()) + СобытиеКУдалению.Наименование; 
					Если СтрНайти(СобытиеКУдалению.Наименование, "Организации, применяющие УСН, кроме производственных") > 0 Тогда
						 СобытиеКУдалению.ИмяПредопределенныхДанных = "";
					КонецЕсли;
					СобытиеКУдалению.ПометкаУдаления = Истина; 					
					ОбновлениеИнформационнойБазы.ЗаписатьДанные(СобытиеКУдалению); 
					
					СписокСсылок = Новый Массив;
					СписокСсылок.Добавить(СобытиеКУдалению.Ссылка);
					СсылкиНаОбъекты = НайтиПоСсылкам(СписокСсылок); 
					Эталон = НайтиЭталонПоНаименованию(НаименованиеДляПоиска); 
					
					Если Эталон <> Неопределено Тогда   
						ЭталонОбъект = Эталон.ПолучитьОбъект();
						ЭталонОбъект.УстановитьПометкуУдаления(Ложь); 
						
						
						// 1. заменяем ссылки в базе
						Если СсылкиНаОбъекты.Количество()>0 Тогда
							Для Каждого ОбъектДанных Из СсылкиНаОбъекты Цикл
								
								СсылкаВБазе = ОбъектДанных.Данные;
								
								Если Тип("РегистрСведенийКлючЗаписи.ПрименяемыеТарифыСтраховыхВзносовУНФ") = ТипЗнч(СсылкаВБазе) Тогда
									Запись = РегистрыСведений.ПрименяемыеТарифыСтраховыхВзносовУНФ.СоздатьМенеджерЗаписи();
									ЗаполнитьЗначенияСвойств(Запись, СсылкаВБазе);
									Запись.Прочитать();
									Запись.ВидТарифа = Эталон;
									Запись.Записать();
								ИначеЕсли Тип("РегистрСведенийКлючЗаписи.ТарифыСтраховыхВзносовУНФ") = ТипЗнч(СсылкаВБазе) Тогда
									Запись = РегистрыСведений.ТарифыСтраховыхВзносовУНФ.СоздатьМенеджерЗаписи();
									ЗаполнитьЗначенияСвойств(Запись, СсылкаВБазе);
									Запись.Прочитать();
									Запись.ВидТарифа = Эталон;
									Запись.Записать();
								КонецЕсли;
								
							КонецЦикла; 
						КонецЕсли; 
						
					КонецЕсли;
					ЗафиксироватьТранзакцию(); 
				КонецЕсли;			
			Исключение
				ОтменитьТранзакцию(); 
				
				ИнформацияОбОшибке = ИнформацияОбОшибке();
				ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
				ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Ошибка выполнения обработки дублей в справочнике ""Виды тарифов страховых взносов(управл.)""'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки);
				
			КонецПопытки;
		КонецЦикла;  		
		
		Запрос = Неопределено;
		РезультатЗапроса = Неопределено;  
		
		Запрос = Новый Запрос; 	
		
		Запрос.Текст = ТекстЗапроса;
		
		РезультатЗапросаПроверка = Запрос.Выполнить();
		
		Если НЕ РезультатЗапросаПроверка.Пустой() Тогда
			ПометитьНаУдалениеДублиСправочникаВидыТарифовСтраховыхВзносовУНФ();	
		КонецЕсли;
		
КонецПроцедуры
	
Процедура УдалитьПомеченныеОбъектыСправочникаВидыТарифовСтраховыхВзносовУНФ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл		
		НачатьТранзакцию();
		
		ОбъектСправочник = ВыборкаДетальныеЗаписи.Ссылка;
		ОбъектСправочник = ОбъектСправочник.ПолучитьОбъект();  
		Попытка
			ОбновлениеИнформационнойБазы.УдалитьДанные(ОбъектСправочник, Ложь);
			
			ЗафиксироватьТранзакцию(); 
			
		Исключение
			ОтменитьТранзакцию(); 
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Ошибка выполнения обработки дублей в справочнике ""Виды тарифов страховых взносов(управл.)""'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки);
			
		КонецПопытки;    	
		
	КонецЦикла; 
	
КонецПроцедуры 

Функция НайтиЭталонПоНаименованию(Наименование)
	
	Если Наименование = "Организации, применяющие УСН, кроме производственных" Тогда
		ЭталонУСН = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыТарифовСтраховыхВзносовУНФ.УпрощенныйНалоговыйРежим");
		Если ЭталонУСН = Неопределено Тогда 
			ЭталонУСН = Справочники.ВидыТарифовСтраховыхВзносовУНФ.НайтиПоНаименованию("Основной тариф, организации или ИП на УСН");
		КонецЕсли;
		
		Если ЭталонУСН = Справочники.ВидыТарифовСтраховыхВзносовУНФ.ПустаяСсылка() ИЛИ 
			ЭталонУСН = Неопределено Тогда  
			ВидТарифаОбъект = Справочники.ВидыТарифовСтраховыхВзносовУНФ.СоздатьЭлемент();			
			ВидТарифаОбъект.Наименование = "Основной тариф, организации или ИП на УСН";
			ВидТарифаОбъект.КодПФР2011 = "51";
			ВидТарифаОбъект.КодФСС2011 = "071";
			ВидТарифаОбъект.ИдентификаторОбъекта = "УпрощенныйНалоговыйРежим";
			ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьУдалениеОбъектаСИдентификатором", Истина); 		
			ВидТарифаОбъект.ИмяПредопределенныхДанных = "УпрощенныйНалоговыйРежим";	
			ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных"); 			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ВидТарифаОбъект);
			
			ЭталонУСН = ВидТарифаОбъект.Ссылка;
		КонецЕсли;
		
		Возврат ЭталонУСН;
		
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.Наименование = &Наименование
	|	И НЕ ВидыТарифовСтраховыхВзносовУНФ.Наименование ПОДОБНО ""Удалить%""";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции 

Функция НайтиЭлементКУдалениюПоНаименованию(Наименование)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка КАК Ссылка,
	|	ВидыТарифовСтраховыхВзносовУНФ.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.Наименование = &Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидыТарифовСтраховыхВзносовУНФ.ИмяПредопределенныхДанных";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ОбновитьМакетыШаблоновЧекаККМ(Параметры) Экспорт
	
	Если Не ПланыОбмена.ГлавныйУзел() = Неопределено Тогда 
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос();
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ХранилищеШаблонов.Ссылка,
	|	ХранилищеШаблонов.СхемаКомпоновкиДанных
	|ИЗ
	|	Справочник.ХранилищеШаблонов КАК ХранилищеШаблонов
	|ГДЕ
	|	ХранилищеШаблонов.ТипШаблона = ЗНАЧЕНИЕ(Перечисление.ТипыШаблонов.ЧекККМ)";
	Запрос.Текст = ТекстЗапроса;
	
	ВыбШаблоны = Запрос.Выполнить().Выбрать();
	ЕстьОшибки = Ложь;
	
	Попытка
		НачатьТранзакцию();
		Пока ВыбШаблоны.Следующий() Цикл 
			МакетДанныхЧекаККМ = Документы.ЧекККМ.ПолучитьМакет("ПоляШаблонаЧекККТ");
			Если МакетДанныхЧекаККМ = Неопределено Тогда
				ВызватьИсключение("Макет СКД для шаблона чека ккм не обнаружен.");
			КонецЕсли;
			АдресСхемыКомпановкиДанных = ПоместитьВоВременноеХранилище(МакетДанныхЧекаККМ);
			ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпановкиДанных);

			Спр = ВыбШаблоны.Ссылка.ПолучитьОбъект();		
			СуществующаяСхема = Спр.СхемаКомпоновкиДанных.Получить();
			Если СуществующаяСхема = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Спр.СхемаКомпоновкиДанных = Новый ХранилищеЗначения(МакетДанныхЧекаККМ);
			Спр.Записать();
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение 
		ОтменитьТранзакцию();
		ЕстьОшибки = Истина;
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;

	Параметры.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

Процедура ОбновитьПризнакПредметаРасчетаПивоИМех(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 300
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ЭтоГруппа
	|	И Номенклатура.ВидПродукцииИС = ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.Пиво)
	|	И Номенклатура.ПродаетсяВРозлив
	|	И НЕ Номенклатура.ПризнакПредметаРасчета В (ЗНАЧЕНИЕ(Перечисление.ПризнакиПредметаРасчета.ПодакцизныйТоварМаркируемыйСИНеИмеющийКМ), ЗНАЧЕНИЕ(Перечисление.ПризнакиПредметаРасчета.ПустаяСсылка))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ЭтоГруппа
	|	И Номенклатура.ВидПродукцииИС = ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха)
	|	И НЕ Номенклатура.ПризнакПредметаРасчета В (ЗНАЧЕНИЕ(Перечисление.ПризнакиПредметаРасчета.Товар), ЗНАЧЕНИЕ(Перечисление.ПризнакиПредметаРасчета.ПустаяСсылка))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ЭтоГруппа
	|	И Номенклатура.ВидМаркировки = ЗНАЧЕНИЕ(Перечисление.ВидыМаркировки.МаркируемаяПродукция)
	|	И НЕ Номенклатура.ПризнакПредметаРасчета В (ЗНАЧЕНИЕ(Перечисление.ПризнакиПредметаРасчета.Товар), ЗНАЧЕНИЕ(Перечисление.ПризнакиПредметаРасчета.ПустаяСсылка))";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	Иначе
		Параметры.ОбработкаЗавершена = Ложь;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		
		Попытка 
			НачатьТранзакцию();
			ОбъектСправочника = Выборка.Ссылка.ПолучитьОбъект();
			ОбъектСправочника.Заблокировать();
			ОбъектСправочника.ПризнакПредметаРасчета = РозничныеПродажиСервер.ПолучитьОжидаемыйПризнакПредметаРасчета(ОбъектСправочника.ТипНоменклатуры,
				ОбъектСправочника.ВидПродукцииИС,
				ОбъектСправочника.ВидМаркировки,
				ОбъектСправочника.ПодакцизныйТовар,
				ОбъектСправочника.ПродаетсяВРозлив);
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектСправочника);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка выполнения обработчика заполнения ставок НДС в номенклатуре'",
			ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,, ОбъектСправочника, ПодробноеПредставлениеОшибки);
			
			Параметры.ОбработкаЗавершена = Ложь;
			Возврат;
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

#Область Обработчики_3_0_8

Процедура ОбновитьЗаданияЗаписиОтложенныхСообщенийВСистемуВзаимодействия(ПараметрыОбработчика) Экспорт
	
	ОбсужденияУНФ.ОбновитьЗаданияЗаписиОтложенныхСообщенийВСистемуВзаимодействия(ПараметрыОбработчика);
	
КонецПроцедуры

Процедура ЗарегистрироватьДанныеКОбработкеОбновлениеДатРазрешительногоРежима(Параметры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ДатаПерехода = Константы.УдалитьДатаОбязательнойМаркировкиТабачнойПродукцииМОТП.Получить();
	Если ДатаПерехода = Дата("20240501") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыПродукцииИС.Ссылка КАК ВидПродукции
		|ИЗ
		|	Перечисление.ВидыПродукцииИС КАК ВидыПродукцииИС
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаМаркируемойПродукцииИСМП КАК НастройкиУчетаМаркируемойПродукцииИСМП
		|		ПО (НастройкиУчетаМаркируемойПродукцииИСМП.ВидПродукции = ВидыПродукцииИС.Ссылка)
		|ГДЕ
		|	ЕСТЬNULL(НастройкиУчетаМаркируемойПродукцииИСМП.ДатаОбязательногоВключенияРазрешительногоРежима, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(2024, 5, 1)
		|	И ВидыПродукцииИС.Ссылка В(&ВидыПродукцииИСМП)
		|	И НастройкиУчетаМаркируемойПродукцииИСМП.ВестиУчетПродукции";
	
	ВидыПродукцииИСМП = Новый Массив;
	ВидыПродукцииИСМП.Добавить(Перечисления.ВидыПродукцииИС.МолочнаяПродукцияБезВЕТИС);
	ВидыПродукцииИСМП.Добавить(Перечисления.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС);
	ВидыПродукцииИСМП.Добавить(Перечисления.ВидыПродукцииИС.УпакованнаяВода);
	Запрос.УстановитьПараметр("ВидыПродукцииИСМП", ВидыПродукцииИСМП);
	ТаблицаИзмерений = Запрос.Выполнить().Выгрузить();
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ПолноеИмяРегистра = "РегистрСведений.НастройкиУчетаМаркируемойПродукцииИСМП";
	ДополнительныеПараметры.ЭтоНезависимыйРегистрСведений = Истина;
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, ТаблицаИзмерений, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОбработатьДанныеОбновлениеДатРазрешительногоРежима(Параметры) Экспорт
	
	ПолноеИмяРегистра  = "РегистрСведений.НастройкиУчетаМаркируемойПродукцииИСМП";
	МетаданныеРегистра = Метаданные.РегистрыСведений.НастройкиУчетаМаркируемойПродукцииИСМП;
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ПолноеИмяРегистра             = ПолноеИмяРегистра;
	ДополнительныеПараметры.ЭтоНезависимыйРегистрСведений = Истина;
	
	Выборка = ОбновлениеИнформационнойБазы.ВыбратьИзмеренияНезависимогоРегистраСведенийДляОбработки(Параметры.Очередь, ПолноеИмяРегистра);
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяРегистра);
			ЭлементБлокировки.УстановитьЗначение("ВидПродукции", Выборка.ВидПродукции);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			
			НаборЗаписей = РегистрыСведений.НастройкиУчетаМаркируемойПродукцииИСМП.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор["ВидПродукции"].Установить(Выборка.ВидПродукции);
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() = 0 Тогда
				НоваяСтрока = НаборЗаписей.Добавить();
				НоваяСтрока.ВидПродукции                                    = Выборка.ВидПродукции;
				НоваяСтрока.ДатаОбязательнойМаркировки                      = РегистрыСведений.НастройкиУчетаМаркируемойПродукцииИСМП.ДатаНачалаУчетаМаркируемойПродукции(Выборка.ВидПродукции);
				НоваяСтрока.ДатаОбязательногоВключенияРазрешительногоРежима = РегистрыСведений.НастройкиУчетаМаркируемойПродукцииИСМП.ДатаНачалаДействияРазрешительногоРежимаНаККТ(Выборка.ВидПродукции);
			Иначе
				НоваяСтрока = НаборЗаписей[0];
				НоваяСтрока.ДатаОбязательногоВключенияРазрешительногоРежима = РегистрыСведений.НастройкиУчетаМаркируемойПродукцииИСМП.ДатаНачалаДействияРазрешительногоРежимаНаККТ(Выборка.ВидПродукции);
			КонецЕсли;
			
			Если НаборЗаписей.Модифицированность() Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(НаборЗаписей, ДополнительныеПараметры);
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстСообщения = НСтр("ru = 'Не удалось обновить дату начала действия разрешительного режима розничной продажи по виду продукции: %1 по причине: %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.ВидПродукции, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение, МетаданныеРегистра,, ТекстСообщения);
			ВызватьИсключение;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяРегистра);
	
КонецПроцедуры

Процедура ОбновитьЗаписиСтраховыеВзносыПриДоходахСвыше300тр() Экспорт
	
	Если ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ() Тогда
		Возврат;
	КонецЕсли;	

	Справочники.КалендарьПодготовкиОтчетности.ОбновитьЗаписиСтраховыеВзносыПриДоходахСвыше300тр();
	
КонецПроцедуры

Процедура ИсправитьНумерациюСогласийПД(Параметры) Экспорт
	Если Не ПланыОбмена.ГлавныйУзел() = Неопределено Тогда 
		Возврат;
	КонецЕсли; 
	РазмерПорции = 100;
	Запрос = Новый Запрос();
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НастройкиУзлов.Префикс КАК Префикс
	|ПОМЕСТИТЬ вт_ПрефиксыИБ
	|ИЗ
	|	РегистрСведений.ОбщиеНастройкиУзловИнформационныхБаз КАК НастройкиУзлов
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НастройкиУзлов.ПрефиксКорреспондента
	|ИЗ
	|	РегистрСведений.ОбщиеНастройкиУзловИнформационныхБаз КАК НастройкиУзлов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(&ПрефиксТекущейИБ КАК СТРОКА(2))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""00""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Организация.Ссылка КАК Организация,
	|	Организация.Префикс КАК ПрефиксОрганизации,
	|	ПрефиксыИБ.Префикс КАК ПрефиксИБ,
	|	Организация.Префикс + ПрефиксыИБ.Префикс + ""-"" КАК ШаблонПрефикса,
	|	Организация.Префикс + ПрефиксыИБ.Префикс + ""-"" + ""[0-9][0-9][0-9][0-9][0-9][0-9]"" КАК ШаблонНомера,
	|	Организация.Префикс + ПрефиксыИБ.Префикс + ""-"" + Организация.Префикс + ПрефиксыИБ.Префикс + ""-"" + ""[0-9]"" КАК ШаблонПлохогоНомера
	|ПОМЕСТИТЬ вт_ВозможныеПрефиксы
	|ИЗ
	|	(ВЫБРАТЬ
	|		Организация.Ссылка КАК Ссылка,
	|		""00"" КАК Префикс
	|	ИЗ
	|		Справочник.Организации КАК Организация
	|	ГДЕ
	|		Организация.Префикс = """"
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Организация.Ссылка,
	|		""0"" + Организация.Префикс
	|	ИЗ
	|		Справочник.Организации КАК Организация
	|	ГДЕ
	|		Организация.Префикс ПОДОБНО ""_""
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Организация.Ссылка,
	|		Организация.Префикс
	|	ИЗ
	|		Справочник.Организации КАК Организация
	|	ГДЕ
	|		Организация.Префикс ПОДОБНО ""__"") КАК Организация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_ПрефиксыИБ КАК ПрефиксыИБ
	|		ПО (ИСТИНА)
	|ГДЕ
	|	Организация.Ссылка В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Док.Организация
	|			ИЗ
	|				Документ.СогласиеНаОбработкуПерсональныхДанных КАК Док)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ЕСТЬNULL(Документ.Номер, ВозможныеПрефиксы.ШаблонПрефикса + ""000000"")) КАК ПолныйНомер,
	|	ПОДСТРОКА(МАКСИМУМ(ЕСТЬNULL(Документ.Номер, ВозможныеПрефиксы.ШаблонПрефикса + ""000000"")), 6, 6) КАК ПоследнийНомер,
	|	ВозможныеПрефиксы.ШаблонПрефикса КАК ШаблонПрефикса,
	|	ВозможныеПрефиксы.ШаблонНомера КАК ШаблонНомера,
	|	ВозможныеПрефиксы.ШаблонПлохогоНомера КАК ШаблонПлохогоНомера
	|ПОМЕСТИТЬ вт_ПоследниеНомера
	|ИЗ
	|	вт_ВозможныеПрефиксы КАК ВозможныеПрефиксы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СогласиеНаОбработкуПерсональныхДанных КАК Документ
	|		ПО ВозможныеПрефиксы.Организация = Документ.Организация
	|			И (Документ.Номер ПОДОБНО ВозможныеПрефиксы.ШаблонНомера)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВозможныеПрефиксы.ШаблонПрефикса,
	|	ВозможныеПрефиксы.ШаблонНомера,
	|	ВозможныеПрефиксы.ШаблонПлохогоНомера
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 100
	|	Документ.Ссылка КАК Документ,
	|	ПоследниеНомера.ПоследнийНомер КАК ПоследнийКорректныйНомер,
	|	ПоследниеНомера.ШаблонПрефикса КАК КорректныйПрефикс
	|ИЗ
	|	Документ.СогласиеНаОбработкуПерсональныхДанных КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_ПоследниеНомера КАК ПоследниеНомера
	|		ПО (Документ.Номер ПОДОБНО ПоследниеНомера.ШаблонПлохогоНомера)
	|ИТОГИ ПО
	|	КорректныйПрефикс";
	ПрефиксИнформационнойБазы = "";
	ПрефиксацияОбъектовСобытия.ПриОпределенииПрефиксаИнформационнойБазы(ПрефиксИнформационнойБазы);
	ПрефиксИнформационнойБазы = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ПрефиксИнформационнойБазы, 2, "0", "Слева");
	Запрос.УстановитьПараметр("ПрефиксТекущейИБ", ПрефиксИнформационнойБазы);                                          
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "100", XMLСтрока(РазмерПорции));
	
	ВыбПрефиксы = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ЕстьОшибки = Ложь;
	ВыбраноЗаписей = 0;
	Пока ВыбПрефиксы.Следующий() Цикл 
		КорректныйПрефикс = ВыбПрефиксы.КорректныйПрефикс;
		ВыбДок = ВыбПрефиксы.Выбрать();
		ВыбраноЗаписей = ВыбраноЗаписей + ВыбДок.Количество();
		НачатьТранзакцию();
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Документ.СогласиеНаОбработкуПерсональныхДанных");
			Блокировка.Заблокировать();
			Счетчик = 1;
			НомерЧислом = Неопределено;
			Пока ВыбДок.Следующий() Цикл
				Если НомерЧислом = Неопределено Тогда
					НомерЧислом = Число(ВыбДок.ПоследнийКорректныйНомер); 
				КонецЕсли;
				Попытка
					Док = ВыбДок.Документ.ПолучитьОбъект();				
					НовыйНомер = СтроковыеФункцииКлиентСервер.ДополнитьСтроку( XMLСтрока(НомерЧислом + Счетчик), 6, "0", "Слева");
					Док.Номер = КорректныйПрефикс + НовыйНомер;
					Док.Записать();
				Исключение 
					ОтменитьТранзакцию();
					ЕстьОшибки = Истина;
					ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ВызватьИсключение ТекстОшибки;
				КонецПопытки;
				Счетчик = Счетчик + 1;
			КонецЦикла;
		ЗафиксироватьТранзакцию();
	КонецЦикла;
	ОбновитьНумерациюОбъектов(Метаданные.Документы.СогласиеНаОбработкуПерсональныхДанных);

	Параметры.ОбработкаЗавершена = НЕ ЕстьОшибки И ВыбраноЗаписей < РазмерПорции;

КонецПроцедуры

#КонецОбласти

#КонецОбласти
