
#Область ПрограммныйИнтерфейс

// См. ОтчетыУНФ.ДобавитьОтчетВИсторию
Процедура ДобавитьОтчетВИсторию(Вариант) Экспорт
	
	ОтчетыУНФ.ДобавитьОтчетВИсторию(Вариант);
	
КонецПроцедуры

// См. ОтчетыУНФ.ПолучитьПереопределенныйКомпоновщикНастроек
Функция ПолучитьПереопределенныйКомпоновщикНастроек(СвойстваОтчета, ПараметрыИОтборы) Экспорт
	
	Возврат ОтчетыУНФ.ПолучитьПереопределенныйКомпоновщикНастроек(СвойстваОтчета, ПараметрыИОтборы);
	
КонецФункции

// См. ОтчетыУНФ.СформироватьКонтактыДляЭкспорта
Процедура СформироватьКонтактыДляЭкспорта(ОтчетДанныеРасшифровки, КонтактыОтчета) Экспорт
	ОтчетыУНФ.СформироватьКонтактыДляЭкспорта(ОтчетДанныеРасшифровки, КонтактыОтчета)
КонецПроцедуры

#КонецОбласти
