
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. РаботаСФайламиПереопределяемый.ПриСозданииФормыСпискаФайлов().
Процедура ПриСозданииФормыСпискаФайлов(Форма) Экспорт
	
	Если ТипЗнч(Форма.ВладелецФайла) <> Тип("ДокументСсылка.ЗадачаСотрудника") Тогда
		Возврат;
	КонецЕсли;
	
	Форма.Ширина = 40;
	Форма.Высота = 30;
	
КонецПроцедуры

// См. ПодключаемыеКомандыПереопределяемый.ПриОпределенииКомандПодключенныхКОбъекту
Процедура ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды) Экспорт
	
	Команда = Команды.Добавить();
	Команда.Вид = "Органайзер";
	Команда.Идентификатор = "ЗадачаСотрудника";
	Команда.Представление = НСтр("ru = 'Создать задачу'");
	Команда.Важность = "Обычное";
	Команда.Порядок = 100;
	Команда.ОтображениеКнопки = ОтображениеКнопки.Картинка;
	Команда.Картинка = БиблиотекаКартинок.ЗадачаСотрудника;
	Команда.ТипПараметра = Метаданные.ОпределяемыеТипы.ОснованиеЗадачи.Тип;
	Команда.ФункциональныеОпции = "ИспользоватьЗадачиСотрудников";
	Команда.ИзменяетВыбранныеОбъекты = Ложь;
	Команда.РежимЗаписи = "Записывать";
	Команда.Обработчик = "ЗадачиСотрудникаКлиент.СоздатьЗадачу";
	Команда.ТолькоВоВсехДействиях = Ложь;

КонецПроцедуры

#КонецОбласти

#КонецОбласти
