#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриПолученииСерверногоОповещения(ИмяОповещения, Результат) Экспорт
	ТекстОповещения = НСтр("ru = 'Получены обновления расширений из 1С:Плюс'");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуУстановкиРасширений", ЭтотОбъект);
	ПоказатьОповещениеПользователя(ТекстОповещения, 
		ОписаниеОповещения, 
		СтрСоединить(Результат, Символы.ПС) + Символы.ПС + НСтр("ru = 'Нажмите здесь для завершения установки'"), 
		БиблиотекаКартинок.ДиалогИнформация, 
		СтатусОповещенияПользователя.Важное);
КонецПроцедуры

Процедура ОткрытьФормуУстановкиРасширений(Знач ДанныеУведомления) Экспорт
	ОткрытьФорму("Обработка.ПлюсМагазинРасширений.Форма.ВзаимодействиеСМагазином", 
		Новый Структура("Установка", Истина));
КонецПроцедуры

#КонецОбласти
