#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПоказательБизнеса") Тогда
		ПоказательБизнеса = Параметры.ПоказательБизнеса;
		Список.Параметры.УстановитьЗначениеПараметра("ПоказательБизнеса",ПоказательБизнеса);
		Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьВсе",Ложь);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ПоказательБизнеса",Справочники.ПоказателиБизнеса.ПустаяСсылка());
		Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьВсе",Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	ПараметрыФормы = Новый Структура("ПоказательБизнеса", ПоказательБизнеса);
	ОткрытьФорму("РегистрСведений.СвязиПоказателейБюджета.ФормаЗаписи", ПараметрыФормы);
КонецПроцедуры


#КонецОбласти





