#Область ПрограммныйИнтерфейс

// Возвращает значение реквизита, прочитанного из информационной базы по ссылке на объект.
// Если доступа к реквизиту нет, возникнет исключение прав доступа.
// Если необходимо зачитать реквизит независимо от прав текущего пользователя,
// то следует использовать предварительный переход в привилегированный режим.
//
// Параметры:
//   Ссылка - ЛюбаяСсылка- ссылка на объект.
//   ИмяРеквизита - Строка - имя получаемого реквизита.
//
// Возвращаемое значение:
//   Произвольный - зависит от типа значения прочитанного реквизита.
//
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);
	
КонецФункции

// Возвращает структуру, содержащую значения реквизитов, прочитанные из информационной базы по ссылке на объект.
// Рекомендуется использовать вместо обращения к реквизитам объекта через точку от ссылки на объект
// для быстрого чтения отдельных реквизитов объекта из базы данных.
//
// Если необходимо зачитать реквизит независимо от прав текущего пользователя,
// то следует использовать предварительный переход в привилегированный режим.
//
// Параметры:
//  Ссылка    - ЛюбаяСсылка - объект, значения реквизитов которого необходимо получить.
//            - Строка      - полное имя предопределенного элемента, значения реквизитов которого необходимо получить.
//  Реквизиты - Строка - имена реквизитов, перечисленные через запятую, в формате
//                       требований к свойствам структуры.
//                       Например, "Код, Наименование, Родитель".
//            - Структура
//            - ФиксированнаяСтруктура - в качестве ключа передается
//                       псевдоним поля для возвращаемой структуры с результатом, а в качестве
//                       значения (опционально) фактическое имя поля в таблице.
//                       Если ключ задан, а значение не определено, то имя поля берется из ключа.
//                       Допускается указание имени поля через точку, но при этом параметр КодЯзыка для такого поля
//                       учитываться не будет.
//            - Массив из Строка
//            - ФиксированныйМассив из Строка - имена реквизитов в формате требований к свойствам структуры.
//  ВыбратьРазрешенные - Булево - если Истина, то запрос к объекту выполняется с учетом прав пользователя;
//                                если есть ограничение на уровне записей, то все реквизиты вернутся со 
//                                значением Неопределено; если нет прав для работы с таблицей, то возникнет исключение;
//                                если Ложь, то возникнет исключение при отсутствии прав на таблицу 
//                                или любой из реквизитов.
//  КодЯзыка - Строка - код языка для мультиязычного реквизита. Значение по умолчанию - основной язык конфигурации.
//
// Возвращаемое значение:
//  Структура - содержит имена (ключи) и значения затребованных реквизитов.
//              Если в параметр Реквизиты передана пустая строка, то возвращается пустая структура.
//              Если в параметр Ссылка передана пустая ссылка, то возвращается структура, 
//              соответствующая именам реквизитов со значениями Неопределено.
//              Если в параметр Ссылка передана ссылка несуществующего объекта (битая ссылка), 
//              то все реквизиты вернутся со значением Неопределено.
//
Функция ЗначенияРеквизитовОбъекта(Ссылка, Знач Реквизиты, ВыбратьРазрешенные = Ложь, Знач КодЯзыка = Неопределено) Экспорт
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты, ВыбратьРазрешенные, КодЯзыка);
	
КонецФункции

Функция ПолучитьКоличествоКомплектов(ЗаказПокупателя) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗаказПокупателяЗапасы.Номенклатура КАК Номенклатура
	                      |ИЗ
	                      |	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КомплектацииПоУмолчанию КАК КомплектацииПоУмолчанию
	                      |		ПО ЗаказПокупателяЗапасы.Номенклатура = КомплектацииПоУмолчанию.Номенклатура
	                      |			И ЗаказПокупателяЗапасы.Характеристика = КомплектацииПоУмолчанию.Характеристика
	                      |ГДЕ
	                      |	ЗаказПокупателяЗапасы.Ссылка = &Ссылка
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ЗаказПокупателяЗапасы.Номенклатура");  
	Запрос.УстановитьПараметр("Ссылка",ЗаказПокупателя);
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат.Количество();
КонецФункции  

Функция СоздатьДокументыКомплектации(Основание) Экспорт
	МассивКомплектаций = Новый Массив();
	
	ЗапасыККомплектации = ПолучитьИзВременногоХранилища(Основание.АдресТовары);
	
	Для Каждого Запас Из ЗапасыККомплектации Цикл 
		ДанныеДляЗаполнения = Новый Структура();
		ДанныеДляЗаполнения.Вставить("Основание",Основание.Основание); 
		МассивЗапасов = Новый Массив;
		МассивЗапасов.Добавить(Запас);
		АдресТовары = ПоместитьВоВременноеХранилище(МассивЗапасов);
		ДанныеДляЗаполнения.Вставить("АдресТовары", АдресТовары);
		НоваяКомплектация = Документы.КомплектацияЗапасов.СоздатьДокумент();
		НоваяКомплектация.Дата = ТекущаяДатаСеанса();
		НоваяКомплектация.Заполнить(ДанныеДляЗаполнения);
		НоваяКомплектация.ЗаполнитьТабличнуюЧастьПоКомплектации();
		НоваяКомплектация.Записать();
		МассивКомплектаций.Добавить(НоваяКомплектация.Ссылка);
	КонецЦикла; 
	
	Возврат МассивКомплектаций;

КонецФункции     

#КонецОбласти
