Функция РеквизитыЗаказа(Заказ) Экспорт
	
	РеквизитыЗаказа = Новый Структура();
	РеквизитыЗаказа.Вставить("Организация", 	"Организация");
	РеквизитыЗаказа.Вставить("ЗаказПокупателя", "Ссылка");
	РеквизитыЗаказа.Вставить("Префикс",			"Организация.Префикс");
	РеквизитыЗаказа.Вставить("Номер",			"Номер");
	РеквизитыЗаказа.Вставить("ДатаДокумента",	"Дата");
	
	РеквизитыЗаказа 	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Заказ, РеквизитыЗаказа);	

	НомерДокумента  	= ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(
		РеквизитыЗаказа.ДатаДокумента,
		РеквизитыЗаказа.Номер, 
		РеквизитыЗаказа.Префикс);
		
	ДатаДокумента 		= Формат(РеквизитыЗаказа.ДатаДокумента, "ДЛФ=DD");

	ШаблонЗаголовка		= НСтр("ru='Заказ покупателя № %1 от %2: Создание заказов поставщикам'");
	ЗаголовокПодборки	= СтрШаблон(ШаблонЗаголовка, НомерДокумента, ДатаДокумента);

	РеквизитыЗаказа.Вставить("ЗаголовокПодборки", 		ЗаголовокПодборки); 
	РеквизитыЗаказа.Вставить("СпособПополнения",  		"Закупки");
	РеквизитыЗаказа.Вставить("СформироватьПриОткрытии", Истина);
	
	Возврат РеквизитыЗаказа;
	
КонецФункции
