#Область ПрограммныйИнтерфейс

#Область РаботаСФормойПанельАдминистрирования

// Дополнительные переопределяемые действия с управляемой формой в Панели администрирования БПО
// при событии "ПриСозданииНаСервере".
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма настройки оборудования
//  Отказ - Булево - Отказ создания
//  Параметры - Структура - Параметры операции
//  СтандартнаяОбработка - Булево - Стандартная обработка
//
Процедура ПанельАдминистрированияПриСозданииНаСервере(Форма, Отказ, Параметры, СтандартнаяОбработка) Экспорт
	
	ДобавляемыеРеквизиты = Новый Массив();
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИспользоватьОбменСПодключаемымОборудованиемOffline", Новый ОписаниеТипов("Булево")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИспользоватьОбменСКассойMinikassir", Новый ОписаниеТипов("Булево")));
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	Форма.ИспользоватьОбменСПодключаемымОборудованиемOffline = Константы.ИспользоватьОбменСПодключаемымОборудованиемOffline.Получить();
	Форма.ИспользоватьОбменСКассойMinikassir = Константы.ИспользоватьОбменСКассойMinikassir.Получить();
	
	Элементы = Форма.Элементы;
	
	Элемент = Элементы.Вставить(
		"ОфлайнОборудованиеПодключено", 
		Тип("ПолеФормы"), 
		Элементы.ГруппаУправлениеОфлайнОборудованиемПерваяСтрока,
		Элементы.ОткрытьОфлайнОборудование);
	Элемент.Вид                  = ВидПоляФормы.ПолеФлажка;
	Элемент.Заголовок            = НСтр("ru = 'Обмен с офлайн-оборудованием'");
	Элемент.ПутьКДанным          = "ИспользоватьОбменСПодключаемымОборудованиемOffline";
	Элемент.ПоложениеЗаголовка   = ПоложениеЗаголовкаЭлементаФормы.Право;
	Элемент.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	Подсказка            = НСтр("ru = 'Использование правил обмена с оборудованием. 
							|Необходимо для использования офлайн-касс, прайс-чекеров и весов с печатью этикеток.'");
	Элемент.РасширеннаяПодсказка.Заголовок = Подсказка;
	Элемент.РасширеннаяПодсказка.Ширина = 39;
	Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_ПриИзмененииРеквизита");

	РежимРаботы = Новый ФиксированнаяСтруктура(УправлениеНебольшойФирмойПовтИсп.РежимРаботыПрограммы());
	Если РежимРаботы.МодельСервиса И Форма.ИспользоватьОбменСКассойMinikassir Тогда
		Элемент = Элементы.Вставить(
			"ИспользоватьОбменСКассойMinikassir", 
			Тип("ПолеФормы"), 
			Элементы.ГруппаУправлениеОфлайнОборудование);
		Элемент.Вид                  = ВидПоляФормы.ПолеФлажка;
		Элемент.Заголовок            = НСтр("ru = 'Обмен с кассой ШТРИХ-MPAY-Ф'");
		Элемент.ПутьКДанным          = "ИспользоватьОбменСКассойMinikassir";
		Элемент.ПоложениеЗаголовка   = ПоложениеЗаголовкаЭлементаФормы.Право;
		Элемент.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
		Подсказка            = НСтр("ru = 'Обмен с автономными кассами ШТРИХ-MPAY-Ф. Вместе с этой опцией будет включена опция Розничные продажи.'");
		Элемент.РасширеннаяПодсказка.Заголовок = Подсказка;
		Элемент.РасширеннаяПодсказка.Ширина = 39;
		Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_ПриИзмененииРеквизита");
	КонецЕсли;
	
	Элементы.ГруппаПечатьЭтикетокИЦенников.Видимость = ПолучитьФункциональнуюОпцию("ПечатьЭтикетокИЦенников") И НЕ ПолучитьФункциональнуюОпцию("ИспользоватьСтаруюОбработкуПечатиЦенников");
	
	УстановитьПривилегированныйРежим(Истина);
	Если Не Константы.ФункциональнаяОпцияИспользоватьПодключаемоеОборудование.Получить() Тогда
		Константы.ФункциональнаяОпцияИспользоватьПодключаемоеОборудование.Установить(Истина);
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Дополнительная настройка доступности при изменении реквизита формы
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  РеквизитПутьКДанным - Строка
//
Процедура ПанельАдминистрированияУстановкаДоступности(Форма, РеквизитПутьКДанным) Экспорт
	
	Если РеквизитПутьКДанным = "ИспользоватьОбменСПодключаемымОборудованиемOffline"
		Или РеквизитПутьКДанным = "" Тогда
		ОбменДоступен = Форма.ИспользоватьОбменСПодключаемымОборудованиемOffline;
		
		Элементы = Форма.Элементы;
		Элементы.ОткрытьОфлайнОборудование.Доступность = ОбменДоступен;
		Элементы.Группа_ОфлайнДополнение.Доступность = ОбменДоступен;
	КонецЕсли;
	
КонецПроцедуры

// Позволяет заполнить пользовательские команды на Панели администрирования
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Команды - см. НастройкиПрограммыБПО.ТаблицаКоманд.
//
Процедура ПриЗаполненииКомандПанелиАдминистрирования(Форма, Команды) Экспорт
	
	Элементы = Форма.Элементы;
	
	
	ИспользоватьНовоеРМК = ПолучитьФункциональнуюОпцию("ИспользоватьНовоеРМК");

	Группа = НастройкиПрограммыБПО.НоваяГруппаПанелиАдминистрирования(Форма, "Группа_РабочиеМестаДополнение", Элементы.ГруппаРабочиеМеста);
	Группа.ОтображатьЗаголовок = Ложь;
	
	Команда = Команды.Добавить();
	Команда.ГруппаФормы   = Группа;
	Команда.Важность      = "Важное";
	Команда.Представление = НСтр("ru = 'Настройки РМК'");
	Команда.Подсказка     = НСтр("ru = 'Настройки рабочего места кассира.'");
	Если ИспользоватьНовоеРМК Тогда
		Команда.Обработчик    = "e1cib/command/ОбщаяКоманда.НастройкиРМК";
	Иначе
		Команда.Обработчик    = "e1cib/command/Справочник.НастройкиРМК.Команда.НастройкиРМК";
	КонецЕсли;
	
	Группа = НастройкиПрограммыБПО.НоваяГруппаПанелиАдминистрирования(Форма, "Группа_ОфлайнДополнение", Элементы.ГруппаУправлениеОфлайнОборудование);
	
	Команда = Команды.Добавить();
	Команда.ГруппаФормы   = Группа;
	Команда.Представление = НСтр("ru = 'Правила обмена с оборудованием'");
	Команда.Порядок       = 50;
	Команда.Подсказка     = НСтр("ru = 'Правила для выгрузки информации о товарах в офлайн кассы и весы.'");
	Команда.ИмяФормы      = "Справочник.ПравилаОбменаСПодключаемымОборудованиемOffline.ФормаСписка";
	
	Команда = Команды.Добавить();
	Команда.ГруппаФормы   = Группа;
	Команда.Представление = НСтр("ru = 'Настройка диапазонов SKU весового товара'");
	Команда.Порядок       = 80;
	Команда.Подсказка     = НСтр("ru = 'Для весового товара необходимо назначить диапазон SKU, который будет использоваться на весах в качестве кода товара.'");
	Команда.ИмяФормы      = "ОбщаяФорма.НастройкаДиапазоновSKU";
	
	Группа = НастройкиПрограммыБПО.НоваяГруппаПанелиАдминистрирования(Форма, "Группа_ФЗ54");
	Группа.Заголовок = НСтр("ru = 'Изменения 54-ФЗ'");
	
	Команда = Команды.Добавить();
	Команда.ГруппаФормы   = Группа;
	Команда.Представление = НСтр("ru = 'Подключить кассы к оператору фискальных данных'");
	Команда.Порядок       = 50;
	Команда.Важность      = "Важное";
	Команда.Подсказка     = НСтр("ru = 'Сервис  «1С-ОФД» обеспечит удобное подключение ваших касс к оператору фискальных данных без наценок к официальной стоимости услуг ОФД.'");
	Команда.Обработчик    = "http://v8.1c.ru/cnt.jsp/:kd_roz:/https://portal.1c.ru/applications/56";
	
	Команда = Команды.Добавить();
	Команда.ГруппаФормы   = Группа;
	Команда.Представление = НСтр("ru = 'Все о 54-ФЗ и переходе на онлайн-ККТ'");
	Команда.Порядок       = 80;
	Команда.Важность      = "Важное";
	Команда.Подсказка     = НСтр("ru = 'С 1 июля 2017 года можно будет использовать только те ККТ, которые передают данные о продажах в ФНС через оператора фискальных данных (Федеральный закон 54-ФЗ).'");
	Команда.Обработчик    = "http://v8.1c.ru/cnt.jsp/:kd_roz:/http://v8.1c.ru/kkt/";
	
КонецПроцедуры

#КонецОбласти 

#КонецОбласти