	
#Область СлужебныйПрограммныйИнтерфейс
	
Функция ПолучитьВыгружаемыеДанныеЖурналаУчетаСчетовФактур(Ссылка, УникальныйИдентификаторЖурнала) Экспорт

	ДокументОбъект = Ссылка.ПолучитьОбъект();
	
	ВыгружаемыеДанные = ДокументОбъект.ВыгрузитьДокумент(УникальныйИдентификаторЖурнала);
	
	Возврат ВыгружаемыеДанные;

КонецФункции

#КонецОбласти

#Область НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС
// Возвращает признак доступности тарифа страховых взносов ИП для участников СЭЗ
// п. 1.3. ст. 430 НК РФ
//
// Параметры:
//   Период - Дата - Проверямая дата доступности тарифа
//
// Возвращаемое значение:
//   Булево
//
Функция ПрименяетсяТарифУчастникСЭЗ(Период) Экспорт
	
	// Федеральный закон от 04.08.2023 N 427-ФЗ
	ПериодДействия = Новый Структура;
	ПериодДействия.Вставить("ДатаНачала", '20230101');
	ПериодДействия.Вставить("ДатаОкончания", '20251231235959');
	
	Возврат Период >= ПериодДействия.ДатаНачала И Период <= ПериодДействия.ДатаОкончания;
	
КонецФункции


// Возвращает признак доступности тарифа страховых взносов ИП для военных пенсионеров
// п. 1.4. ст. 430 НК РФ
//
// Параметры:
//   Период - Дата - Проверямая дата доступности тарифа
//
// Возвращаемое значение:
//   Булево
//
Функция ДоступенТарифДляВоенныхПенсионеров(Период) Экспорт
	
	// п. 1.4. ст. 430 НК РФ
	// ИП, получающие военную пенсию, уплачивают страховые взносы на ОМС в размере 19,8922% от совокупного фиксированного размера страховых взносов
	
	ДатаНачалаДействия = ДатаНачалаДействияТарифаДляВоенныхПенсионеров();
	
	Возврат Период >= ДатаНачалаДействия;
	
КонецФункции

// Возвращает дату начала действия тарифа страховых взносов ИП для военных пенсионеров
// п. 1.4. ст. 430 НК РФ
//
// Возвращаемое значение:
//   Дата
//
Функция ДатаНачалаДействияТарифаДляВоенныхПенсионеров() Экспорт
	
	// Письмо ФНС России от 18.09.2023 № БС-4-11/11858@:
	// тариф действует с момента вступления в силу Федерального закона N 257-ФЗ с 24.06.2023
	Возврат '20230624';
	
КонецФункции
#КонецОбласти
